{
    "podcast": {
        "title": "Polygon Alpha Podcast"
    },
    "episode": {
        "title": "The Emergence of Crypto Intelligence | Arkham Intelligence | Miguel Morel | Polygon Alpha Podcast",
        "number": "25",
        "date": "March 10, 2023",
        "description": "\n    Polygon Alpha Podcast - Episode 0025 - March 10, 2023\n\n    Miguel Morel - CEO of Arkham IntelligenceLinkTree - https://linktr.ee/polygonalphapodcast\n\n    YouTube -   \n\n     / polygontv  \n\n    Apple - https://podcasts.apple.com/us/podcast...\n\n    Spotify - https://open.spotify.com/show/11KnYQk...\n\n    RSS feed - https://api.substack.com/feed/podcast...\n\n    Arkham Intelligence\n\n    Arkham is an intelligence platform that provides information on the real-world entities and individuals behind crypto market activity.Capabilities - Some things you can do with Arkham:\n\n    See the entities & individuals behind pseudonymous crypto wallet addresses\n\n    See what top traders/investors are doing in real time & using historical data\n\n    Predict future market movements by using on-chain data to track the flow of funds\n\n    Track your portfolio and historical performance\n\n    Conduct due diligence\n\n    Conduct research on & observe illicit fund flows - on-chain sleuthing\n\n    Inform your research & reporting using real-time on-chain data & analytics\n\n    Features - The platform is currently in Beta & is constantly evolving with new features added regularly\n\n    Entity Page: See a complete view of the activities of any entity or address. You can view their portfolio, historical balances, exchange usage, P&L, and top counterparties, as well as a list of transactions which can be sorted and filtered\n\n    Visualizer: Translate raw, blockchain transactions into clear network maps.\n\n    Dashboards: Build & share unique dashboards of these entities and addresses.\n\n    Filtering: You can filter and sort transactions across the platform to only see what you want to see. You can filter and sort by: time, counterparty, token, token amount, & USD Value.\n\n    Alerts: Set custom alerts for on & off-chain activity & view their history against pricing & other important signals\n\n    Explorer: Full block explorer. View specific details on any transaction.\n\n    ~~~~\n\n    Thank you so much for watching the video, if you’ve not subscribed to the channel please do! We’ll continue to bring new videos to you!\n\n    Polygon offers scalable, affordable, secure and carbon-neutral web3 infrastructure built on Ethereum. Our products offer developers to create user-friendly applications #onPolygon with low transaction fees and without ever sacrificing security\n\n    Polygon official channel:\n\n    Website: polygon.technology\n\n    Twitter: twitter.com/0xPolygon\n\n    Telegram Community: t.me/polygonofficial\n\n    Telegram announcement: t.me/PolygonAnnouncements\n\n    Reddit: www.reddit.com/r/0xPolygon/\n\n    Discord: discord.com/invite/polygon\n\n    Facebook: www.facebook.com/0xPolygon.Technology/",
        "url": "https://www.youtube.com/watch?v=15xrqqAnGMY"
    },
    "speakers": {
        "0": "Justin Havens",
        "1": "Miguel Morel"
    },
    "transcripts": [
        {
            "speaker": "0",
            "podcast": "Hello, everyone. Welcome to the Poly alpha podcast. Join us as we explore the latest trends innovations and strategies in this exciting world of to decentralized finance in Web three. Our guests are experts and thought leaders in the industry, sharing their insights and experiences to help you better navigate this rapidly evolving crypto landscape. And I'm your host, Justin Havens, a aka crypto, so sit back, relax, and let's get started. Today, we are joined by Miguel More, the Ceo of ark Intelligence, an early stage startup at the forefront of the rapidly expanding crypto intelligence industry. Miguel, thanks for being here with us today. How's everything going on your end? ",
            "start": 0,
            "end": 43.22092
        },
        {
            "speaker": "1",
            "podcast": "Thank you, Justin. ",
            "start": 43.938763,
            "end": 44.81612
        },
        {
            "speaker": "0",
            "podcast": "Things are great. Doing well. You're in Argentina right now? I think you told me. So what's what's going on there? What brings you to Argentina? ",
            "start": 45.29468,
            "end": 52.144524
        },
        {
            "speaker": "1",
            "podcast": "Well, actually, this one's actually a bit of of a coincidence. Well, number one, Argentina is huge for for Crypto overall. You know, obviously, a market with with high inflation, they they they really love crypto down here. And so there's plenty of of crypto companies and and partners to to interact with. But also as a hobby, I I actually play Polo. And Argentina is, like, the the capital of of a force around the globe And so right now, it's actually summertime down here because they're in the southern hemisphere. And so it's a good place to to to work and to to, you know, play sports and and and relax a little bit. ",
            "start": 53.097218,
            "end": 93.91119
        },
        {
            "speaker": "0",
            "podcast": "During the the winter in the northern hemisphere. Wow. Miguel, the Polo player starting off with some pretty great trivia. What what is, like your backgrounds? Like, and how did you get into the crypto space? That's always good for just the base layer ",
            "start": 95.36057,
            "end": 108.13796
        },
        {
            "speaker": "1",
            "podcast": "information? Yes. So my background is so I grew up in Philadelphia and then I moved to the Bay area to start my first start up. I ended up working on a project called reserve protocol, which is a stable coin company actually focused on hyper hyperinflation economies. Argentina being one of those that that was a target market. And so that's actually how I got my my initial start into the world of cryptocurrency and trading and trying to find use cases. Then in twenty twenty, I founded Ark with my founder, Henry. And then after that, we essentially, you know, got started building out, but we wanted to call kind of like a piece of software for total crypto intelligence. So essentially, it would be one platform where you could look up any individual any company any trading firm. You would be able to see what their cryptocurrency activity looked like. Across any different chain. So rather than just going on to a singular block Explorer and looking up a ethereum address and then try and see what the activity behind it was. You could actually look up a person or look up a company and then see, like, their cryptocurrency history across multiple different chains. And you could use that for, you know, ecosystem development. If you're if you're a startup, you'd see it see people who are using your token, But additionally, you could use it for, you know, training diligence, assessing counterpart party risk if you're looking at exchanges wallets for example. And so that was a kind of high level vision and we've been working on it for the past three years. Oh, that's incredible. And, yeah, with your with your previous project, reserve protocol, ",
            "start": 108.59251,
            "end": 211.73729
        },
        {
            "speaker": "0",
            "podcast": "Was there anything that you did at reserve protocol that made you think, wow, I think you know, something like Ark Intelligence would be very beneficial to the ecosystem Or I don't know Like, are there any lessons that you learned with reserve protocol that you took forward with you? As an entrepreneur in the Web three space when developing ark intelligence. ",
            "start": 214.11514,
            "end": 234.67183
        },
        {
            "speaker": "1",
            "podcast": "So that's a great question. I think the most valuable kind of takeaway and was valuable lesson is there's a bunch of infrastructure in the traditional startup landscape, you know, traditional syntax and so on. Where you have the ability to learn more about your customer, and you have the ability to understand their use cases, understand their, you know, demographics, understand more about your market, more about your customer and what it is they're doing with with your cryptocurrency. Or or with your startup and whatever application you built. However, in the cryptocurrency, ecosystem overall, especially if, you know, if you have a coin that a bunch of people are using, and it's just, you know, an E c twenty token, you actually don't have as much information about what people are doing. You don't have as much information about who those people are. And therefore, you have, you know, less power to actually target particular use cases, target particular kinds of individuals who maybe want to market to and so forth. And so I think overall, like, an important lesson that that that was a really big takeaway for me was there are a ton of crypto projects at the time and still to this day who are very eager to learn more about their target markets, earn learn more about their existing customers, get user analytics. But the infrastructure for that... For cryptocurrency, in particular just didn't really exist. And so that was one of the major takeaways for for for why Wanted to saw based on some of those initial learnings. Yeah. And ",
            "start": 238.17929,
            "end": 336.5111
        },
        {
            "speaker": "0",
            "podcast": "what do you think are like, some of the most prevailing use cases for this type of technology that Ark is providing because it is very difficult to read data on chain I guess, like, for the average user, Yeah, What are your thoughts there? So in general, ",
            "start": 337.20428,
            "end": 354.63498
        },
        {
            "speaker": "1",
            "podcast": "I think the the main kind of use case is is exploring blockchain data. I think that's that's the best way to to kind of think about it. However, as you mentioned, the current sort of block explorer landscape and an ecosystem is not necessarily the the easiest thing for people to use especially if they're not crypto. And so for many people, when you're thinking about activity of any kind of asset environment, purchases, sales, etcetera. You are generally thinking about that in terms of people and companies. You're saying, you know, person x, bot y, you know, trading firm z bought x or, you know, company you know, a, sold b, You don't think about it in terms of these, like, pseudo synonymous addresses. Right? You don't you don't think about it in terms of alpha alpha numeric. And so What we're trying to do is actually make cryptocurrency data much more readable? Is the number one. And then second to that, we're actually trying to make it significantly more accessible. And so it's not just a problem of leg eligibility and how easy it is to to to just go in and understand cryptocurrency information. The other thing that's very important is actually the ability to do that without background, technical knowledge and technical skill and domain specific, you know, pieces of technology. Right? So you don't need to, you know, know a sequel in order to to use our We don't need to understand blockchain architecture you just need to know what a search bar is and know what it is you're looking for, and you can get to to the relevant ",
            "start": 355.65497,
            "end": 448.78412
        },
        {
            "speaker": "0",
            "podcast": "information and response. Yeah. That's that's really interesting. So I mean, how is Ark just making it easier to read this chain data for the for the average user? So the way in which it becomes easier is ",
            "start": 449.23898,
            "end": 461.6973
        },
        {
            "speaker": "1",
            "podcast": "and and for this part, I can kinda get into a little bit of our background technology because it'll explain you know, the data that is currently available to people now and then what we do with it in order to transform it into something that's much more useful. So the the the kind of first piece of this is actually collecting all of the the information. So we only use publicly available data most of which exists on on chain. And so we run our own, you know, infrastructure in order to collect that information and collect that data. So rather than just looking at raw blockchain information, we take that, we clean it up and we started in our database. Afterwards, we then attempt to find attribution or labels. And so that is essentially just the business of taking that alpha numeric address and then attaching the name of a individual or a company on it. And then afterwards, we put it all into one platform in a seamless interface that people can use to then just search for the labels and tags and metadata that lives on top of the actual rob block chain data information itself. And so when people aren't are not using Ark. But instead just like using a block explorer, they're actually querying and looking at block explorer, specific, you know, information and blockchain specific information. Without necessarily having any, like, labels or metadata or tags on top of it versus when they use Arc come, it's not just that kind of base foundational layer which you might find another platforms and and services. But rather you get a bunch of the information on top. Which may it a lot easier to understand? Who are the people behind these transactions? What are they doing with the money? And and is this part of a pattern? Is it, you know, an individual transaction? And then we add other kinds of, you know, capabilities to do to do research such as, you know, for example, our visualize feature. Many people like using that in order to not have to look at transactions via list view, but it says see it as part of, like, kind of like broader network analysis. ",
            "start": 462.32657,
            "end": 585.7325
        },
        {
            "speaker": "0",
            "podcast": "And how do you feel like this type of transparency benefits the ecosystem as a whole? Or do you feel like maybe it's too much? No. I definitely think it's incredibly beneficial. I mean, you know, ",
            "start": 586.6243,
            "end": 598.77545
        },
        {
            "speaker": "1",
            "podcast": "there are so many examples unfortunately, of cases where it would have been incredibly useful to know exactly what was going on and a particular service or at a company or you know, an exchange in order to understand, like, okay. What kind of risk am I taking on by associating with this counterpart party? Like, you know, either I'm trading with them or I'm holding funds there or, you know, we're working together in some capacity. I have exposure to this entity. How can I actually, you know, manage and mitigate risk by assessing what their sort of on chain portfolio looks like on chain risk, on chain activity in order to better understand, like, what I'm actually getting myself into? So as a whole, I actually think it's super important to be able to know what other people are are are are doing if you're intending to trade with them or custody with them or. You know, a variety of these different use cases. But but, you know, that can be very difficult when, you know, though the data is trans is transparent, it can be very opaque. So, you know, you can get access to it, but it can be difficult to understand what's actually, you know, what what's actually going on. And I think that in many ways, this is, you know, having access to this kind of information than letting people make their own decisions is, you know, a better outcome then let's say something like, you know, ",
            "start": 599.9723,
            "end": 678.1921
        },
        {
            "speaker": "0",
            "podcast": "massive amounts of regulation. Yeah. That that makes sense. And I think like, in my mind, there seems to be almost like a paradox in the space. Maybe Paradox isn't the right word to use here. But definitely like conflicting ideals where, you know, you have some people that say crypto should be transparent. That's one of the benefits. However, it is still difficult to read that data on chain, which Ark helps with. But they also have people that say, well, we actually need more privacy features on the blockchain. For this mass adoption. So I don't know. In your mind, like, how do you grapple with these I guess, conflicting ideologies within the crypto space? ",
            "start": 679.0687,
            "end": 718.4716
        },
        {
            "speaker": "1",
            "podcast": "I think in general, you you kind of have people in crypto who get broken down into two camps. The first are the idea logs, who are like really big believers in let's say, like, I don't know. Crypto libertarian and and and and and privacy preserving technologies and so forth. And the other camp people is actually just those who believe that it's a more efficient financial and it's like a good way to make money. It's a good way to, like, transfer funds, but it's not really something that's, like ideological and they're not really looking for privacy tools. I think that both of both of these communities can can exist in tandem for for a very long time. If not, forever, though I think that the second camp of people, those people who are in it mostly just because it's very efficient and for the utility. If it has not already, it'll eventually be, you know, one thousand ten thousand x larger than like the ideological privacy preserving group. And one kind of anecdote that that I like to sort of provide here is actually the example of the Internet, So I think the Internet and its trajectory historically have have had very similar outcomes to the ones I think Crypto will have. Which is that it starts small, starts niche starts within, like, a very technologically advanced group of people on, like, mailing lists and and, you know, who are somewhat, you know, kind of libertarian and, you know, are interested in this kind of beautiful new technology that can, you know, potentially take over the world. And then eventually, you know, it kind of grows beyond that to a more you know, nor group of people in the case of the Internet, it grew to everyone. In the case of Crypto I think still there... There there's still a good tie between the Og and the current, you know, users. I don't think like everyone's grandma is using Crypto yet. However, as it gets to that stage, the idea logs will will matter less and less. And I think that like the Internet, Crypto will continue to have privacy preserving technologies. I mean, the Internet has, for example, you know, the tour browser, or you can use a Vpn. And there are more lightweight versions as well. I know some people use, like Brave, For example, it's kind of like a lightweight version of of protecting your data and so on. But the reality is that, like, Google crashes all of those companies in terms of just like, raw number of of users and how many people are actually familiar with it, use the product on a daily basis. And I think we might have something analogous for for crypto where, like, Em and exists and, you know, Z cash exists and there... These, like, so called privacy tools. But they won't be, like, very widely adopted is my is is my prediction. It'll end up being very similar to something like... You know, using a tour browser or or brave, where, you know, it's just kind of people who are very obsessed with, you know, their particular, like interests. And to everybody else like it just doesn't matter. ",
            "start": 719.1226,
            "end": 899.4164
        },
        {
            "speaker": "0",
            "podcast": "Yeah. I think I think that makes perfect sense. And I think you're right. Think probably at the beginning of this cryptocurrency blockchain movement, we definitely did have a lot of that I guess, like libertarian, crypto and na capitalist type of id logs who were like the core of the space, but as the space continues to grow and mature. I think that they right. You know, there's there's room for different ideals and those conflicting opinions. And I think that helps the space grow quite a bit as well. And I mean, and that's the thing with, like, this open source permission list technology is that anyone can use it for whatever reason they see fit as long as it, you know, adhere to the code. And you know, I think, you know, and that also draws in those malicious actors as well, which which we've talked about a little bit. And, you know, I think it's a lot easier to have the benefit of hindsight, typically, which helps us to identify those malicious actors in the space But do you think there's anything that we can look for on chain that maybe could help us to identify those potential malicious actors in the space without that benefit of hindsight? ",
            "start": 901.49384,
            "end": 977.9678
        },
        {
            "speaker": "1",
            "podcast": "Yeah. Definitely. So, you know, one of the kind of key pillars of what we're attempting to do at Ark is, you know, not just doing kind of what what we've previously described as retroactive. An analysis or retrospective analysis. So, you know, like like you just said, there's kind of always the benefit of hindsight of, oh, you know, this thing collapsed and it had, like, ten billion dollars in it. Like, let's look back in the time machine and, like, see, you know, what exactly like, went wrong here and it's like, okay. Well, you know, maybe that helps build, like, a legal case, but nobody's getting their money back its gone. And, you know, we want to move past that. To a more kind of proactive, you know, response to to this kind of these... These kinds of dealings. And so the most important thing is just awareness, awareness and, you know, analysis, in a real time. So, you know, I recommend that people go and and they use all of the available tools at hand, hopefully, Ark is one of them. And you can go in and you can analyze all of these different services, smart contracts, project treasuries, and we as an industry can start holding people, you know, accountable. For their activity and we can start holding them accountable for, you know, what it looks like they're doing on chain versus what their public claims are. Right? Companies and and and and people and project vendors are constantly making public claims and and public statements you know, their current position and the kinds of activity that they engage in and, you know, how many funds they have and so forth. You know, look on change. Look and make sure that, you know, what they're saying is is is is correct. You know, go on to these projects, use our alerting feature. Right? We have the ability for able to set alerts on, you know, activity that they might consider to be anomalous for any given entity on the Arc platform. So for example, you know, you can set an alert for a project treasury and see if it starts getting drained. Right? And so set alerts for all of these different things and actually you know, be an active guardian and Steward of of all of these different projects. And obviously, if you see anything suspicious, say something, raise it to the community, and then hopefully it can be uncovered ahead of time before there's too much damage. I guess, like, how do you differentiate yourself ",
            "start": 979.7225,
            "end": 1114.7494
        },
        {
            "speaker": "0",
            "podcast": "from your competitors at Arc intelligence. Like, I think, you know, in my mind, first thing I think about is, like, Na is very similar or even chain analysis is very similar. Like, how do you compare and contrast yourself to those other projects? ",
            "start": 1115.0599,
            "end": 1130.7866
        },
        {
            "speaker": "1",
            "podcast": "So I I kinda break up the the analytics market into a couple different sectors. Number one is the actual, like, regulatory and compliance players. And those would be sort of, like, the more chain analysis like companies that that you just described, where, you know, the main differentiator is they are incredibly focused on like, government and regulatory and compliance use cases. Whereas we are not. Like, we are built for crypto traders. Like trade people who trade crypto and he's speculating on crypto and who are making investments. Those are the people who use Ark, and those those are the people for whom we built. You know, for government and other sorts of things, like we'll leave that to the other players. But for now, like, it's all crypto specific market. And so there, there's almost like kind of like a a question of of target market is like one big one. I mean think, the second big thing is is business model. So, you know, those companies tend to have, like large services contracts or or consulting like models. Whereas we are, like true software, Saas. Right? So we're we're only building software, you don't have to talk to anybody you can do all the work yourself. There's no onboarding process. There's no sales pitch. It's just you going on and, you know, using a piece of software just as you would use. Let's say, trading view. For example, and so that's another kind of major difference in terms of business model. The other big kind of type of company that exists for blockchain and analytics would then be the more consumer facing ones. And that would be, you know, a variety of them have surfaced, you know, let's say, like M, Dune, Na, you know, and they all have their own different characteristics and and attributes. I think, you know, I won't speak towards some of the other projects, but, like, at least what I think makes ark them the most special. Is just our ability to have that in ind and entity analysis. So the ability to search for people and to search for funds and to search for exchanges is by name, and then see all of their addresses aggregated in a single place across blockchain chains in one single kind of portfolio view. I think that's super powerful. And I think it's the main thing that actually differentiates us from the wet rest. I think we actually have, you know, really great branding and a great community as well. And so I think, you know, that's that's been wonderful too. And I think many people really appreciate that from us. Yeah. Absolutely. And ",
            "start": 1131.5168,
            "end": 1277.04
        },
        {
            "speaker": "0",
            "podcast": "you know, kind of in the same vein of talking about chain analysis and how closely they work with governments. Just kinda wanna get your thoughts on you know, in your mind, what are some of, like, the prevailing attitudes that you see from governments in regards to just the blockchain technology in general and just... ",
            "start": 1277.3538,
            "end": 1297.615
        },
        {
            "speaker": "1",
            "podcast": "Broadly speaking, I think that you know, many of the the different governments around the globe still have a very cautious view towards cryptocurrency. I think it's it's an outdated view. And mostly, that's because, you know, those those people aren't users. They're not actual, you know, cryptocurrency, you know, d gen or not people who use D defy. They they, you know, aren't web three enthusiasts And so many of them still have this kind of almost like twenty thirteen, twenty fourteen silk road view of crypto where you know, it's only used exclusively for illegal activity and, you know, anybody who uses crypto must be a criminal or Else I'll say it wouldn't be using it. That's kind of like the overall sense that I get from some of these individuals. But, you know, it's is bin very often, you know, discusses. I think a lot of it is just education. I think it's just that, you know, they they're they aren't really that online. They're certainly not crypto users. And so they they only understand what they saw in the news almost ten years ago. And they haven't really like evolved from that position. They... They've just heard that it's getting bigger. Right? And so they don't fully actually even understand what what they're dealing with necessarily. And so I think that it's our job as an industry to try to educate as much as possible, not just government, but kind of the mass market as a whole and eventually, it'll, you know, make its way down and trickle down to to the government. And and and then we'll have a more educated kind of, you know, regulatory class. ",
            "start": 1299.855,
            "end": 1400.0255
        },
        {
            "speaker": "0",
            "podcast": "But for now, I think, like, overall very apprehensive. Yeah. I think, especially in the Us. You can definitely fill, you know, the the abrasive approach to I guess the regulatory environment in general on this industry. But I know you travel a lot. I know I've seen you give talks in, you know, Europe, you're in Argentina right now, How do you feel about any differences or can you just kinda not imitate any of the differences in the Us's approach to the regulatory environment versus maybe that of Argentina or or in the Uk. Because I think most people in the Us, which is where I live, think that you know, anything that happens in crypto in the Us is happening everywhere in the world. And I I don't think that's necessarily the case based on the conversations that I have with people on a daily basis. Yeah. So what what are your thoughts there? The Us ",
            "start": 1401.1372,
            "end": 1458.3346
        },
        {
            "speaker": "1",
            "podcast": "is is interesting in the sense that We have the the federal government. I'm American. So I I understand the Us, you know, really well. We have our our kind of federal system made up of states, which I think makes a really big difference compared to other kinds of countries. Right? I mean, you know, you're from Texas. You guys are basically your own your own country and, you know, consider yourselves to to be kind of your own thing, and there's been plenty of public statements from the governor and, you know, others who are super pro crypto were cowboys, if you were. If you want exactly. So, you know, I think, like, in general, that sort of attitude will lend you to to be more like pro bitcoin, more in favor of, like, taking money away from, you know, the government... The federal government's hands, and and it's like a cultural thing almost. Right? Mean, Texas is is, you know, even, you know, bigger than like France. Right? It's it's bigger than some of the countries in some of these other places. And so there's kind of like the high level, you know, view of of of crypto in the United States, which is, you know, the federal. Viewpoint and that would be, like, the Sec, for example, and so, you know, there's the Sec, view have stuff, and then there's, like, everything else. Then there's, like, what the individual states think and then even on... You know, so there's, like, what the Sec thinks? Then there's, like, what the Texas governor thinks or what Texas thinks? And then you can even get lower than that down to, like, the mayor level? Like, what does, like, the Miami mayor or think about crypto and, like, is that relevant for, you know, Miami people. So all these things are different? And they all have different levels of impact. But by far, obviously, like, in terms of hierarchy, the Sec and the Chairman Gen, take precedence over over everything else. Right? And that view is very hawk ish. That view is very like, okay. Listen like, you know, on a on a very high level, you know, we think that, you know, cryptocurrencies need to make more disclosures and, you know, we need to make sure that investors are protected. And, you know, I agree. I agree with those with with those statements. I do think there should be more disclosures. I do think you know, there should be more in investor protection. But the reality is that the way in which they're trying to go about this is, you know, kind of like, rule by enforcement rather than rule by, you know, law. Right? And so as a whole, the way they're they're trying to enforce things. Is actually by just going out suing people, arresting them, subpoena them. Rather than putting out very clear laws, very clear guidance about what it is, the critical cryptocurrency community should be doing as a whole. Whatever they're issuing tokens or, you know, bringing on new customers. This attitude is very different from other kinds of countries. So for example, like, I know the United Arab Emirates where I've spent a little bit of time. You know, they they have way more clear guidelines or like, okay. Here's here's what you can and can't do. Here's what you can and can't issue. If you do issue, you need to make these kinds of disclosures and you need to file an application with this particular entity. Once you do all of that, then, you know, you don't have to pay corporate taxes because we're a zero tax country and we wanna make sure that we can bring in the best talent. If you want to hire you know, people here in the Uae. You can, you know, sponsor them for a golden Visa. Like, everything is just incredibly clear, and it it makes it so much more of a better market to operate in because you're not constantly worried about regulatory risk and the fact that that things aren't certain. I saw a really great quote from somebody basically saying, like, you know, many people in the federal government are trying to make it seem like crypto people break the law just to break the law, and it's not true. Crypto people are trying their best and they're getting their opinions from a variety of different sources, different kinds of regulatory bodies, securities, lawyers, startup lawyers, corporate lawyers, so many different people The reality is that it's all conflicting information. And and then it's just, you know, kind of a game of whack mole about whether or not a regulator gonna come after you because they're, you know, specific bespoke rules you know, you didn't fall to the team because they weren't clear about it. And so I think that makes the Us kind of like a a worse place to start a coup company. Compared to actually starting one in somewhere like the Uae or or Singapore, for example, are both kind of like, very big crypto hot ",
            "start": 1458.7135,
            "end": 1725.4971
        },
        {
            "speaker": "0",
            "podcast": "right now. So it sounds to me like you would say that Singapore and the Uae are might be the best place from a cryptocurrency policy perspective. ",
            "start": 1725.89,
            "end": 1734.3701
        },
        {
            "speaker": "1",
            "podcast": "Currently. Is that fair to say? I think from a cryptocurrency policy perspective, just pure policy not taking into consideration anything else. I think the Uae or yeah. The Uae and and Singapore are very great options in terms of regulatory clarity. Now as an entrepreneur, of regulatory clarity is not the only thing that you're optimizing for naturally for for you personally or for for your company. Though, you know, maybe that's what the regulators would want, but, you know, the reality is that that's not what you're optimizing for. And so as a whole, When you're analyzing things holistically, I actually think like the United Kingdom is probably one of the better places to to to founder a crypto company. I think you know, it has really great quality of life as a very good kind of, you know, civil law procedure, You know, it's a very kind of, you know, safe place very clear rules, very clear guidance, but it's also a very nice place to live and to visit. And and there's plenty of capital all there, plenty of crypto talent, a little bit more western than some of the other places if you're coming from America, I think, you know, If you're coming from the middle east, the Uae is a great place and very familiar If you're coming from Asia, Singapore is a really great place and Very familiar. If you're coming from the west, and I think the Uk is actually a really great option. ",
            "start": 1735.2644,
            "end": 1815.6433
        },
        {
            "speaker": "0",
            "podcast": "Awesome. Thanks for those insights. And you kinda touched on something that goes into my next question. And that is, you know, when you're looking at terra labs and Celsius and F t x and voyager and I don't know, Silicon Valley Bank in the just the current regulatory environment in general. What is it like being an entrepreneur in the web three space? Like, does it does the thought ever come up, you know, like, why bother? ",
            "start": 1817.8765,
            "end": 1845.3993
        },
        {
            "speaker": "1",
            "podcast": "So this question is there are multiple ways to to tackle it. I think you know, the most important thing as an entrepreneur is just to be focused on your business and more importantly, to be focused on your own users and your customers because ultimately, that's what's going to make you succeed. However, you also have to understand that you know, they're gonna be other players who are in your space, who might kind of, you know, make your space look worse or make it more difficult to fund or, you know, so on and so forth or who you might be taking on counterpart risk with? And so those are the two most relevant kind of problems. I guess, I would say with with all the companies that you just mentioned. A, they made the reputation as a whole worse because when people think about industries they think about their worse offenders and not about their best. And then two, many of those people are, you know, counterpart parties to a bunch of others in the cryptocurrency space and could have been counterpart parties to us even though they weren't, you know, thankfully, we we didn't have exposure to any of the major players that that you just mentioned or that collapsed. But I know people who who were counterpart parties to those. And so the way to think about it is, you know, you're in an industry where there are a ton of land mines all over the place where you're constantly having to assess people constantly having to do diligence understanding what people's activity, it looks like in order to to to understand and mitigate your counterpart party risk. It's for that exact reason that we created Ark in the first place. So that people can do better research about who they're interacting with and the bad actors, in order to have these negative consequences not come about so frequently. ",
            "start": 1846.2881,
            "end": 1948.583
        },
        {
            "speaker": "0",
            "podcast": "Yeah. And, you know, maybe taking a step back from the regulatory environment for a little bit. Just in general, what trends are you paying most attention to in the crypto space right now? Like, what's what's catching your eye? What do you feel like everyone else should be paying attention to? ",
            "start": 1950.818,
            "end": 1971.8002
        },
        {
            "speaker": "1",
            "podcast": "I think I think by far, the the most important thing that people should be paying as attention to is d defy. And all of the different services that are coming about from from these ecosystems. Like, When I think about crypto, and when I think about, like, why I believe this industry is going to eat a substantial portion of the, you know, existing traditional financial system. It's because of D defy. It's not because of anything else. It's because of, you know, layer two's like Poly. It's because of you know, you know, decks like like uni swap, For example, Like, these are the kinds of players and and services that make it all worthwhile and that make transmitting money between people much easier. And that's kind of like the whole the whole point of cryptocurrency rights? To be able to custody your own funds, truly custody your own funds without this kind of like Silicon Valley Bank style like, oh, man, maybe my deposits are gone. Kind of situation. And then second, to be able to move that money as you please cheaply, if not for free very quickly at any time of the day that you want. To whoever you want. Right? That's the kind of fundamental purpose of cryptocurrency and D defy is fulfilling that vision to the fullest. ",
            "start": 1973.9678,
            "end": 2051.6904
        },
        {
            "speaker": "0",
            "podcast": "So I would say Defy. Well, as a big fan of the Defy ecosystem, especially a big fan of the Ecosystem on Poly gon, I really appreciate that answer. So thank, Miguel. And what about, like the the traditional finance space? Like, do you see the traditional finance system, further integrating into the D defy ecosystem or the Web three space in general. And what do you feel like that timeline ",
            "start": 2052.2654,
            "end": 2077.9546
        },
        {
            "speaker": "1",
            "podcast": "looks like. The most important thing that traditional finance is for right now is on an off. That's like the most important thing. If not, the only thing that's, like actually relevant for the traditional, you know, financial world. And and cryptocurrency right now because people wanna cash out and they need, like, pay rent and stuff. And so that's why they that's why we care about t in general. So I think that two things are very likely to to happen. I think like, out of the majority of, you know, worlds and majority of cases where, you know, something where crypto actually survives and thrive. There are only true outcomes. Number one, it completely replaces the, you know, your digital financial system. And so that means like we don't have to fee on an offer anymore People are just crypto native. And d five by default. Right? Is kind of how how I like to how I like to describe it. You know, you just never had to touch a Bank of America ever again. And can go fully, you know, full like kind of digital revolution again, like, it used to be the case that when people were moving money around, it was always in physical cash. At some point, it became that ninety eight percent of all money was transferred electronically, and that was like a big innovation and a big change in behavior. And I think that the same thing will happen with Crypto. Where at some point, we will go from, like, ninety nine percent of transactions happening in T. To some overwhelming share of it becoming, you know, d defy native, and then it just gets replaced entirely. The second option that I think is very likely is actually just like segregation. There will be the people who only use Crypto and then there will be the people who only use traditional financial systems, and they will remain, like separate in the same way they are now. And maybe, like, the crypto ecosystem just grows a whole bunch more, but then that doesn't mean that we necessarily lose all the legacy financial infrastructure that already exists. Now I'll point out that the difference between world one and world two as I just described them is one is where the cryptocurrency ecosystem completely eats tried. And the other is one where it just exists in parallel as like this, like, ultimate system that is available for people to use. But it doesn't mean that it completely kills it. And more importantly, it doesn't mean that they necessarily integrate either. I think like full integration is probably like one of the less likely outcomes for the cryptocurrency ecosystem just because it's not in the best interest of all of the current existing players and is almost also contradictory to, you know, the wishes of of regulators. And so it'll either take that whole world by storm, or it'll just exist on its own separate from it. Without being able to be shut down, but that doesn't mean it necessarily integrates. ",
            "start": 2078.8994,
            "end": 2263.0415
        },
        {
            "speaker": "0",
            "podcast": "Yeah. I think I think I definitely agree with you there You know, I think that, you know, there's still people who use snail mail versus email. And it works. It's it's it's the appropriate means of communication in some instances. Right? There's some people who still write checks instead of using Bit mo or crypto or just like Z or all these other bank transfer functions that you can do. And so, yeah, I think it also comes down to like the adoption of this these technologies to like, I was at with some friends last night, and I kind of compared crypto today to, like, Internet, like maybe in the mid or early eighties where you you basically had to be a developer to send an email to somebody, and that's kinda how it feels right now when you're interacting with Meta mask. But, you know, what I... I'm a huge Ui ux Maxi in the bear market right now. And I've started to see a lot of innovations on the wallet side of things that are kind of pushing people maybe to, like, the Aol moment, if you remember that, where it just... It made things a lot easier for people to interact with this electronic mail communication. And so I feel like that's what we're building in the bear market right now is this ease of use, and I think y'all are doing that at Ark them as well, making the blockchain easier to read for individuals as well. So bullish on the bear market from a building standpoint, but I I also wanna get your opinion on, you know, what's business like in the bear market. For for an entrepreneur, you know, what are you seeing on the venture capital side of things? Maybe just like some anecdotal sentiment and then maybe like even like some on chain info as well? ",
            "start": 2265.1875,
            "end": 2371.4734
        },
        {
            "speaker": "1",
            "podcast": "So there are a couple different ways to think about that. Number one is you know, fundraising. Number two is, like actually like, customers moving around money. I think the first one is easier to than the others, which is that though we have not gone through another fundraising around since, like, bear market started. I think, like, overall, anecdotally, I... I've just heard that, you know, changed it a lot, and it's now just like, way more difficult to actually be be able to do. And even though there's there's actually a little bit of of, you know, disconnect there because there's also a ton of dry powder and people need to, like, invest a lot of money that they raised during the bowl. It it's still, like tightened up in terms of the amount that's actually being deployed. So that's number one. Number two, is then actually, like, you know, customer spending, Tv, things of that nature. You know, I think the crypto market capitalization is you know, fallen a lot, I think that's very clear. That doesn't mean that it's not going to grow more in the future. That being said, I think way more money is moving to places that matter like D defy. And so as a whole, like, the overall amount of money moving around in the in in the ecosystem as part of services rather than just buying and holding. I think has gone up. By percent. And the last thing is like, you know, even more relevant is just we're still growing really fast. We have a ton of users, bunch of people love us. ",
            "start": 2372.192,
            "end": 2454.8374
        },
        {
            "speaker": "0",
            "podcast": "Despite, you know, there being a bear market. So there will always be that kind of like, heart of the crypto community that continues to grow and and and and build. Yeah. Absolutely. I mean, I was at Denver last week. There's twenty five thousand people at least that showed up a lot of developers, a lot of hype in the industry. Regardless of what the price section is doing. Price section is one thing people coming to the space, bringing in their brain power in building new exciting products, that's a completely different story, which is what I am continuing to see. And we have just like a few more minutes left, and there's a couple questions I just wanna get to before we sign off. So I wanna get a tutorial, maybe from the expert, Miguel. What are some key indicators that you're looking for or you feel like other people should be looking for when they're using Arc intelligence? Like, what do you get excited for when you get on the platform form and what do you focus on when you're using Arc outcome? I think in number one is I always like sitting and going through the the top entities scroll. ",
            "start": 2455.8062,
            "end": 2524.059
        },
        {
            "speaker": "1",
            "podcast": "So whenever you log to Arc for the first time, you know, without clicking any other buttons, it it shows you a list of what we describe as top entity entities, so that's people who have the most crypto net worth on chain across the different chains that that we support. And it's just like a rolling list of all of these, like big time whales and crypto and people are very important. And so you can click on any one of those buttons in order to see a bigger breakdown of their portfolio and they're activity. And so that's like one kind of like source of alpha, which I think is, like, really cool. Just being able to see, like, good cave. These are like, the biggest people like in crypto. And I can just click on them to see what their recent trades transactions and, like, portfolio looks like. If that existed for for equities where I could like, on a minute by minute basis exactly what trades the largest equities traders we're making, you know, it would be, like, revolutionary technology. And I think it... What we're building is revolutionary technology. It's just, you know, for crypto right now, you know, it's a big deal for crypto people, but maybe not for everybody else. Until Crypto takes over the world and then, you know, we one hundred excess of. Other than that, I think that some of the other, like, more important things that that people have been looking at is, you know, the exchange reserves. And so people can look at exchanges and other kinds of services to try to understand you know, what exactly their holdings look like relative to the amount of deposits have been made and the amount of backing that they state that they need. Actually verifying those things on chain by looking at those entities can be incredibly useful as well. ",
            "start": 2524.6304,
            "end": 2617.113
        },
        {
            "speaker": "0",
            "podcast": "You got me a little excited for that, Miguel. I'm gonna have to go check that out here. Probably right when we sign off of this conversation. So one more question, the most important one in my opinion is where can people go to find out more about you, Miguel and ark intelligence? ",
            "start": 2619.753,
            "end": 2637.1328
        },
        {
            "speaker": "1",
            "podcast": "So I I think the best way would probably be to to finance us on Twitter at Arc intel. I'm at Realm Mc miguel Morale. I mostly talk about Ark stuff. But also, you can search up our Youtube. We have plenty of tutorials and talks just describing what we do and and what we've built and and and and how you can actually use the platform. And so I think those are the two, you know, best places to look. Alternatively, you can also go on our landing page intelligence dot com, and it'll give you a bunch of information about media articles that have been written citing our data, you know, the the all of the different features of the platform, you can submit intelligence to us. If you have a label that maybe you want us to add publicly to the platform. And a bunch of other research that that we have put out. So Highly recommend checking all of that out. ",
            "start": 2639.062,
            "end": 2684.4214
        },
        {
            "speaker": "0",
            "podcast": "Amazing, amazing And Miguel, thank you so much for joining us on the show here today. I hope you enjoy your time in Argentina, and I hope that I don't know. You win your polo match They matches? Are they games? But. Alright There are matches mostly training, but there there are matches. Thank you, Justin. I really appreciate that. We're also really happy to be working with Poly gong. I forgot to mention that, But you guys are amazing and have been a pleasure to work with, and I'm really excited to be helping out all the users of the Poly ecosystem. I I totally agree. We're really excited to have y'all all in the Poly ecosystem. So thanks to everyone for tuning in to the Poly D defy alpha podcast. Hope you enjoyed today's episode and gain some valuable insights from Miguel More. About the exciting world of decentralized finance in Web three. Stay connected with us on Spotify, Youtube, Apple, and subs, and then we'll catch you all next time. Thanks again, We're. Thank you. ",
            "start": 2686.015,
            "end": 2737.075
        },
        {
            "speaker": "1",
            "podcast": "And ",
            "start": 2739.291,
            "end": 2739.3403
        }
    ],
    "summaries": [
        {
            "title": "1. Exploring Decentralized Finance in the Crypto Landscape",
            "summary": "In this episode of the Poly alpha podcast, host Justin Havens interviews Miguel More, CEO of ark Intelligence, about the crypto intelligence industry. They discuss trends and strategies in decentralized finance and Web three, offering insights for listeners. The text also mentions the impact of climate change on global food production and the need for urgent action. Additionally, Argentina is highlighted as a thriving market for cryptocurrency due to high inflation rates and its passion for polo. The founder of Ark Intelligence shares their background in cryptocurrency and their vision for a comprehensive platform. They also reflect on lessons learned from working on Reserve Protocol."
        },
        {
            "title": "2. Traveling to Argentina: A Hub for Crypto and Polo",
            "summary": "This text discusses the lack of infrastructure and tools available for cryptocurrency projects to gather user analytics and understand their target markets. Ark's technology provides a solution for the difficulty in reading data on the blockchain, making it more accessible for average users. The goal is to make cryptocurrency data more user-friendly and understandable, without requiring extensive technical knowledge or specific technology skills. Ark simplifies the process of reading chain data by collecting and cleaning up publicly available blockchain data, attaching labels and metadata to the addresses, and presenting the information in a seamless interface. This platform provides additional insights and makes it easier to understand patterns and relationships within the data."
        },
        {
            "title": "3. Building a Platform for Total Crypto Intelligence",
            "summary": "Transparency in the cryptocurrency ecosystem is important for accountability and trust, despite some concerns about invasion of privacy. Understanding on-chain activity is crucial for assessing and mitigating risks. The text explores the conflicting ideals of transparency and privacy in the crypto community, predicting that efficiency seekers will eventually outnumber privacy advocates. The author compares the growth of the cryptocurrency movement to the internet, suggesting that privacy-preserving technologies may exist but won't be widely adopted. Proactive analysis and accountability are emphasized, with the use of tools like Ark to monitor and report suspicious activities. The text also discusses the differences between Arc Intelligence and its competitors, highlighting its focus on crypto traders and unique features like entity analysis."
        },
        {
            "title": "4. Lessons Learned from Reserve Protocol for Ark Intelligence",
            "summary": "This text discusses the varying attitudes of governments towards blockchain technology and cryptocurrency. Some governments are embracing blockchain and exploring ways to integrate it into their systems, while others are more skeptical and cautious. The lack of understanding and experience with cryptocurrencies often leads to a cautious view and association with illegal activities. The text also highlights the decentralized nature of cryptocurrency regulation in the US, with the Securities and Exchange Commission (SEC) holding a dominant position. It compares the regulatory environments of different countries, with the United Arab Emirates and Singapore being considered the top choices for cryptocurrency companies due to their clear regulations. The United Kingdom is also mentioned as a good choice considering quality of life and access to capital and talent. The text raises the question of whether the challenges and uncertainties of operating in the web three space may lead entrepreneurs to question the value of their efforts."
        },
        {
            "title": "5. The Challenges of Obtaining User Analytics in the Cryptocurrency Ecosystem",
            "summary": "This text discusses the challenges and potential of cryptocurrency and blockchain technology. It highlights the slow adoption of crypto and the importance of user interface advancements to make it more accessible. The bear market has made fundraising difficult, but the industry is still growing rapidly. Thorough research and due diligence on counterpart parties are crucial to mitigate risks. The creation of Ark aims to identify bad actors in the industry. DeFi services are revolutionizing the financial system by providing full control over funds and enabling cheap transactions. The integration of traditional finance into the DeFi ecosystem is discussed, but full integration is unlikely due to existing players and regulatory concerns."
        },
        {
            "title": "6. The Importance of Ark's Technology in Data Analysis",
            "summary": "The text discusses the growth of the crypto community despite a bear market, emphasizing the importance of innovation and brain power. It mentions the use of Arc intelligence and its features, such as providing insights into successful crypto investors and verifying exchange reserves. The technology developed by Arc has the potential to revolutionize equities trading. Various sources are provided to find information about Arc Intel. The text also mentions Miguel More's excitement about working with Polygong and the Poly ecosystem in decentralized finance. Lastly, it highlights the disruptions to global food production caused by climate change and the need for urgent action to address food security."
        }
    ]
}