{"podcast": {"title": "Polygon Alpha Podcast", "host": "Justin Havens", "image": ""}, "episode": {"title": "Liquid Staking on Polygon with MaticX | Stader Labs | Amit Gajjala | Polygon Alpha Podcast", "number": "11", "date": "AUG 18, 2022", "description": "", "url": "https://www.youtube.com/watch?v=15xrqqAnGMY", "speakers": {"0": "Justin Havens", "1": "Amit Gajjala"}, "file": "august18.mp3"}, "transcripts": [{"speaker": "0", "podcast": "Hello, everyone. Welcome to the Poly Alpha podcast, where the Poly gun community gathers insights from today's leaders into centralized finance. ", "start": 0, "end": 7.2622104}, {"speaker": "1", "podcast": "Crypto in web three. I'm your host, Justin Havens, A aka Crypto. Let's get started. Crypto ", "start": 7.6746774, "end": 14.99}, {"speaker": "0", "podcast": "On today's installment of Poly alpha, we are joined by the c founder of State Labs, Ami. ", "start": 21.902275, "end": 27.115}, {"speaker": "1", "podcast": "Ami, thanks for being here with us today. How's everything going? ", "start": 28.395, "end": 30.875}, {"speaker": "2", "podcast": "Thanks a lot, Justin for having me here. Things have been great. Recently moved to Toronto getting used to the the Canadian lifestyle, so things have been great so far. I've heard that people are just very, very friendly in Canada. Have you had that experience? Yeah. Definitely everybody is quite helpful here and weather is nice for the next three months. So I'm having a great time here. ", "start": 31.529, "end": 56.180492}, {"speaker": "1", "podcast": "That's great. Yeah. Welcome to North America. You came from India. Correct? Like, what prompted you to move to Toronto? Yeah. So I was I was living in Bangalore. ", "start": 57.22877, "end": 65.56648}, {"speaker": "2", "podcast": "Before moving to Toronto. My wife is doing a post doc fellowship here at Toronto General hospital. So we are here for a year because Oh, that makes sense. Okay. ", "start": 66.05968, "end": 76.142746}, {"speaker": "1", "podcast": "Well, I thought it it was something crypto related, but it's something not crypto related. But so what is your background in crypto? Like, how did you get to be where you are today as the c founder of state labs? Yeah. So ", "start": 76.861755, "end": 89.66779}, {"speaker": "2", "podcast": "I was walking in Web two, I was leading I was leading strategy and transformation at one of India's food delivery startups called vicki. And during that during the... During my last year, At Su, I was intrigued by the D defy revolution that was going on, in multiple financial applications and non financial applications that were getting built on the blockchain as a base technology was really inspired by the the kind of application that were built. And then I got together with my cofounder S that, who was pretty much into mining since the since the two thousand eleven, twelve days, and then he got into staking as well. So got together with him, explored a bunch of areas and realize that staking is gonna be a huge potential market opportunity. And we started s in June last year. And then after that, it was it was a crazy ride as as always things with crypto. Right? Like, I mean, people say that crypto never sleeps. And we've never slept after that. It's been such a such a crazy and adventure has ride since we started this this company called s labs. We initiated our journey on on Terra blockchain, and everybody knows what happened with t after the collapse of Usd. However, it was a great experience and the rates peak. We had about sixty thousand users who was taking with us on terror across our several solutions and about a billion dollars of total value of assets, stay to us. And we and very quickly, we expanded to four more blockchain beyond data within a span of about a few months. We expanded to Poly gong. We expanded to fan term head. Right now, we have also launched our liquid taking solutions on near as well as B b. Overall. Even today, we have about close to about ninety million dollars of total value us and stake on a platform. Yeah. And I think typically, when you see ", "start": 90.20467, "end": 213.54138}, {"speaker": "1", "podcast": "protocols and projects move from chain to chain. It's typically E compatible chain to E compatible chain. But that's not necessarily the case with state or labs? Like, have you run into any issues with that? Or would it be just so much easier for you y'all to stick to E compatible chains? So I would... It it would have been definitely easier to stick to E compatible chains. ", "start": 214.17368, "end": 236.9873}, {"speaker": "2", "podcast": "But even within E compatible change, the the way taking is kind of architect on these changes is quite different. For example, stake is very different on it what's just taking on Mat. Right? On mat, taking actually happens on eats while the entire files is on Poly side chain. Right. And similarly on B b to b. So those are Bs c finance smart chain is E compatible. The actual taking happens on the bin chain. So these are all complexities even within the E chains In fact, I would say us chains are more simpler in terms of how staking is staking architecture is designed. Like, for example, that I had, like, single chain where the staking used to happen directly to the valid and similarly, Sol. ", "start": 238.43684, "end": 286.6133}, {"speaker": "1", "podcast": "That's interesting. And let's take a step back real quick and just can you explain to us in your own words, you know, what is staking when it, you know, in regards to layer one block chains and why is taking ", "start": 287.25177, "end": 298.98886}, {"speaker": "2", "podcast": "necessary? Yeah. Absolutely. So if we if we just go back in time and sort of figure out how consensus was reached in Bitcoin network? It was primarily through proof of work. The bitcoin miners have to solve a it's solve a difficult problem. Either Brute force or some way to get to a block production. Right? To be eligible for actually adding a block to the blockchain. As how things used to work in the bitcoin network. Now the staking a proof of stake was an advancement over that. Proof of work technology where instead of using computing power to solve a problem. People actually pledged their capital. And these people are having about node operators, pledged their capital in the native tokens to secure the network. In participating in block production and consensus mechanism. Right? Why was why was this an advancement? Now you don't have to like, you you don't need to have, like, these large computing powerhouse houses, gu energy. Right? It's about... It's a little more... It's a lot more energy efficient and capital efficient that way, where your node operators kind of pledged their assets. And depending on the amount of assets that they have pledged they get an offer the... They get an opportunity to produce the blocks or add blocks to the network. Right? It's a probable if the probability is dependent on the amount of capital that they are pledged. Now what happened was there was a slight advancement over proof of stake, then emerged a delegated proof of stake where anybody that held crypto tokens in that native currency can also participate in taking by simply deli their tokens so. Or the node operator. Right? Because everybody will not have the wherewithal with Run and node. Right? Because it requires technological skills in. And, yeah, A lot of a lot of geek stuff that even I I'm am not familiar with. So since everybody cannot run a node operator. So this is this was a very convenient way for users or anybody who had crypto tokens to just simply take with that valid and on return on top of that for providing their crypto to the valid. It also helps the valid now because they don't have to like source all the capital themselves, they can actually rent the capital from the existing users who held these tokens. And you said that ", "start": 299.52264, "end": 444.84628}, {"speaker": "1", "podcast": "you know, proof of steak was an advancement over proof of work. So do you feel like proof of stake, consensus is superior to that proof of work consensus. ", "start": 445.23953, "end": 454.8377}, {"speaker": "2", "podcast": "What what are your thoughts there? So there are seven dimensions. I wouldn't say it is completely superior over proof of work. There are certain advantages and disadvantages to proof stick. Right? Advantages are One, it doesn't need a lot of computing power, which means it's a lot more energy efficient. Two, you don't need to you don't need to be extremely technologically savvy to run all of these compute... The the machines that can solve these difficult problems in a brute force. We that the the kind of barriers to entry that existing proof of work kind of got torn down in the case of a proof stake. Right? Even running nodes, like, I can... I can probably run notes from bell bare metal server that I have at home. So that kind of reduce the barrier to entry for these node operators. And at the same time, the delegated proof of state was even a further advancement on top of it. Now I don't even as a valid. I don't need to have a ton of capital that I myself have to. Delegate. I can rent capital from somebody and still participate in the consensus of the network. Right? So while these are the advantages. Of course, the disadvantages are probably a little more centralized than the proof of work because typically, the wealth to distribution is a little more centralized. Right? When you take traditional finance as well as crypto. So it kind of this is one of the disadvantages of Proof of state I would say. So one of the different... Or one of the disadvantages in your mind is that ", "start": 455.47504, "end": 544.8275}, {"speaker": "1", "podcast": "I guess takers in a proof of steak system, lack cell pressure as opposed to... In the proof of work system. Right? You have to sell your block reward in over to cover, like electricity expenses, operating expenses in general. Yeah. I... Yeah. That's the... Yeah. I mean, do you feel like that's a valid criticism? ", "start": 545.6191, "end": 565.33453}, {"speaker": "2", "podcast": "So it's valid or not valid depends on the perspective that an individual. Right? I think I think both of these technologies are quite young. I think only time will tell whether proof of state leads to a lot more centralization versus proof of work. So far it's been proved you've you've you must have seen that most of the real state networks are a lot more centralized when it comes to knock motor efficient than the Bitcoin network. Right? But I think over a period of time as these, l ones take necessary steps to mitigate the centralization. I think probably proof state networks would have circumvent that disadvantage. Right? One more advantage that I forgot to mention is obviously the transaction throughput is quite high, which is great right. And it kind of enables a lot more applications that approval of work networks cannot. ", "start": 566.53174, "end": 622.342}, {"speaker": "1", "podcast": "And I think it also, you the proof of steak consensus mechanism also gives the opportunity with the delegated proof of steak and with liquid staking providers like state labs. It gives more users and more individuals, opportunities to participate in the network and receive a portion of those block rewards where not only, I think in the proof of work system, do you have this technical hurdle that you have to get over, but also there's like a a a huge capital expense that you have to get over as well to run these you know, asic mining rigs. So so like, who's doing the staking on the fruit steak consensus networks. Is it mainly retail or institutions who are doing the staking? What are you seeing? ", "start": 623.87195, "end": 670.0817}, {"speaker": "2", "podcast": "I think staking is quite popular both among retail as well as institutions, right? A lot of institutions typically participate in plain vanilla taking, which is just delegate their tokens to a valid data. Because of their inherent risk parameters. So they're staking generally with the valid, they're not taking additional smart risk. While retail is a little more comfortable taking the smart contract risk and also utilizing the opportunities that can give them higher yields with liquid taking tokens. Institutions have been traditionally a little farther away in terms of the adoption journey. Breaking that is changing slowly. As as more... As as a lot of these... I mean, like, for example, state labs, we started very, very slow on Poly. Now we are out about thirteen million dollars of Mad state with us. Slowly lot more whales and institutions are taking notice of this. We are comfortable because the contracts have been there for more than four, five months now. No no major. Nothing nothing happened with respect to the security We have alberta a couple of audits and a huge bug bounty program running through. Right? And most of the things are safe. Now it give it gives them a little bit of comfort to try out these new solutions because it also gives them access to yield opportunities across the other d five protocols. ", "start": 672.32196, "end": 758.75183}, {"speaker": "1", "podcast": "One, I think another benefit to using a a liquid staking service like yourself as opposed to a user doing the staking on their own, like we talked about, you know, there's there's technical hurdles that the user has to overcome. But also, when you're staking on state labs or Rocket pull or L o, you're also receiving a a token in turn that represents the the amount that you have stake on the network through that protocol, which is another benefit, because then you can then use that state token, I guess, asset or receipt, it connects as a receipt in my mind. To use in defy protocols. So can you talk about, like, the importance of that? And why is that so important to, I guess, retail and institutional D defy users? ", "start": 759.4033, "end": 809.8806}, {"speaker": "2", "podcast": "Yeah. So a quick background on taking, especially on networks like Poly or it or any kind of network. Right? So when when users actually take their tokens to a valid, their tokens are locked And what that means is they can... If they want to immediately take out their tokens. It's not possible. There's always a waiting period or an onboarding period. Right? And on Poly, it's typically two to three days on other networks like Sol savanna, it's about three days on Bin, It's about seven two. Fifteen days, etcetera. Right? And each each network has its own type of implementation of this onboarding period. Now if a user have... If a you can user wants to speculate on the price of mat, while being state, it's not possible because the token is locked to the valid. Or if a user wants to use this state position to actually collateral and take out a loan, That's not possible. Because it's locked. Right? He doesn't have... And and it's not comp to use the state position as he's on a lending protocol because the lending protocols cannot liquidate it in case the price goes on. So hence, there was a... There... There's an advancement called liquid staking. Where when you stake, when the user takes this traditional... His his native token. What protocols like us or Lidar or socket pool, etcetera, give us a representative token that kind of represents the underlying state capital. For example, on Mat, we give out a token called mat x, which increases in value as we claim and the rewards. And at the same time, Mit x has the secondary markets across had protocols or Am like balance or, quick swap or, etcetera, mesh swap, etcetera, on on Poly. Where users can actually swap these mat cakes and get to Mat and then probably sell their mat. In case they wanna speculate on the price of the mat in the short term. Alright? This enables them to earn taking rewards using Mat while also giving them the flexibility to exit. Without the onboarding period. That is the primary advantage of liquid taking. The secondary advantage is the advantage of providing Lps on Am. Right? So users can pay matt and matt and provide that as a as an Lp nlp on on any of the exchanges that I had mentioned earlier here. And they for providing that, they own transaction fees, they also own dual incentives that are given out by the decks as well as standard platform. Right? So that's that's a great advantage. Then the third advantage is because Mat x is, like, just like any other token on the Poly network. It can be integrated with several lending markets or or for that matter Of the derivatives protocols etcetera that are some of some are some are Live one Poly like the delta markets and some more are coming soon. It can be leveraged across all of these protocols. To enhance their positions. Right? They could go long on probably for... Like, take they could take out stable coin loan on huawei. Once Magic is integrated with Huawei. Of course, governance has to approve that. They could take out a stable coin or they could take out a automatic alone and state that mat, get mat x and then do that. Repeat loop to get into leverage it's taking. Or they could take out a stable coin loan and use that stable coin to get into a loan position on automatic. Right? So all these opportunities open up. Which are not possible if you were just doing a traditional state. ", "start": 811.64276, "end": 1043.4507}, {"speaker": "1", "podcast": "Yeah. And if I'm remembering correctly, there was this unique circumstance that happened a couple months ago where stake Ether, d from the actual ether price, but that didn't really happen with mat, you know, assets, Can you get into a little bit of detail why that why that did not happen with Mat? ", "start": 1044.0094, "end": 1068.8204}, {"speaker": "2", "podcast": "Yeah. I think the state is still a little bit defect? With respect to Eth, I think yesterday, when I checked it was trading at about point nine seven eight So a couple of reasons. It has nothing to do with the design of the token or the protocol, itself. Right? It has... It's a discount that the market is giving to steak teeth because the eat withdrawals time frame is not very clear, to anybody today. Though the merge... Test merge has been successful line. There is a there's an anticipation for the may net merge in around September. But the withdrawal time frame is not year. So that's why the market is discounting the stake to eat, because because of this time period time frame gap between withdrawals and when the it can be... When this... Delete can be exchange, one is to one with the e. What that means is basically, today, if I have to do an arbitrage between the actual contract that is taking it and the secondary market, which is probably c or ba, etcetera. Where the state is trading at a discount. That is not possible because there is no withdrawal that is enabled learning, That is the primary reason why the state is trading at a discount. On the other hand, with respect to mat, the withdrawal is possible. Going back to my earlier point of onboarding period of three days. So with an onboarding period of three days, I can buy the mat x that is available in case it Defects. I can buy that at a cheaper price. Come to the contract and take it and get mat at a higher price. So let's say, as a hypothetical example, Mat is trading at point nine Mat on balance answer. And and and the price of Mat is about one point one for every one Mat x, you probably get one point one Mat on state smart contract. A general user or a typical arbitrage can buy Mat x for point nine Mat come to s and then un unstable that Mat x for one point one Mat. So there is a very clear arbitrage opportunity that exists. Hence, these will come to equilibrium very quickly. Unlike a state either. ", "start": 1070.0164, "end": 1211.5201}, {"speaker": "1", "podcast": "Yeah. That makes sense. So it really is just like a liquidity issue in the market. Right? Like, if you if you're staking Ether, right now, it's unclear as to when you will be able to un stick that ever. Thus, the Eth the state Ether token trades at a discount. Right? Because even after the merge, I think there has to be another protocol upgrade to even allow for staking withdrawals on Ether, and then it it should be like a six month period after that if you wanted to withdraw. So I guess the market prices that at a a three percent discount. If you said it's pointing, it's trading at point nine seven, I guess. And the reason that it... That's not the case with Mat is because you can un uncheck Yeah. It takes about two to three days for that to be un stake. So, yeah. That makes that makes sense... And I think it's just good to lay out that foundation of, like how the market works in regards to arbitrage those types of steak assets. So state labs provide staking services to a wide variety of different chains. Like you said, like, Phantom, B and b Poly, Ethereum, terra, Terra two point o terra classic. And you said earlier We don't provide ethereum yet. Oh, when when do y'all all plan on providing that? ", "start": 1212.5723, "end": 1299.6323}, {"speaker": "2", "podcast": "We're working with Db player, this is a validated technology player to build a taking pool on top of them. So hopefully, you know, you know, month or two from now. So when we should we should have the solution ready. But again, it depends on the merge and the withdrawals. ", "start": 1300.2838, "end": 1318.0201}, {"speaker": "1", "podcast": "Right. Okay. I think I just saw it on your website, but maybe it was like a coming soon. Ethereum was coming. Yeah. Little teaser. Okay. That makes sense. But, yeah, And earlier, you said that rust based chains are a little bit easier from a sticking standpoint than the sal solidity E models, can you get into a little bit of detail why that is? I I haven't heard that before, So that's interesting. ", "start": 1318.5924, "end": 1341.8267}, {"speaker": "2", "podcast": "So it's not a generalized statement. It is a... I mean, what I meant was if you compare blockchain like Poly gun where the actual taking happens on ethereum. Right? And Poly is a different chain. Where you need to probably use a wormhole or a Pos bridge. To actually port your tokens from ethereum to poly. So if earlier if users have to forget about liquid taking earlier... Before liquid sync solutions, if users had to come in stake mat. They had to come to ethereum to stake their mat. There was no way for those users to stake mat on poly shape. Right? What that means is for a liquid taking player like us, We will have to build our contracts on on ethereum chain for mat taking. So the Mat x is a token that is given out on ethereum chain. Now that Mat x had to be ported to Poly chain. Right? So our first version of the solution was this where users had to come to Eat state there eat, get mat x and then use the bridge at mat mat Poly network. What we have introduced is simple shuttle between Poly and eth, where we mat x by taking our own mat. And created a pool on s website. So that users can directly take their mat on s Poly network. At the same price. What this what this enables them is they they can just save a lot of gas costs and a lot of time in bridging the assets and then staking it on ethereum. And did you build your own bridge for that solution? How we didn't build a bridge. It was a simple S that is run by a multi because we deployed our own capital, stake that. Took out Mit cakes, and then we keep shuffling this every couple of days. ", "start": 1342.6401, "end": 1465.01}, {"speaker": "1", "podcast": "Okay. But it's it's not a bridge necessarily jet to build, I guess, It's not a... We use the existing poly language bridge. What are some other, like, very unique challenges for staking on different chains? Like, what which chains are like the most technologically intensive and which ones are like, the easiest, I guess. I think ", "start": 1465.81, "end": 1484.3018}, {"speaker": "2", "podcast": "I think t was quite easy. Because there was one monolithic chain. Right? Where the valid were on the chain and... Staking was on the chain and d files is also on the chain. Right? Bin is definitely similar to Poly where staking happens on the chain. And the entire d five happens on the smart chain. Right? And and obviously, there there... I mean, we cannot build a smart contract on chain. What means is a lot of off chain, Cro jobs have to be done in an automated way. So that we take the user's funds, take it on balance chain, bring back the tokens. Think back liquid tokens and give it to them on smart chain. Okay. Interesting. So some of these states are definitely technologically. They're a little more ", "start": 1484.6754, "end": 1533.0398}, {"speaker": "1", "podcast": "complex because of the way they have their are design. Yeah. Okay. That that makes sense. And I know that y'all started out with Terra sticking on tara and I mean, what was it like being a staking provider on terra during this episode, I guess, this terror ", "start": 1533.4297, "end": 1550.677}, {"speaker": "2", "podcast": "collapse. Yeah. And so it was it was definitely hard for us because we had we had a good hot treasury on Anchor as well. Not full amount. Obviously, we were der risked across the stable coins. It was definitely a hard time for us from a business point of view as well as from a from a protocol point of view. Right? From business point of view, as I mentioned earlier, we had about a billion dollars of assets. Stayed on a platform and sixty thousand users. Right? And t was a very buoyant ecosystem and one of the strongest communities that was out there. So it was it was the the the incident was quite devastating for a lot of users. Unfortunately, because they had their life savings in Usd and You. Majority of them was wiped out as a result of the of the event. Even for us, as a as a protocol, it was quite if they were quite difficult times because the entire team saw the collapse of tv from probably a billion to just about a sixty million dollars in you know a matter of a couple of days. So it did impact their teams model morale quite a bit took us some time to just gather us together and sort of look forward and c aggressively across the other chains. Right? It was... In Hindsight, it was definitely a learning experience. One of the learnings is we could have we could have probably expanded a lot more aggressively to the other chains. ", "start": 1551.132, "end": 1641.6852}, {"speaker": "1", "podcast": "So, like I I guess, in hindsight, you would have hedge a little bit more? I guess, like, diversified your your services and your assets onto other chains. That's the lesson that you learned there. I mean, what other challenges have you faced like being a crypto related start. ", "start": 1642.4813, "end": 1659.7942}, {"speaker": "2", "podcast": "I think at the beginning, there were quite a few challenges. Right? Right? We've when we started out in March last year, they were just a handful of protocol that were being built out of India. And it was first very hard to connect with the right protocol founders and get advice on how to start how to structure the company, How do design go to market, how to find these smart contract developers and end marketers, all of these. Right? Pretty much the everything was a challenge back then. I would say, right? In terms of building the building the organization and building the protocol. Roughly, I think you've learned it over a period of time to how to source the developers and the right marketers. Now we have about thirty thirty engineers, majority of them protocol level. We have pretty solid marketers. We've one of the one of the, like, better known forms for generating the right kind of content and marketing on in in like, across the protocols. So we've learned our lessons some via mistakes that we've committed in some way intuition. ", "start": 1660.4296, "end": 1732.8298}, {"speaker": "1", "podcast": "Yeah. I've seen a lot of the content that your marketing team has been putting out, and it's it's top quality. So if you're listening to this, go follow state labs on Twitter and put your notifications on for them because it's it's very good content, not just about state or labs, but just about the Crypto ecosystem in general. It's it's very good. Thanks. Thanks a lot for the shower road just. Yeah. You know, happy to help. And I think another thing that's that's important for these staking protocols just to have a lot of utility for right? Like the the state asset token. And in your case, that's called matt x. I think, you know, people have the opportunity to become liquidity providers and indexes, they can borrow against it. There's a lot of opportunities there. And I know you kinda touched on this a little bit earlier, but I think it it'd be a good idea just to reiterate, you know, like, what are... What some of the other utility that users can do with their magic token on the... Well, on ethereum and on Poly. ", "start": 1733.4043, "end": 1797.5544}, {"speaker": "2", "podcast": "So majority of the utility is actually on Poly chain because that's where the mat D ecosystem is is more active. So essentially, today we have one should think of opportunities with Mat x and three dimensions. One is secondary markets where Mat x is traded with mat or stable coins. Right? So right now, we probably... We are integrated with almost all the xs on on the Poly ecosystem, including quick swap answer. Mesh swap and D dystopian, which is a new decks that has recently launched, where we have mat mat x pools. Majority of them still swap across d stop and balance answer where you you have very, very little slippage. Or across the grades. Right? Because this is these are peg assets. So one can provide mat mat cakes as Lp on these Texas. That's one opportunity and there are good amount of rewards some... In some cases, state of rewards in some cases dual rewards where the decks is also giving the rewards. Right? So this is this is a very interesting opportunity, especially given that dramatic taking rewards have gone down from ten percent over six point two or six point three percent. Right? The second set of opportunities are how can we leverage Mat cakes alone or the Mat Mat x help? So there's an interesting opportunity where one can lend Mat x and further get some yields on top of it on mesh swap. The other opportunity on shop is they can leverage their mat mat x pool, leverage up and earn further yields on top of the magic pool. Right? That's a second set of opportunity. The third... And obviously, we are also integrated with this options protocol called I think delta delta options market. Delta markets, where users can participate in call and put options on top of Mat x. So that's an interesting opportunity that exists. And the third set of opportunities will be unlocked soon. Recently, our chain Magic chain link Oracle has been deployed. Which means potential integrations with the lending markets across Poly, including Chi and once the governance approval is unknown now as well. So that's the third set of opportunities that will be unlocked, which will be very interesting. ", "start": 1798.2736, "end": 1953.9354}, {"speaker": "1", "podcast": "That's big news for any protocol I think to have, you know, the utility of that chain link oracle. Can you touch on that? Like, why is it so important to have that chain link Oracle for Medic x? ", "start": 1955.3826, "end": 1965.3535}, {"speaker": "2", "podcast": "Yeah. Absolutely. So chain just to for context, chain link oracle determines the price of that asset. Right? It in a decentralized way they always tell what the price of Mat is in stable or in Mat. Right? So we have that Oracle in place now. What that means is for lending markets, in case there is a huge drop in price of the native asset. Like Mat. They should be able to liquidate that position or they should be able to know what is the right time to liquidate that position. What that also means is now Mat x becomes comp comparable across these different different protocol types or lending markets and potentially, the futures, markets and options, markets that you open up in the in the near term. Right? So this helps with easier integration and they can manage the positions very easily. Right? Right? What it means is it unlocks a lot of potential utilities for Mit x. Examples are now users can do leverage it's taking with Mit x on the on on the isolated pools on Our. Once the governance has approved this particular Magic listing, similarly, users can probably put Magic access collateral and take out My as a low non head finance, which is by C out, etcetera. So all of these opportunities open up for Mit cakes, which is which are which are ultimately beneficial to the user because with Mat their earnings taking the words and on top of that it is enabling them to participate in defy opportunities generating higher yields. ", "start": 1966.0712, "end": 2065.0261}, {"speaker": "1", "podcast": "Well, that's exciting. I didn't know about the future Chi integration, pending governance vote, I guess, I used Chi out quite a bit, so I'll be looking forward to that. Think the gong is what has passed for man Finance. So it should be coming live. Okay. That's exciting. And let's talk about... You know, let's just do some comparisons to some of your, I guess, competitors in the space, like rocket pull and L and, I guess, Clay stack is also one. Like, how do you differentiate yourself in this you know, this like subs sector of the crypto space that is growing I mean, even like with like more centralized providers as well like with coinbase base. So a couple of things. One ", "start": 2065.6794, "end": 2107.5366}, {"speaker": "2", "podcast": "safety. So we are all, wherever we go, we at least do a couple of audits and a huge part bounty program. On automatic contracts are altered twice. So completely save we are fairly con we are very extremely confident of the quality and safety of this smart contract. And we also periodically keep doing several audits has as as the contracts mature, and we fix any of the... But any of the bugs that we encounter on a periodic basis. Right? Safety is top priority for us. The second one is enabling mat sites taking, where we have an instant pool that helps some of the retail users on the mat side avoid the gas costs and the pain of going... Like, transferring their tokens to through the bridge. Right? That is something that we have enabled on automatic side, right, no additional cost. Right. That's the second major advantage that we have. And the third is, like, our pace of integrations across the Mat ecosystem is... I think we probably have the highest number of integrations on Mat grids. Four indexes as well as all the lending slash as lending slash options protocols going like. Right? So the utilities is ", "start": 2108.803, "end": 2183.0774}, {"speaker": "1", "podcast": "quite high for Magic x already. Yeah. And then you also have the Sd token as well. Correct. When did that Sd token go live? Because I think last time you and I talked when I was with the index scoop and you were on the conversations the coup podcast? I don't think that that token had gone live quite yet. What is the utility and what does governance have control over within the protocol. ", "start": 2183.3896, "end": 2210.1953}, {"speaker": "2", "podcast": "So the Sd token had gone live, I think around end of March or this year. Which was basically... We we had a we had a public sale on coin list and a couple of months after that public sale is when we had gone life. Right. Right now the ex token is traded across Poly uni swap. Was and Poly uni swap as well as on several centralized exchanges. One of the major utilities or Token is obviously it is the governance token for the state of protocol. Once the governance ends engine's taking goes live. The major decisions that the Sd holders are going to W on or or or basically govern on or one, the major decisions like we change to operate how much it rewards to allocate. For each of these chains? The second major areas of governance are, what should be our valid selection. How should we actually think about exiting and reenter entering these valid because that's important. As that determines the yield at staking yield set we are able to generate. Right? So the second one. Third one is exercising the control on how should we how should we spend our ecosystem funds, How should we spend our treasury and all of these things? ", "start": 2210.673, "end": 2296.3013}, {"speaker": "1", "podcast": "Yeah. And I'm just kinda thinking, like looking out into the next, like, I I don't like to say five to ten years just that it seems like such a long time in crypto. But let's do, like the next, like two to three years like, what do you see for the future of staking? Like, what is that going to look like? Is it gonna be all institutions? I don't know. I just... A lot of questions I wanna get your thoughts. ", "start": 2297.0183, "end": 2320.6228}, {"speaker": "2", "podcast": "My sense is basically... So let's let's let's examine the factors that are going to probably change in the next three to... Three to four years. Right? One a lot of potentially, on the retail side, hundreds of millions, maybe a billion users will probably get on to crypto. Right? On the institution side, a lot of traditional institutions will probably own crypto assets and would want to use that, use the existing opportunities to put their assets to productive use. Right? They're probably going to not gonna go through the hassle of finding out who the right valid are, what are the risks inherent in these. And all of these things. Right? I think there is a huge scope for abstract out all of these things. Right? They are they are not even probably going to understand what liquid taking is and they're not gonna take that liquid taking token and put that in a world and generate deal. How think they're not gonna understand all of these. So so there's... There has to be a lot of abstraction from what exists today. Right What that means is for the user, all he should care about is, here is mat. Now this is a very low risk opportunity for you, which yields you seven percent. But your token is locked for three days. If you want to incentivize instantaneously, you can't. Right? And then there is there is another option for him which says, here is six point five percent for you, but you can instantly redeem your mat whenever you want. And by the way, here are these mid to high risk opportunities, where you probably get twenty percent What that means is we are taking additional smart contract risk, we probably exposed to capital erosion due to imp laws. Right? So a lot of abstraction of these things have to happen for the retail user. Right? On the institutional side, I see a lot of I think what has to improve is the taxation, the regulation, regulatory environment has to drastically change and bring in a lot more clarity on how do how how to treat these liquid state assets, how to treat taking rewards, how the imposition of taxes on these will be and all of that. Right? So all of those will probably be simplifying and there there will be a lot more at an adoption of institutions towards staking or potentially even liquid staking. ", "start": 2321.576, "end": 2463.8857}, {"speaker": "1", "podcast": "Right. Yeah. I think the tax implications is a good one from the institutional standpoint because there was that story sometime... Earlier this year that said there was, like a a federal judge in the Us ruled that staking rewards are not taxable income ", "start": 2464.5388, "end": 2480.5366}, {"speaker": "2", "podcast": "I think he ruled it as a taxable income. And then a couple had appeal for the higher court against the ruling of the law court. ", "start": 2481.009, "end": 2491.2617}, {"speaker": "1", "podcast": "And, you know, not financial advice, and I'm not an accountant or a financial advisor or an attorney, but I do have a traditional finance background and that doesn't really pass the smell test. I feel like it, you know, like it's I don't know. It's additional revenue. You're receiving kind of feels... Yeah. But we don't have to go into those details. We probably shouldn't. I mean, and I I think you made a lot of good point about, like, abstract away the complexity and but there are also a lot of risks. Related to staking that I think a lot of users are not aware of and probably don't wanna take the time to understand those risks. And like, what are some other risks that maybe we haven't quite talked about yet related to staking? And how does... State or mitigate any of these risks if they do. ", "start": 2492.1394, "end": 2546.3762}, {"speaker": "2", "podcast": "So one of the one of the risks of staking is... With respect to the valid performance. Right? On a majority of the networks, there is something called a slashing that is applied on a valid. If he if he doesn't perform well. So now slashing can be catastrophic right on on underneath, I think there is a chance of hundred percent of the capital being slashed. In case of a in case of a negative event by valid. Right? So that's gonna be catastrophic catastrophe for funds. Similarly, there is a risk of under performance by the valid. That means he's not generating the rewards as per the... Like, I mean, if you if you compare him relatively with the other valid. Right? The third thing is financial, like related, which is valid can set their commission to probably very high commission because delegate hardly check. These commission rate moments. Right? So all of these are risks with respect to staking, which can have an impact on either their capital or the yields that they are able to generate. Double the capital. So what we do as as a as a protocol is, we constantly monitor these valid. Their quality network network performance metrics as well as financial metrics. And based on that, we red delegate and rebalance the native tokens across these valid. So that some of these risks are minimized. ", "start": 2547.1716, "end": 2627.171}, {"speaker": "1", "podcast": "Where where are you seeing the most demand for staking? ", "start": 2628.3787, "end": 2631.7185}, {"speaker": "2", "podcast": "I think if you if you talk in terms of the amount of capital, it's always the institutions. Right? Because eighty twenty rule applies everywhere. There are large capital holders which form majority of the tokens that are held. So... And and then obviously, staking is probably one of the... I mean, in terms of if you grade, risks of participating in D five, probably taking is like, right at the bottom. Right? Because it's a it's it's there's no additional smart contract risk tokens are locked to the vale. Unlike a defect protocol where the... Where the defect protocol is up. Is has its own inherent smart contact risk, hacking risks, ", "start": 2632.434, "end": 2673.9353}, {"speaker": "1", "podcast": "all of these things. Right. And what about which chains? Like which layer ones are you seeing the most demand? ", "start": 2674.5747, "end": 2679.5295}, {"speaker": "2", "podcast": "I think Poly is a great great change where majority of mat state, either by by by the by retail or by institutions. And there's a ton mat that is stake. And slowly, we are seeing a good amount of our option for liquid staking as well. Similarly, there is a there's a huge Sol that is also take about sixty six, seventy percent of Sol state. And even b B is a chain where staking is quite popular. ", "start": 2680.4233, "end": 2712.5867}, {"speaker": "1", "podcast": "So what's what's something new on the map? That's coming up for s that is get you most excited. What are you most looking forward to on the map? ", "start": 2713.0632, "end": 2722.3203}, {"speaker": "2", "podcast": "So a couple of things, growth here for us is gonna be where expanding to newer blockchain, we are actively looking at other blockchain... Like, come some of the upcoming blockchain like apt missed ten and several other chains on on the cosmos ecosystem. Right? Second is, obviously, our focus on growing the existing chains like all on, near Bs c and would like, even though other chains like, find term as well as a data where the... Where there is a where there is a decent momentum of late. So the third lever that we have is we actively are looking to build these abstraction layers for some of the centralized players like exchanges, etcetera. And connect them via Apis apis, and expose them to these expo... And expose them to some of this taking products and taking words. So these are three major things on the road map for us. Like, really looking forward to launching some of those and taking them to the market. Well, Great as you're diversifying your ", "start": 2723.0386, "end": 2788.5337}, {"speaker": "1", "podcast": "revenue sources. And I think you mentioned earlier also that the token holders also have a a vote in how to utilize State treasury? Correct? So how does your protocol generate revenue? Where where does that where do those funds come from for the treasury? So the ", "start": 2788.8433, "end": 2807.024}, {"speaker": "2", "podcast": "so we actually charge a small percentage of commission from the taking rewards that are generated. Right? For example, on poly, we take about ten percent commission. On other chains, we charge... Typically, we charge anywhere between three to ten percent as our commissions. Still you ten percent of the skating rewards as our commission. Right? And that goes in ", "start": 2807.384, "end": 2829.6096}, {"speaker": "1", "podcast": "say with the protocol ratio. Yeah. And that I think people could pretty quickly look at that and say, like, three percent to ten percent and like, that seems like a lot. But I think what people don't realize is a, the service you're providing, which is you're basically betting these valid and keeping tabs on them to make sure they're performing. And then also, you also get that liquidity with your staking as well as opposed to staking by yourself. So you can use these in Defy and take out a loan against your mat x or lp it to try to generate additional revenue as well. And I don't know. Is that three percent to ten percent Is that pretty comparable to other protocols like Lei in in rocket pool? Yep. It's reasonably comparable. Yeah. Okay... We're kind of running up on time and you've answered pretty much all of my questions so far. Is there anything that, like, we haven't touched on that you wanna touch on specifically? ", "start": 2829.9187, "end": 2885.3264}, {"speaker": "2", "podcast": "I think one of the most important things that we probably also could talk about is a decent. And the way we select valid. Right? So basically, on every blockchain that we go to, we typically have I think we all want decent. Right? And one of the points that we touched upon in the beginning as a disadvantage of proof of state networks is the prudential centralization that it can. It can lead to. So what that means is Basically, we when we select the valid, we typically choose valid that are that have slightly lower amount of delegation. Compared to the top valid yet performing very well. We've validate their levy we review their performance metrics, including the number of block signed commissions that they charge and select the appropriate set of valid. And delegate the native to consume them. What that means is we are dedicating to consume smaller set valid, which means higher amount of decent centralization for the network. And I think another thing related to decent centralization that's interesting is ", "start": 2886.199, "end": 2953.3552}, {"speaker": "1", "podcast": "I think when you look at L, they've got a very significant portion of the eth that is stake on the beacon chain. What are your thoughts on those types of risks as well as like, one of these decentralized taking providers having too much stake and kind of that being a centralized not as centralized, but definitely like a a point of failure potentially a point of weakness for the ecosystem. ", "start": 2954.0537, "end": 2980.6704}, {"speaker": "2", "podcast": "I I think it's a it's it's... We have to... And I I definitely am I'm inspired by what Lei has achieved so far. Having said that, it is really up to the market to determine whether they put their entire Eat state with Slid or with another provider. Right? I I am a big believer in the market forces. Having said that there is definitely risk to some some centralization and single point of failure, but such such points of failure exist across the board Right? Like, for example, a lot of Ether stake on finance. Lot of Is probably stake on coinbase base as well. Right? All of these are points of failure for the entire network. If there is a scope to encourage competition, I think definitely the et ecosystem has to do that in. And in encouraging more and more competition. My sense is once the merge happens and withdrawals happen, the entry point for several liquid taking providers on ethereum will also be will also go down. So that's when you probably see some amount of normalization. And with a lot of these newer technologies like distributed valid and several building on them, I hope to see a few more ", "start": 2981.544, "end": 3056.534}, {"speaker": "1", "podcast": "few more competitive solutions emerging in the market. Yeah. Absolutely. That makes sense. And I've got just like, two more questions for you and then I'll I'll let you go On it. It it sounds like that state labs is waiting to get into ethereum staking post merge while there's other protocols like Lei and Rocket pull who are are already providing ethereum staking. Is there any specific reason why state decided to wait until post merge. ", "start": 3057.8525, "end": 3084.3923}, {"speaker": "2", "podcast": "So basically, we... When we are entering each taking, I think one of the differentiating factors that we are looking for is the technology that we're using, which is gonna be the distributed validated technologies unlike a centralized technology that currently is under play. So that is gonna be a differentiator for us. Otherwise, we just don't wanna be a me to product on ethereum. Okay. That makes sense. ", "start": 3085.5889, "end": 3110.241}, {"speaker": "1", "podcast": "Well, yeah, like I said, you've answered all of my questions. And I think, yeah, we're kinda running up on time here a little bit But I'm... It was great to have you. Great to talk to you again as always. What why don't you tell our audience where they can go to find out more about you and state labs and specifically staking on Poly. ", "start": 3111.6064, "end": 3131.6548}, {"speaker": "2", "podcast": "Absolutely. Thanks thanks justin for having me, and it was or raise a pleasure talking to you. And thanks for thanks everyone who tuned in to listen to this podcast. Really had a great time. If you want to check out more about s labs, We can visit s labs dot com, that's where you'll find all the information around the networks we are live on and also links to our socials, official social channels including telegram Twitter, discord etcetera, where you can further talk to us and ask questions about future road map or are current solutions that are already live. ", "start": 3132.2917, "end": 3172.4666}, {"speaker": "1", "podcast": "Alright. Yeah. To everyone who's watching on Youtube. Thank you for watching. If you're listening on Apple podcast podcasts, Spotify or subs. Thanks for listening as well. Ami emit. Thanks again one last time, and we'll see you next time. Thanks everyone. ", "start": 3173.585, "end": 3189.2666}], "summaries": [{"title": "1. Challenges and Advancements in Blockchain Technology: Moving Protocols, Staking Architecture, Consensus Mechanisms, and More", "summary": "This text discusses the challenges and considerations of moving protocols and projects between blockchain chains, particularly Ethereum-compatible chains. It highlights the complexities and variations in staking architecture within these chains. The article explains the concept of staking and its significance in layer one blockchains. It also compares proof of stake and proof of work consensus algorithms, discussing the advantages and disadvantages of each. The author acknowledges that both technologies are still evolving and that time will determine which one leads to more centralization. They emphasize the high transaction throughput and wider participation opportunities offered by proof of stake networks."}, {"title": "2. The Rise of Centralized Finance, Cryptocurrency, and Staking in the Crypto Market: Insights and Interviews", "summary": "The Poly Alpha podcast discusses the rise of centralized finance in the Poly gun community, focusing on the influence of cryptocurrency in Web 3.0 development. The founder of State Labs, Ami, joins the podcast to share insights and experiences in the crypto industry. They discuss the growth of their staking platform across multiple blockchains and the potential market opportunity in staking. The episode concludes with the speaker expressing gratitude to the audience and providing information on how to learn more about State Labs."}, {"title": "3. The Growing Popularity and Importance of Staking and Liquid Staking Services in the Market", "summary": "Staking has gained popularity among both retail and institutional investors. While institutions typically opt for plain vanilla staking, retail investors are more comfortable with smart contract risks and liquid staking tokens for higher yields. However, institutions are gradually adopting staking due to security measures like audits and bug bounty programs. Liquid staking services offer benefits such as overcoming technical hurdles and providing tokens that can be used in DeFi protocols. These tokens can be traded, used as LPs on exchanges, and integrated with lending and derivatives protocols. The text also discusses a discrepancy in trading value between ETH and MAT tokens, attributing it to differences in withdrawal time frames and the possibility of arbitrage opportunities."}, {"title": "4. Challenges and Growth in Building Protocols, Smart Contracts, and Staking Providers in Different Blockchain Chains", "summary": "The speaker discusses the challenges faced in building a protocol and how they have overcome them over time. They have built a team of engineers and marketers and have become known for their content and marketing strategies. The text also discusses the advantages of using rust-based chains in Ethereum development and the concept of cross-chain token porting. It introduces a shuttle service between Ethereum and Poly networks that allows users to transfer tokens directly without a bridge. The text also discusses the challenges of staking on different blockchain chains and the complexity of designing staking providers on the Terra blockchain. It mentions the collapse of a cryptocurrency platform and the importance of diversifying services and assets onto other chains."}, {"title": "5. State Labs' Quality Content, Utility of Tokens, and the Role of Chainlink Oracle in the Crypto Space", "summary": "This text praises the marketing content produced by State Labs and encourages listeners to follow them on Twitter. It highlights the informative and valuable content they provide about the Crypto ecosystem. The conversation also touches on the importance of utility for staking protocols, specifically mentioning the State asset token called Matt X. It mentions opportunities for users to become liquidity providers and borrow against the token on both Ethereum and Poly networks. The text discusses the various opportunities available for MAT x within the Poly chain ecosystem. The first opportunity is in secondary markets, where MAT x can be traded with MAT or stable coins. The text mentions several platforms within the Poly ecosystem where MAT x is actively traded. The second opportunity involves leveraging MAT x to earn yields through lending or leveraging MAT x pools. The third set of opportunities, which will be unlocked soon, includes potential integrations with lending markets across Poly and the deployment of the Magic chain link Oracle. The chainlink oracle is crucial for Medic X as it provides utility and plays a significant role in the protocol. The integration of Chainlink Oracle in lending markets allows for easier management of positions and potential opportunities for users. It enables lenders to determine the right time to liquidate positions in case of a significant drop in the price of the native asset. Additionally, it makes Mat x comparable across different protocol types and opens up possibilities for futures and options markets. This integration unlocks various utilities for Mit x, such as leverage trading, using Mat as collateral, and participating in DeFi opportunities to generate higher yields. Overall, it benefits users by increasing their earnings potential and expanding their participation in the decentralized finance sector. The text discusses the upcoming integration of Chi, pending a governance vote, and the excitement surrounding it. The author also mentions the passing of the gong for man Finance, indicating that it will soon be live. Additionally, the author raises the topic of differentiation in the crypto space, comparing the platform to competitors like rocket pull, L, Clay stack, and even centralized providers like Coinbase. The author expresses curiosity about how the platform sets itself apart in this growing sector of the crypto industry. This text highlights the safety measures, cost-saving features, and extensive integrations offered by automatic contracts in the Mat ecosystem. The company prioritizes safety by conducting regular audits and bug fixes. They also provide an instant pool to help retail users avoid gas costs and token transfers. Additionally, they boast a high number of integrations with Mat grids, indexes, lending, and options protocols, making their platform highly versatile and useful for users. The Sd token serves as the governance token for the State of Protocol, allowing holders to make major decisions regarding operations, reward allocation, validator selection, and the spending of ecosystem funds. The token went live in March and is currently traded on Poly UniSwap and several centralized exchanges. Its main purpose is to empower Sd holders to govern and shape the protocol's future."}, {"title": "6. The Future of Staking, Crypto Adoption, Tax Implications, and Risks in Finance", "summary": "The text discusses the future of staking in the crypto industry, with a focus on the potential dominance of institutions. It predicts increased adoption of cryptocurrencies by retail users and traditional institutions. The need for simplifying the user experience and improving taxation and regulation for institutional adoption is emphasized. A federal judge ruling that staking rewards are not taxable income is seen as a positive development. The risks and complexities associated with staking are also discussed, including the need for caution and understanding of the risks involved. The text highlights the importance of mitigating these risks through constant monitoring and adjustment of allocation."}, {"title": "7. The Demand for Layer Chains, Staking, and Expanding Blockchain Networks", "summary": "The text discusses the increasing demand for layer chains and the popularity of staking in blockchain networks such as Poly, Sol, and B B. It highlights the significant amount of stake in these networks and the availability of liquid staking options. The article suggests that staking is becoming a prominent feature in the blockchain industry, offering opportunities for individuals and institutions to earn rewards and contribute to network security. The company plans to expand to newer blockchains and grow existing chains, as well as build abstraction layers for centralized players. The company charges a small commission on the rewards generated on different blockchain networks."}, {"title": "8. Comparing Staking Protocols, Decentralization, Risks of Centralization, and the Importance of Competition in Blockchain Networks", "summary": "The text discusses the benefits and drawbacks of staking in a protocol, such as earning a return on investment and gaining liquidity. It also highlights the importance of decentralization in blockchain networks and the potential risks of centralization in decentralized finance (DeFi). The author emphasizes the need to address these risks and ensure a more decentralized and resilient DeFi system. The text also discusses the importance of competition in the Ethereum network and the potential of newer technologies like distributed validation to enhance competition and normalize the network. State Labs has chosen to wait until after the merge to offer ethereum staking, emphasizing the importance of using distributed validated technologies."}]}