{
    "podcast": {
        "title": "Polygon Alpha Podcast",
        "host": "Justin Havens",
        "image": ""
    },
    "episode": {
        "title": "The Decentralized VPN | Orchid Protocol | Travis Cannell",
        "number": "9",
        "date": "AUG 3, 2022",
        "description": "",
        "url": "https://www.youtube.com/watch?v=15xrqqAnGMY",
        "speakers": {
            "0": "Justin Havens",
            "1": "Travis Cannell"
        },
        "file": "august3.mp3"
    },
    "transcripts": [
        {
            "speaker": "0",
            "podcast": "Everyone. Welcome to the Poly gon alpha podcast, where the Poly gon community gathers insights from today's leaders into decentralized finance and Crypto. I'm your host, Justin Havens. Aka crypto. Let's get started. On today's episode of Poly on Alpha, we're joined by Travis Can, who is the Head of Product at Orc. Travis, thanks for being here with us today how's everything going. Thanks, for rob having, Justin. Everything's going great. Alright. Good to hear it. So let's just get started with your background Travis. You know, what is your back ground and how did you make your way to the Web three space? Yeah. So I went to College and study computer science, Uc ucsf a little while ago. And ",
            "start": 0,
            "end": 45.523422
        },
        {
            "speaker": "1",
            "podcast": "I kind of made my way into the corporate world kind of after that. And doing different... Well, via startup. So I was working at a startup up in Santa Monica here in La and Intuit it purchase that startup and actually started working remote, you know, like, twenty sixteen when that happened because they ended up shutting the office down in Santa Monica. And I got into kind of growth marketing and doing a lot of stuff on a marketing side and then using my technical jobs to do measurement accurately and just try to understand what's going on. A lot of growth marketing is just simply making sure that you are very careful about how you're looking at data and making assumptions and conclusions from that data, which is very important. And the bigger an organization you're in, the harder that can actually become because reading what the marketing data is could becomes kind of like a tea leave exercise on, you know, how well your department's doing. So But I really enjoyed my work at Intuit. I worked on a product called Quickbooks self employed, and we helped a lot of people save money on taxes. And we grew that from kind of its launch to kind of having millions of users so paid subscribers. So, I think actually, I'm sorry, Six hundred thousand by the time that I left. But I think we've... It's gone over a million now. And then that brought me the work. It's a some of my friends from Uc ucsf, wanted somebody with the technical shops who in the marketing department. And at Orc ed. And so I first came in to do marketing, and then I switched over to product. Now I kind of have a little bit of a dual role at Orc ed doing a little bit of both. And that's that was about twenty eighteen when I came in to Orc ed. So I've been here almost four years. It feels like very long time in the Crypto space to be at one company. And as we're kind of chipping away on the same sort of decentralized Internet project but it's a very enticing mission and I and I enjoy the company and the work. Yeah. I think just the idea of a decentralized Internet is ",
            "start": 47.16637,
            "end": 186.40443
        },
        {
            "speaker": "0",
            "podcast": "might be some of the re... Like, might be one of the main reasons that a lot of people get into this space. Well, I think, like, the whole number go up concept is also a pretty good, like, it's that's like self marketing in itself, right? When there are bull runs and people start to fo in. And then, like, as the bear market die, you know, every at the bull market dies and the bear market starts to play out. There are more and more people that stick around after every bull market, which is exciting, but you kinda win a different route. Which is which is interesting. And so let's just talk about Orc it now real quick. Like, what is the Orc protocol? ",
            "start": 186.93872,
            "end": 222.075
        },
        {
            "speaker": "1",
            "podcast": "Yeah. I just had a thought on that, you know, when I was working in the non crypto space, it was funny. I just had that's I just ran into an old coworker at the airport and we were talking, like Travis. You're still in Crypto. And I'm like, yeah, we were talking about how at this Intuit company were we working Into it after we were purchased. You know, everyone was talking about Crypto. And you, everyone was watching that first run up when Bitcoin hit, like, I think twelve hundred or something and everyone thought that was totally insane and it was just like in it was just the water cooler talk of the town at the startup up, and you know a lot of people had just made some money and so people are playing with it and there's a lot of different opinions on whether it was interesting or stupid. You know, at that point, I was just like, I I I I wanted a way to kinda to get into the industry, but at that that must have been twenty six twenty fifteen, twenty sixteen. It was like there weren't there was a not a huge system there was not like massive numbers of Ethereum projects happening and I just couldn't really see away in just with Bitcoin by itself. And so I just kind of kept that thought. And then when the orc at opportunity came around, that's where I really enjoyed that I got to jump in. My friend Jay Freeman, when I knew from college was one of the original founders of Orc. It is one of the original phones orc and still there. And know our mission is to decentralized the Internet and to make sure that people can get open access to the unrestricted Internet. And to try to just make everything a little bit more private and try to build the tools and set the foundation that you know that we can use together to make that a reality and to prevent not only people that you know or kinda looking at your data, like, when you're using Facebook and you just you're like, alright. Facebook. You know, I'm giving Facebook these pictures and I'm telling Facebook about these sort of things, but I'm getting a benefit. From it you know, to something like an Internet service provider that's maybe harvesting your data, making models about you, and you might not be fully aware of everything that's happening and all the different people in that ecosystem that are hard at seeing data. But I think that's in the nutshell, what the mission of work it is and then I can get into a little bit more about how it sort of works. But in a nutshell, that's what we're trying to do is to build those little pieces of the decentralized Internet and it's a very you know, common marching sort of theme for a lot of the the people and the crypto space and a lot of projects, and so it's very exciting. Yeah. And I think it ",
            "start": 222.65001,
            "end": 389.11496
        },
        {
            "speaker": "0",
            "podcast": "might be good idea to maybe get your definition of what the decentralized Internet actually is. Because I think some people might think that, you know, the Internet is already decentralized to an extent. Right? I mean, it's just a network of computers that are connected together. Right? So ",
            "start": 390.11392,
            "end": 406.97528
        },
        {
            "speaker": "1",
            "podcast": "I mean, why is that not as decentralized as it should be? Yeah. I mean, I think that just over time what's evolved is sort of an oli of different service providers that are in an advantaged position to to do different things. I mean, think also there was kind of this major pact with the Internet where we get things for free and in exchange for this kind of totally crazy revenue ad model. So when I look at things like, kind of how different feeds work with Twitter, Facebook. Kind of some of these major tech companies, the big thing, tech companies. It almost feels like it should be like a public good, how those different algorithms work, but, you know, they're kind of really designed to suck your attention into these things. It just seems like a very strange way to optimize. But you know when I look, you know the Internet you know, kind of I think start out more decentralized than it is now, you know, just because of these, like, kind of massive walled gardens that have kind of come up. So But also working in this space for four years and getting a little bit more sensitive to what's happening around the world. You really do see that when there's problems in a country or in particular when a government is challenged, you know, one of the first things they're gonna do is shut off the Internet. Or try to start... Restricting the Internet. The first thing they're gonna do is they're gonna shut off, and you know typically, if you're looking in Middle East countries whether it's the arab spring that happened or even Russia today. I mean, one of the first things they jump into is like, hey, let's block Twitter let's block Facebook. Let's block all these communication tools that they might used to talk to the west. Or even just to talk to other people, you know, if you look at like Hong Kong or whatnot. So I think, you, there's centralized points of control in infrastructure and then their centralized points control in sort of like the the software layer as well. If you look at, like, the great firewall of China in different firewall technologies that are being exported from China to different countries. So I think the Internet is resilient and it is federated and decentralized them many different ways. But, you know, we can do better. And so that's, you know, part of what we're trying to do at orc. And our Vpn. Some of the tech that we've built, that the Vpn sort of runs on is all along that sort of ",
            "start": 407.60477,
            "end": 575.80994
        },
        {
            "speaker": "0",
            "podcast": "Yeah. I'm I'm glad to up the Vpn because when I think of Orc protocol, I really think of a decentralized Vpn protocol that's built on the blockchain. Using financial, you know, incentives. Right? Those human coordination incentives that makes web three so successful? So yeah, I mean, is it a Vpn protocol or is it a decentralized internet protocol. ",
            "start": 576.2831,
            "end": 603.8147
        },
        {
            "speaker": "1",
            "podcast": "So orc ed, you know, if we we're setting inside sort the mission... Look at like, kind of what we built and kind of where we're going. But, you know, the first thing that we sat on to do with Orc was to make sort of like a decentralized marketplace. And one of the things that we were, like really thought it was important for a decent marketplace and the decentralized marketplace means that you don't know... Like, everyone that you talk to might be stereo. So if I... Oh, if in a decentralized marketplace if I go to buy something from you. I just have to assume you're probably trying to screw me. Like you're probably trying to scam me you're probably trying to, like fake, if Information to make me think that you're more valuable than you are and then get as much money for me as possible. And so one thing that we thought a lot about and that's kind of in our white papers is like how do you minimize the trust between participants? And the way to do that is with tiny payments. Right? So like, if we start interacting and rather than me giving you a hundred dollars and you giving me a three year promise that you're going to give me Vpn service, Like what if I just give you like one million or like one one thousandth of a you know, and then I give you another one, and I give you another one. And I'd sort of see is this service working for me, and then at any time, I can cut off service and you've actually received payment for what you've provided. I've paid for what I've provided. And so that kind of creates like this liquid sort of marketplace. And having a Vpn as actually once you kinda come at it from that angle, like having a Vpn is is the first kind of easy thing to make. On top of that payment layer because a Vpn, if you're sending payments to somebody or you're sending payment... That person might as well forward your traffic as well. So the Vpn, so Orc is a Vpn protocol. So Jay Freeman wrote the Orc protocol, it is separate from Wire guard and some of the other open Vpn, You know, those are protocols. Right? So those are different way. Wire guard is sort of the new hot in the space. It's very fast. Work protocol, is newer. It's not as fast as wire guard, but you're sending payments along with the packets. You know, so I read, like, I think, ten packets or something you're actually sending this really tiny payment. And I think that's pretty exciting, to have these prob payments that we've built and that we sort of use In the four years, I've been in the space, I see a few projects like Live Peer came out and said, you know, oh, that's a good idea. We're gonna take that. And then I just see other projects that have kind of quietly started building prob payments and incorporating it into what they're doing. And I think that's that's exciting and we'd love to see this sort of ecosystem growth. But really, we try to think of you know, if you set aside even blockchain or scalability or just set all that aside and just try to ask yourself, like, how theoretically, how can you set with computers? How can you send the smallest payment possible, you know, that's kind of how we you sort of arrived at the... Prob payment system. We're calling it a prob roll because really it's like a way of achieving final using probability which is different from, like, does their knowledge roll ups which are really cool in the optimistic roles ups. But yes. That's... That's a lot. But hopefully that answered your your first question. ",
            "start": 604.29193,
            "end": 826.9267
        },
        {
            "speaker": "0",
            "podcast": "Yeah. Did. Can you elaborate a little bit more on how... Prob ballistic roll ups ",
            "start": 827.64185,
            "end": 832.5351
        },
        {
            "speaker": "1",
            "podcast": "compared to other roll up solutions. And, yeah, we're calling kind of prob role because I think that's the right framing for it. But you like essentially, you have optimistic roll ups that are are taking a bunch of transactions and then putting it into one transaction. And then optimistic thinking that you there's not going to be any problems and they deal with those problems later, which is I'm an opt myself. So I think it's good to get people the benefit of the doubt sometimes. I'm not sure Well, and then the Zero knowledge roll is using the really cool new Zero knowledge, kind of technology and mathematics, which rolls up all these transactions into a proof. And so then you can sort of prove that these things happen, but you don't have a lot of information about them. You know, those are good for doing more transactions and also having transactions where you need final. So, like, if I wanna send you, ten dollars one time. You know, it's good to use a... Just use the blockchain itself or a roll up solution. Now we're the probability, what happens is rather than me sending you ten dollars. I send you sort of the chance to win ten. Dollars That's pro like that the the sort of odds are correct. Right? And what that allows you to do is sort of scale up any blockchain by a lot. So... But, you know, there's some sort of caveats. So, like, how we sort of compares, you don't get that sort of instant fan out because what's gonna to happen is, like let's say, I'm sending you the chance to win fifty cents. Like you with our Vpn right now you can set up an Orc account, which is basically like taking money and putting it onto to our L two. And then you can send these little prob payments as your paying with the Vpn. And what will happen is you need to use the Vpn for maybe like, ten gigabytes. So you need to send about ten thousand payments, before on average, one payment will actually be a winner, and money will be pulled out of your orc account. So Probable was that payments require a service interaction over long longer time scales. So, like, you... The bandwidth marketplace is a great sort of example. And, like, the Vpn is almost like a test case of a lot of this technology where we're just sort of proving that these things work. But in the Vpn, you're sending all these payments. And then over time, you as the Vpn service provider, you're going to see like, oh, even though ninety nine percent of these like scratch lottery tickets. I'm getting from Travis are losers, like, I'm getting enough winning lottery tickets that you know the probabilities even out over time and using the law of kind of large numbers. It's like, oh, okay, I can see that even though ninety nine percent of these lottery tickets on getting are worthless, I can't prove. Neither of us can prove that they're not gonna be a winner, So every time you're sending this sort of pro scratch lottery ticket from one person to the other, there is value being sent. But it's not... So it's it's it's something it's kind of has a pretty particular use case of, like, people that want to trade a lot over time. You know, we've thought about, like, sometimes there's Internet services where you wanna access a website and know that website has to pay for their infrastructure costs, right? And so those are typically like a bunch of monthly fees to Amazon. That are, like, tiered usage models. Well, we're looking at, like, different ways, like, well, what if you could just send a little prob payment and say, I wanna run your website for ten seconds and like, I'm willing to pay you for all these computational on bandwidth and storage costs that your website is sort of like incurring with these tiny little payments. And so as I'm using your resources, I want to stream payments to you so that you're, you know, you're kinda made whole. And I think that that is a way that we can change some of the the business models that we see on the Internet from even everything from, you know, subscription models to, like, advertising and stuff. That's interesting. Yeah. It definitely ",
            "start": 832.83514,
            "end": 1110.6527
        },
        {
            "speaker": "0",
            "podcast": "it's a unique way to problem solve for a very specific use case ",
            "start": 1111.5236,
            "end": 1115.852
        },
        {
            "speaker": "1",
            "podcast": "is what I'm understanding from this. Right? Yeah. Because you... Lot a lot of a lot of what's happening in the in the space now. Right? So d defy transactions being eaten up by Defy. Like, in kind of a banking system, you do want that final and you're willing to pay more for it. And you know, it's gonna be a small number of transactions. So like, you're not gonna you're gonna like do a transaction to stake. Your token, gonna earn some rewards. You're gonna pull that stake and those tokens out, and you're willing to pay to, like, make sure that that money is transferred. But, you know, what? So So that's kinda like... I I think that's one of the... You know, that's kinda like when of the trade offs of how Orc it is working is that, yeah, sure we can send... The smallest payments that we theoretically could think about and, like, create. But, you know, there's a little bit of a setup cost, and then you don't get that instant final finale. We're now running it on eight different blockchain or on Poly gong. So you can actually go to our website at account dot orc dot com, you can take somatic and you can put it in. To our layer two, our payment let work by, like, making an Orc account. And you can almost think of, like, then you have your little lottery pop to and you can start sending lottery tickets from that lottery pod to pay for service. And the only, application that we have right now is the Vpn. But you know, that that kind of decentralized payment layer two that we have is definitely use for other things. Now one thing another thing I want to talk about is you know, all of the roll solutions are sensitive to gas fees. And, you know, typically the roll solutions kinda of just lower those gas fees. With Orc this this interesting thing happens is the gas fees go up. Like... So, like, if I'm sending you a lottery ticket, scratch lottery ticket. There's gonna be an a a a winning amount on it. Right? And so to kinda just get into the the the nitty gritty details here a little bit. Like, if I'm gonna send you if we're on the the the Poly gon chain and I'm gonna send you, you know, like, a dollar if we just put it all in dollars, maybe a little bit easier for us to think about. But if I'm gonna send you sort of a scratch lottery ticket where you could win a dollar you know, you wanna make sure that for you to redeem that dollar, it's not gonna cost you a point one zero dollars in gas fees, right? So the sort of the the if you take the ratio between the gas speeds of that sort of winning amount, you know, that's kind of the efficiency of our system. And so when gas fees like explode and go up, the face values of the lottery tickets have to get a lot bigger and so you have to put a lot more money in your lottery repo. So what we saw when we launched on Ethereum is that ethereum when we started, kind think we launched in December of of twenty nineteen we're like, oh, this is... You know, you can do transactions. You could actually run our smart contract for, like, twenty cents and if you make your lottery pot and the tickets were like, oh, like a couple of dollars. You could basically put like maybe ten dollars into your account using ethereum to pay for gas. And then and you can make accounts with Xt. And then the gas fees just exploded on that network tell, now I think if you want to make sort of work account on the ethereum chain, you have to put in maybe four hundred dollars or five hundred dollars into your lottery pot to have big enough tickets for it to be payment efficient. But then when you look at something like the Poly chain, it's really exciting To I see so much experimentation on the Poly gun chain, And it's just that that low gas fee kind of attract a lot of the people in the comes to the lower end. And of course, that's really attracted to us. As a Vpn because you, if users can't take ten dollars of of mat and put it into an Orc account and fire up our Vpn. People aren't going to want to put hundreds of dollars into something for just kinda like a Vpn benefit where, you know, our competitors like No are are only charging, like, a hundred dollars or ninety dollars for a couple of years of service. On on the subject of your... I guess, your competitors, like, the more centralized ",
            "start": 1116.2294,
            "end": 1409.6086
        },
        {
            "speaker": "0",
            "podcast": "Vpn services, like express Vpn and Nordvpn. Can you just... Let's get into, like, the architecture a little bit? Like, how are those Vpn services set up and how does orc... How is that different from a decentralized Vpn standpoint? And kinda of what are the trade offs there as well? ",
            "start": 1410.1393,
            "end": 1428.1555
        },
        {
            "speaker": "1",
            "podcast": "Sort of a permission system where, you know, we we let anybody run a run a server. Right now, we have with a Vpn, you know, you want people that run fast servers. Right? That have big bandwidth because you're literally gonna send your Internet traffic through them. You know, So working, we actually started with kind of our preferred providers, and so we have, like, a network of professional Vpn providers that we set up. In a sort of decentralized way. And so when you connect to Orc it, when you kinda like set up an Orc account, we actually have fiat gateway in the app as well, which I think I I, you know, if you saw my presentation at Main that, I was, like, hey, you can actually buy crypto within inside of, like, thirty seconds and and actually have your money converted. We use the notes is chain actually for that just because the stable coin because we figured there's a lot of people that don't really understand Crypto and don't want the value to sort of fluctuate. And so you know, the I could only drawback is that, you know, because we do know Ky is that the the money is like a prepaid gift card. So you can, like, only spend it with our preferred providers. So But anyways, that's just sort of like a payment system and get back to kind of like your question of like, how we sort of differ is Nord has one they're going Nord has couple thousand servers. And you're going to get access to kind of their system and you're going to pay a subscription. I think that most of the Vpn market for the centralized providers is kind of a scam because you're paying for this monthly fee or whatever, and you just forget about it, and it's just, like another one of those, like, monthly charges and maybe you're not really using it that much. But you're also like, kind of trusting this one provider. So a Vpn is an advantage position, like, they can they can see your traffic. They can see who you are and they can see what you're connecting to. And that's why it's so important that these Vp companies come out and say, well, we don't log anything. Right? Because they could. Because they can see both sides of that spectrum. How work gets a little bit different is, first of all, so we have not just one provider. Right? We have multiple providers. So we have four or five and then just the preferred provider network alone. And you kind of randomly... We have stake weighted random. So those providers have to stake T on Ethereum. And the more they stake, the more likely you are to connect to that provider. And so that sort of incentivize them to to stake more token, you know, which kinda shows that they're serious about the network and everything. So there's like good incentive alignment effects that happen with the state rate random selection. And then the course as a user at any time, if you disconnect and reconnect, you go through that selection process again, And so you're depending upon how the stakes are at that moment in time, you're likely to probably get a different provider. So you can kind of switch between these providers the stakeholder random selection also is kind of hard. If you're looking at this traffic if some Isp or government is trying to look at this traffic, you know, you're not always connected to one server that's run by one provider. Right? You're just kind of like randomly getting assigned in this network with the state rate random selection algorithm depending on kind of how much they're staking. So that's kinda like one major difference is that with Orc, you're getting a not just a single Vpn provider, but you're getting access to, like, a network of providers. And then another thing is that you know, these the centralized providers, some of them offer like a two hop sort of route. But with Orc, you can set up as many hops as you want. And what that really means is that your Internet traffic rather than from going to just one Internet server like one Vpn server, you can actually string them together. So you can hop from one to another to another And what that really does is it sort of separates who knows what about you. So like, the first Vpn server you connect to, it's gonna know who you are, but then that server just forwards your packets to another Vpn server. So they don't know what website you're connecting to. And then the middle Vpn server knows the first Vpn server and the second Vpn server but they don't know who you are and they don't know what you're connecting to. And then the last Vpn server can see what website you're accessing. Right? Because it's forwarding your packets to that website and receiving packets from that website, but it's just sending the packets to some other Vpn server. So it doesn't know who you are. So if you... You know, the three hoc route is kind of this magic thing that tore kind of came up with, and you can actually set that up with Orc. Some of the Vpn providers, I think Nord has a two hot route, but it's kind of silly because if you if you send your traffic through two Vpn servers, you don't really get much benefit because they're if they're logging, they're logging both those servers. Right? So basically, with a three hop route what it means that is that in theory, if everything's is kind of working perfectly and there's different attacks where people control more nodes than not you tourism has done a lot of work thinking about about that. But, you know, is that you've kind separated the amount of information that each Vpn, server has... So even if all of them are logging, you know, they can't really see who you are and what you're trying to access. And the last thing I'll say about this is that Orc could actually supports, you know, doing a three hop route not just with the orc in protocol, but with open Vpn and Wire guard as well. So which is a little bit crazy, but you know, like, with Orc, you can actually make a three hop route and use three different paid Vpn providers. And not even use Orc at all. We've had some, like happy people that have strung together these, like, pretty crazy Vpn routes. Where they're sending their traffic through, like, five different Vpn servers. Right? So like, let's say you get a subscription to Nord Pi and express Vpn, and you get three different wire guard servers. Using Orc, you could actually import those three different front Wire guard server credentials and then send your traffic through three different Vpn providers, brent and get that kind of three hop benefit. You know, that that's a feature that we've had for a while. It's kind of like use it your own risk. You kinda gotta know what you're doing to set that up. But you know, that's kinda like one of the the beauties of kind of having a a very flexible Vpn that you can do a lot with. Yeah. In it, ",
            "start": 1428.9702,
            "end": 1887.0876
        },
        {
            "speaker": "0",
            "podcast": "I'm glad you mentioned To because this sounds very similar to how the to network works. Right? The the onion routing network. Where you have at minimum, you know, three different nodes that your Internet data packets go through and that creates stay, you know, ",
            "start": 1887.8173,
            "end": 1904.9102
        },
        {
            "speaker": "1",
            "podcast": "anonymity. It's always three. Three flight kind of the magic number. So to to jump in a little bit, but three it's never four it's never two. It's never ten. It's always three with tour. And they kind and that's important because you don't want tour is very Towards is very sophisticated. We like To. It's very evolved and it you know they do a lot to make everybody look the same. Even if you're using the torque... Like, first of all, two, towards a browser, organs of Vpn. So those are different things. Right? So a browser is just a browser. You can just browse the Internet a Vpn. You know, if you put work it on your phone, all your Internet traffic on that device is going through the Vpn. Doesn't matter if you're using an app if you're using Facebook or Twitter or whatever you're using... How that whole devices connection is going through, the Vpn server whereas. Tours is just a browser. So if you open up the Facebook app on your phone, that's not using any sort of protection. It's only the Tour browser, what you're looking at in the tour browsers protected. So... But that, you know, minimizes the attack surface. So To is very good at minimizing the attack surface and You know, like, even if you're using the desktop app, they recommend that you don't change your screen size. Because if you change your screen size, well, now, like when you connect to a website they can see how big your monitor is. When you full screen and so then that's information that can then d you from the crowd. Right? So when you run to, just keep everything sort of the default settings and you're kind of like, ",
            "start": 1905.6302,
            "end": 2011.1307
        },
        {
            "speaker": "0",
            "podcast": "mixing in with the crowd where you don't ever wanna sort of stand out. And then contrasting that to Orc, it doesn't really matter what you're doing If you're adjusting your screen size or if you're getting on certain applications on your phone or on your desktop, it's all ",
            "start": 2011.9398,
            "end": 2027.43
        },
        {
            "speaker": "1",
            "podcast": "than minimized. Like, basically, you're getting p from your Isp and, you know, some different protections like that. In work we kind of that in our Faq, we kind of get into like some of the privacy angles and security aspects of it in a little bit more detail. But, yeah, I mean, on the Internet, it's hard to say. You're always, you know, truly anonymous. Fact I'm. There's a there's a lot of different tools and techniques that you know maybe we don't even really fully understand that different powerful governments are using. So you know, but certainly, it's... It helps. And also, I I guess another way to think about it is like, do you want trying to be fully anonymous from like the U. S. Government, okay, kind of good luck, but then also but also just being more private from private individuals that can buy information about you. It's kind of like, who's your sort of adversary. You know, a lot of... When you start thinking about this stuff? It's like, kind of what are you trying to get protection from, who do you wanna to be private from. And, you know, a lot of what Orc can kinda provide us, like, from Isps from other people that are trying to get data about two different things like that is one helpful kinda way to think about it. Rather than like, oh, you're, you know, you're using this and just so like, you're, like, perfectly safe from anything. Okay. That's a pretty tough guarantee. And I think even if you look at To website. And like I said, To has minimized their attack surface and tour runs in, like, really hot regions, you know, it helps a lot of people. You know, they do not say that they offer like, full and anonymity and I think how they kind of approach it it's good. So it's good to be kind of honest about those things. When you're talking about them, especially at this day and age where if you there so many regions where you can get arrested for different things online. And so ",
            "start": 2027.7445,
            "end": 2163.7332
        },
        {
            "speaker": "0",
            "podcast": "got be very careful. So, yeah, I think that's really interesting that Orc uses them that those multiple hops similar to to. And you also talked about how, you know, you're, you know, your a Vpn node you're using that's on the orc and network is getting reassigned periodically? Like how often is that getting reassigned? Is it every new website that you click is it getting reassigned? Or is it just kind of random? That would be a little bit onerous? Is there's a kind of ",
            "start": 2164.6653,
            "end": 2191.6282
        },
        {
            "speaker": "1",
            "podcast": "setup process. But it it's it's not random. I mean, it's controlled by you. So, like, basically, when you open up the Orc app and, like, once you kinda have an an account set up, so you can pay for service. And you hit connect, you kind of go through the stick with a random of selection service and you get paired with a Vpn server. And then, you know, if if to reconnect or to get a different sort of Vpn server, you'd have to disconnect and then reconnect. Kind of on our to do list is to make like a re roll button so you could press it and basically without dropping any of your traffic, sort of like in a kinda safe way reconnect, but it's pretty easy to just hit the button to disconnect and then reconnect And then if you kind of look closely, you'll notice that your Ip address will change if you go to a website, like, what is my Ip address. Right? When you connect to a Vpn, you wanna go see like, oh, it, know, does this website really think you know, I'm connected to a Vpn server and, like, if so where, and with Orc, you go, you know, when you disconnect and reconnect you're very likely you paired off with a different provider. So... Yeah. And then the the the multi hop routes would orc it, again, I would just say that it's like, it's kind of a feature that's a little bit buried that not really varied, but you just have to, like, go in and actually set up your route. So a lot of people that are using Orc I think one of the easiest use cases is actually is a little bit less about privacy and more about getting access to the open Internet. So it's kind of just like, I don't want my Internet connection to be seen like I'm in Indonesia. For example, because Indonesia has a firewall. Strangely in was it's a very interesting market to me because Vpn are legal, so you can advertise them there and you can use them to get around their firewall and they don't care. So it's very weird. Like like the government starts up a firewall and then it's like, yeah. You can get around it if you want. You know, like if you download a Vpn. So it just creates this like massive market for everyone there to use a Vpn, But, you know, they're using it less for privacy. Sure they want privacy because they might be looking at some sensitive content and they don't want the government to like be tracking that. But, you know, it's like they're trying to look at Reddit, for example, like Reddit, I think is totally blocked in Indonesia just because there's some nudity on parts of the website. So they just block the entire domain. That's kind of how a lot of these firewalls work. And so you don't need a multi hop route or some sort of complicated configuration to just get access to the open Internet and just access the web like an American ",
            "start": 2192.0059,
            "end": 2378.0208
        },
        {
            "speaker": "0",
            "podcast": "or Western. Let's pivot the conversation a little bit and talk about the Ot x token. And to the its economics and it's its use case in the protocol. Because when I take a step back and I I look at this, it's it's truly a utility token, you know. And I I think I see this a lot with other web three infrastructure protocols, like are we helium file coin and link and then Ox xt is that you use this in the protocol. Right? So it's what is the use case for the O token within the Orc protocol? ",
            "start": 2378.4807,
            "end": 2415.3083
        },
        {
            "speaker": "1",
            "podcast": "Yeah. I mean, it's a great question. You know, one, like, I think about this as part of the evolution of Orc is like, you know, there's is there was this kind of simple story where you take Xt, you put it in your Orc account and that's how you pay for Vpn service. But because Of xt is on the ethereum network and the gas fees on ethereum are fairly unusable for application, kind of small use cases like the Vpn where, you know, people are sensitive in the five to ten dollar range. Or even the one hundred dollars range sometimes on ethereum. We had to kind of look and really under stand if you needed if we if we needed that because the other side of what how Xt works is is on the provider side. And that's where we kind of have this bandwidth for marketplace, once so you have people selling and buying and all the users are buying? And how do we direct that flow of traffic in a way that incentivize good behaviors on the network? And that's where the stake weighted random selection comes in. And so, you know, the provider stake to varying amounts, Ox xt to get more deal flow. And we think that that's kind of an interesting model for a decentralized marketplace. And that's kind of how Orc is been running since we set it up. And we did some analysis and we God that, like, okay, we can actually open up the payments on eight different block chains. But it's just like sort of providers accepting different like Mastercard Visa or something. Right? So if you're an work provider and you're running a Vpn server, and you have a good stake and you're getting a lot of deal flow. Those people could be paying you an ethereum, Aurora, mat, you know, I on the no chain, you know, basically those eight different block chains that were on you know, you know, basically we realize that the provider probably doesn't care, like what currency they're getting paid in just as long as they're getting paid for the service that they're providing. And but the staking for providers is done only with Ox xt on Ethereum all and that's, because we have no plans to change that sort of ever. And So we think as we kind of grow the Vpn network over time, you increase the deal flow that is coming in and then like more providers want to participate in the state random selection process. So We think it's a pretty interesting dynamic. You know, one thing I'll I'll say about Ox xt is that, like, we've never and and you have no plans, but, like, we've never really wanted to do incentive place. Like, So basically to have people run infrastructure just to receive rewards. So we've never done any sort of reward system on the provider side, which is very very common. And I just think that it kind of incentivize like we are stuff. Like, what what we wanna do, what we wanna incentivize is having an app that people will pay for. Right? Like, and that's very hard. But, you know, if we just kind of like, well, oh, we don't have anybody provider, we don't have any use them unless just like, paid people to kinda like, fake it. Like, we really don't believe in that. And, you know, we've seen a lot of projects kind of now. Being in the in the space for while, we see a lot of projects like kind of these hype cycles. Like, I think there was a threat on helium, and I haven't, like, fully investigated that, but, you know, It seems like they are incentivizing all these people to run this sort of low bandwidth network, and it doesn't appear that they have. It's it's kind of like a big field of dreams play. Right? Where you incentivize like, build out this huge network and then you hope that then people actually pay for it, that you actually have a service that customers will pay for. And, of course, you know, in our hyper capitalist society. That's the very hard part. Right? Because consumers are tight with their money, and they have different choices. And so to come up with a decentralized offering that is very competitive and can attract those dollars from the centralized providers. That's the really hard part. Because a lot of people might not even really care that it's crypto. So our Vpn, you know, we have a long term view with it, but we think that that's kind of an exciting application But I think a lot of the applications that come out and do too much network incentives. You know, are kind of ob what's really happening and if they're... You know, how much you they're really getting. So we like things like the Web three index is kinda cool kinda track, you know, a lot of projects that are getting traction and that try to... You know, any attempts to try to kinda separate those things out At Orc get, I'll just say we don't really like to track anything. So we have no cookies on our website. We have no tracking in our app. We really don't wanna... You know, we've fought... You know, we've kinda got back and forth a little bit about this, but it's like, we also don't wanna set up any reporting mechanisms or tracking mechanisms on usage. It's just not something that we're, like, really big on is sort of creating any sort of, you, data warehousing project to kind of collect information on what's happening on our network. And even if it's just to kind of show the amount of usage and stuff like that, I guess really could use the blockchain for some of that tracking, right, From for like an adoption standpoint. Yeah. That's there's been some people that kinda look at our smart contracts and they can't and for usage from that. But again, it's like, there's ways to do it, but we don't wanna just, like, make it easier for everyone. I think that it kinda makes sense. Like? Yeah. That... Yeah. No. That does make sense. And then for user data it kind of like... We still we still use a few tools, I think we'll probably wind down eventually. You know, like, we have mail jammed and some different things like that for opt in kind of users that need help and we like to use some of those tools. I think eventually, we'll sort of like wind those things down. But you know, we just never want to be in a position where you, we have Google analytics or we have some sort of like, sirius analytics engine that has a bunch of user data that then could be corroborate with individuals by an see like a smaller government that's trying to find dis, political dis and so the game of D optimization is trolling and getting as much information as possible and then trying to connect the dots. Right? So the smaller information footprint you can kind of have the harder that that's gonna be. So at Orc, we just don't... We try not to track really anything. Yeah. And on the on the ",
            "start": 2416.0232,
            "end": 2870.49
        },
        {
            "speaker": "0",
            "podcast": "stake weighted random selection for the Vpn providers, could you ever get into a situation where you have a large sticker of the O t token, and... But they have like, low bandwidth. And if so, like, what... I mean, what what do you do in that situation? Good question. ",
            "start": 2871.03,
            "end": 2889.81
        },
        {
            "speaker": "1",
            "podcast": "The question would be why would a provider do that? Because you the answer so is a little bit of in sort of like an economic alignment. It's kind of like why doesn't somebody like Bitcoin has a little bit of that right? Like why doesn't somebody get fifty one percent of the hash power bitcoin and then destroy Bitcoin. Because... Because you'd have to spend, like, billions of dollars to do that, and then what's your return, Right? So you know, so the part of what the state the state rated random selection does is when the provider has to buy a bunch of Xt and expand that economic resource and stake it, that they're incentivized to not do a bad job and destroy things. So that one attack of like having kind of like an Uber provider, that's kind of what's preventing that. I mean I think over time. Like, our our kind of stakes are, like, pretty kinda evenly distributed now. Ish But we'll see kind of how that sort of happens over time. I think the Oregon Vpn project is still it's I think it's still kind of early and it's just going to take, you the timescale scales of, like, how long tour has been around to like really grow and kind of like but we've kind of built the foundation with the right levels of decent that I'm still you know, I think it's still a cool project and stuff. And now we're looking at, you know, with the tools that we've built with our decentralized bandwidth marketplace, what other kind of decentralized marketplace we can build ",
            "start": 2890.69,
            "end": 3004.1401
        },
        {
            "speaker": "0",
            "podcast": "and you know, our founder been talking about pop out a little bit. And another question that I've I've personally had because I've done like, some research on the Internet about, you know, using tour in a Vpn at the same time. And there are a lot of people who say that using the Tour browser with a Vpn is actually less private than just using one or the other. Yeah. Don't do it. Yeah. ",
            "start": 3005.4783,
            "end": 3029.8237
        },
        {
            "speaker": "1",
            "podcast": "Why is that the why is that the case? It's it's always a a a bit of a head scratch, but, you know, kind of really relates back to, like, this attack surface. So when you're using a Vpn, you're pumping all all of your traffic, you know, through through the Vpn. So there could be parts of your Internet traffic that could dia optimize you. So like your Windows machine is doing some sort of windows update. Right? Or you know, you know, your your machine, you know, you're you're running all this software. All this software is just sort of like, out a control pho home, doing these different things and the Vpn, you see all of that. So if you're a Vpn if you're adverse serial Vpn provider and you're logging this kind of stuff. You, you're getting a lot again, getting get gets back to this like, how much information are you putting out You'll want to put out a small amount of smaller information footprint is better, right? So when you use a Vpn, you're putting all your traffic through, so it's kind of like the... I think that's part of why they're talk why they say that is for that reason. For listeners that are like really interested in this. Definitely go to To website, I know that they have information about from their perspective and they probably gonna put it a lot more eloquently than I am right now. But, you know, I think that, you know, it's basically when you're using To just download the browser, use it as they say to use it. Don't resize your screen, you know that's that's gonna have the kind of the smallest like kind of a tax service for, and and you basically, you know, use tour as to. Right? You don't need to make you don't need to do anything crazy to make tour better than it is. Just listen to what To says, do what they say. And, ",
            "start": 3030.5398,
            "end": 3148.897
        },
        {
            "speaker": "0",
            "podcast": "you know that's that's you're gonna get the biggest benefit of tour for that reason. Yeah. It was definitely... I definitely did my research after I heard that, and I I got to the point where I understood it enough, but that was like, a year and a half ago and I forgotten everything. Since then. Right. So I just got a couple more questions for you because it looks like we're running up on time, But I wanna know, like, what's next for Orc? After, you know, are there other products in development outside of ",
            "start": 3149.915,
            "end": 3175.523
        },
        {
            "speaker": "1",
            "podcast": "Vpn? Are you working on your own browser? Yeah. You know, we don't publish a map at Orc? And you, community kind of we're we're working on is what we're working on. But we as kind of our C seven water house and or Dr. Stephen Water house and call them seven. And Jay Freeman, who's name at So online. You know, they've been kind of talking about. You know, we're looking at other things along the lines of decentralized marketplace for bandwidth, other things that where decentralized marketplace makes sense. Other places where our layer two could be useful for kind of the use cases I was saying for of trading over longer periods of time for different things. So we're definitely taking a lot of the technology and things we learned, Like Org is really cool in my mind because we built all these things and then we built an application. Right? And a lot lot of people in the the in the crypto space just build a lot of things. And then they're like waiting for other people to build applications. Right? And we kinda did it all, and then we got known as our application. But I think a lot of way orc gonna be going is going back and saying, like, hey, we actually built all this stuff that the application is sitting on. And, you know, our Vpn is sort of like a demons administrator of some of these core pieces of tech like our payment layer, like state random selection. Other different things that we've kind of worked out and now we have years of operational history to kinda see how it's played out. And so, you know, the Orc Vpn is kinda like, you, training ground kind of. So sorry, a little bit with a little bit of a non answer there, but again, we don't really publish ",
            "start": 3176.2217,
            "end": 3295.106
        },
        {
            "speaker": "0",
            "podcast": "we don't publish a map. So... Sure. Just waiting for more comp comp on top of your protocol is kinda what I'm hearing. In general? Yeah. That's that's amazing. Yeah. Yeah. So we are kinda running up on time, but, yeah, this has been great Travis. I really appreciate you coming on and we're can people go to find out more about you and Orc kid? Yes. So, you know, we're ",
            "start": 3295.4646,
            "end": 3317.7302
        },
        {
            "speaker": "1",
            "podcast": "orc we do a lot of stuff on Twitter. It's probably one of our biggest platforms. So we're at orc protocol. And we have orc dot com. So those are two places to learn about the community and the project and what are what we're putting together. We have a pretty active discord as well. And yeah, then I'm at Travis Canal on Twitter. So you can to find me there? ",
            "start": 3318.5012,
            "end": 3342.752
        },
        {
            "speaker": "0",
            "podcast": "Alright. Thanks. Amazing. Yep. Thanks to everyone who's listening and watching. Be sure to find us on Apple, Youtube spotify or subs. Or anywhere else that you can find a podcast. Travis, thanks again, and I'll see you next time. Really appreciate it. ",
            "start": 3343.646,
            "end": 3359.6428
        }
    ],
    "summaries": [
        {
            "title": "1. Insights into Decentralized Finance, Crypto, and Navigating the Corporate World",
            "summary": "In this episode of the Polygon Alpha podcast, Travis Can, the Head of Product at Orc, discusses his background and journey into the Web three space. He shares insights into his role at Orc and the mission of creating a decentralized internet. The text also explores the concept of bull and bear markets in the cryptocurrency space and the growing interest in Bitcoin. The importance of building decentralized tools and infrastructure is emphasized, along with the need for a clear definition of a decentralized internet. The Orc protocol, a decentralized VPN protocol built on the blockchain, is mentioned as a step towards achieving this goal."
        },
        {
            "title": "2. The Importance of Bull and Bear Markets in the Cryptocurrency Space",
            "summary": "This text discusses the concept of ballistic roll-ups and their significance in scaling up blockchains. Probable offers two types of roll-ups: optimistic roll-ups and zero-knowledge roll-ups. Optimistic roll-ups combine multiple transactions into one, while zero-knowledge roll-ups use advanced mathematics to prove transaction validity without revealing much information. Probable's approach allows for more transactions and is suitable for scenarios like bandwidth marketplaces or accessing websites with tiered usage models. The text also discusses the use of prob payments in decentralized marketplaces to minimize trust between participants. The author suggests using tiny payments to test service reliability before committing to larger payments."
        },
        {
            "title": "3. Decentralizing the Internet for Privacy and Open Access",
            "summary": "This text discusses the benefits and challenges of Orc's decentralized payment system, particularly in terms of transaction costs and gas fees. It also highlights the advantages of using Orc's layer two solution on the Polygon chain, which offers lower gas fees and attracts more users. The text also mentions the importance of affordability for users, especially in the context of Orc's VPN service, where competitors offer lower prices. Additionally, the text discusses the features and advantages of Orc's decentralized VPN system, including enhanced privacy and security through multiple providers and multi-hop routing."
        },
        {
            "title": "4. The Centralization of the Internet and the Need for Decentralization",
            "summary": "The text discusses the importance of blending in with the crowd in certain situations, but also highlights the benefits of using the Orc platform to freely express oneself without fear of judgment. It emphasizes the need for privacy and anonymity on the internet, and mentions the role of tools like Tor in providing some level of protection. Tor browser is recommended for browsing the internet with reduced risk of being tracked or identified."
        },
        {
            "title": "5. Decentralized VPN Protocol on the Blockchain",
            "summary": "This text discusses the Orc network, which uses multiple hops similar to a VPN. The author questions the frequency of reassignment of VPN nodes on the Orc network and expresses concern about the burden of frequent reassignment. Orc VPN allows users to easily connect to VPN servers and change their IP address, providing access to the open Internet and bypassing firewalls. The O token is considered a utility token within the Orc protocol, but the specific use case for the token is not clear. The text also explores the challenges of using Ethereum for payments and emphasizes Orc's commitment to privacy and avoiding data tracking."
        },
        {
            "title": "6. Understanding Ballistic Roll Ups and Probable: A New Approach to Scaling Blockchain Transactions",
            "summary": "Using both Tor browser and a VPN at the same time may not enhance privacy, according to online research. The article advises against using both and suggests sticking to one or the other for better privacy protection. It emphasizes the importance of VPN providers having strong privacy policies and not logging user data. The text also discusses the issue of selecting a VPN provider with a large sticker of the O t token but low bandwidth and seeks an answer to this problem. Economic alignment is highlighted as crucial in preventing attacks on decentralized networks, such as Bitcoin and the Oregon Vpn project."
        },
        {
            "title": "7. Unique Problem-Solving Approach for a Specific Use Case",
            "summary": "The text discusses the importance of researching before a tour and staying updated on knowledge. The co-founders of Orc discuss their plans for a decentralized marketplace and the potential of their layer two technology. They highlight the foundational work they have done and mention the absence of a published map and the need for more information about Orc Kid and its founder. The text also mentions the various online platforms where Orc Protocol shares information and encourages the audience to engage further."
        }
    ]
}