{"podcast": {"title": "Polygon Alpha Podcast", "host": "Justin Havens", "image": ""}, "episode": {"title": "World's Largest Crypto Index Fund | Bitwise | Matt Hougan & Ryan Rasmussen | Polygon Alpha Podcast", "number": "12", "date": "AUG 24, 2022", "description": "", "url": "https://www.youtube.com/watch?v=15xrqqAnGMY", "speakers": {"0": "Justin Havens", "1": "Matt Hougan", "2": "Ryan Rasmussen"}, "file": "august24.mp3"}, "transcripts": [{"speaker": "0", "podcast": "Hello, everyone, Welcome to the Poly gon alpha podcast where the Poly gun community gathers insights from today's leaders and centralized finance crypto and web three. I'm your host Justin Havens, Aka Crypto. Let's get started. On this installment of Poly alpha, we are joined by Matt and Ryan, who's from one of the largest and fastest growing crypto asset managers, bit wise investments. Matt Ryan, thanks for being here with us today? How's everything going at Bit wise? ", "start": 0, "end": 33.736637}, {"speaker": "1", "podcast": "We're doing great. It's great to be in the crypto market. It's great a bit wise. Nice to be here. Yeah. Thanks for having us. ", "start": 34.706528, "end": 40.10358}, {"speaker": "0", "podcast": "Yeah. Happy all are here. So let's just get sided with started with the two of y'all in your background. What is your background and How did y'all end up in the crypto space and eventually at bit wise? Ryan? I think we'll start with you and then move over to Matt. ", "start": 41.214737, "end": 55.58941}, {"speaker": "2", "podcast": "Awesome. Yeah. My background is in traditional finance, studied, finance, and college, end up working in data and analytics for a little bit of a while at a consumer or or sorry, retail consumer goods company and then moved over to traditional finance into the asset management space, worked in Fp A at a at a large As manager Corp terra financial group for quite a long time. Before finally, you know, having the the ethereum bug by and kinda diving down the crypto rabbit hole initially in twenty seventeen, and then I kinda of pulled back a little bit as markets crash and I don't know, kinda focused on some other things. And then really twenty nineteen, twenty twenty rolled around and and Covid hit and found myself kind of aim walking around neighborhoods listening to different crypto podcasts. And through through that and just through it it crypto slowly consuming my life and and those around these lives. I figured this was the path I needed to take and was lucky enough to find an opportunity. At bit wise, after I've been looking for quite some time for the right fit and was able to make the jump over to the research team about a year and a half ago. And yeah, it's been been great ever since. ", "start": 56.463493, "end": 127.98108}, {"speaker": "1", "podcast": "We've been we've we've been lucky to have Ryan. Yeah. This is Matt. I'm the Cio if it wise. Been here for almost five years now. Like Ryan, I come from a traditional finance background. So before Crypto, I was in the exchange traded fund or Etf space. For more than a decade, I was the Ceo of a company called Etf dot com and built the first Etf data and analytics system, and ran that company for for, you know, more than ten years before selling it and then looking around for the next big disruptive piece of technology. Justin, you probably know Etfs are have taken over from mutual funds as the way most retail investors invest in stocks. And what many people don't know is fifteen years ago, no one believed in Etfs and everyone hated them. There were congressional hearings about Etfs, People thought they were snake oil. They were labeled weapons of best destruction. And so I saw this new financial technology go from something that people were very skeptical Glove to something that was mainstream and massive and multi trillions of. So after I sold that business, I looked around for the next big thing and Crypto was obviously hit. It's a bigger innovation than Etfs says bigger ramifications, and people didn't understand just how big it was. And so I was fortunate to to join Bit wise, but it was just a couple people. Now we're over seventy managing over a billion dollars in assets, and it was the best decision I ever made. Just That's interesting that you're comparing ", "start": 130.38171, "end": 217.40192}, {"speaker": "0", "podcast": "crypto assets, digital assets to Etfs. I think that's definitely a comparison that I have not heard before ", "start": 218.97758, "end": 224.98608}, {"speaker": "1", "podcast": "It's it's so apt. I'm telling you there were congressional hearings where they took the leaders of the Etf industry. Firms like Black rock, and they put them in front of senators and the senators grilled them and said Etfs are destroying American entrepreneurial. They're going to destroy the American dream. They're going to collapse the bond market. This is a new technology that can't possibly work, can't possibly be more efficient. We to do things the way we've been doing them forever. People forget that now because literally they're the mother's milk of investing, their how, to teachers invest, they're how my parents invest, they're how everyone invest, but new technologies work like that. People were really skeptical of the Internet, when it started out. It was just a of criminal activity and and bad information. And now everything that we do is on the Internet. So I do think know, I'm I'm in my mid forty. So I've seen some of these disruptive technologies go from. Things that people didn't trust, things that people thought were dangerous. You to mainstream part of our lives. And Crypto is doing that and actually doing it faster than these other technologies did. I know it's hard to imagine that now when, you know, much of Congress is still concerned about it, the public still doesn't understand it. But the growth curve is almost identical. And if anything a little bit faster than what I saw at Etfs and and what I saw earlier in the Internet. ", "start": 226.49434, "end": 307.16156}, {"speaker": "0", "podcast": "This is a great introduction to our talk. And Ryan, Wanted to follow with you too. You said that you were listening to a lot of crypto podcasts early on. Do you remember which podcasts those were that got you so hooked? ", "start": 308.4343, "end": 318.3916}, {"speaker": "2", "podcast": "Yeah. Definitely. I I was listening to a lot of bank lists at the time. At the time when you felt like they were bringing a new... Kind of like builder or or founder on every week. And and each week you actually could stay up to date on everything going on. In the industry. The defiant was also another one that I listened to a lot of which was great in interviewing founders and kind of introducing all these new primitives being being built out by the developers. Those are probably the main two that I listened to when I started out, and then I started listening to, yeah, a lot of books and the the podcast area crypto has grown so big since then. You know, it's kinda hard to to listen to all them these days. So, yeah, Try to try to stick to ", "start": 319.04318, "end": 362.02576}, {"speaker": "0", "podcast": "to bank and Block works Empires is another great one, and yeah, some of those kind of more niche ones like pledge allegiance as well. Yeah. Cam does a really great job with the defiant. I'm a big fan of that one as well. And everyone listens the bank list, I think. So... Yeah. Like you guys, like, I I also have a traditional finance background. I was in commercial banking for about twelve years, I think. And then yeah, then I started working with the index coop op a little bit, doing some chain crypto native. Index products, which are really more like Etfs, I guess, when you really look at it. But, yeah, and then Poly kinda asked me to to join and I've been doing that for the past three months. So it's been it's been a wild ride in the crypto space. But, yeah, anyway, let's let's talk about bit wise. Like, what is bit wise? And why is it important three Sure. I'll I'll take that one. You know, we're we're crypto asset manager, ", "start": 362.3392, "end": 415.98416}, {"speaker": "1", "podcast": "our niche where we really stand out from our peers. Is we're the largest crypto index fund provider in the world. So Justin, you know this coming from index Scoop. Indexes can be a great way for investors get broad based exposure to the market. We create the first traditional index fund that traditional investors could access since today. We manage close a billion to horse in those index products. That's one reason we're important. If you look at the traditional asset management industry, index funds typically are thirty to fifty percent of all assets. In crypto, it's a very small fraction, but I think that will grow over time. The other reasons we're important is or or our role that we play, is we're sort of a bridge to the traditional finance industry to understand what Crypto is. We serve financial advisors. We serve family offices. And we do a lot of education, sort of digesting crypto native content from Dj like Ryan into... Normal English that these financial advisers can understand as an example, we wrote the Cfa, Tu sky to Crypto, Cfa two's is like the leading credentialing organization within the financial industry. So we play this educational role and we help people get exposure. Yeah. And I've read that ", "start": 416.62192, "end": 490.72406}, {"speaker": "0", "podcast": "Cfa report for d defy decentralized finance and I thought it was really well written. Very very informative And what is the state of the institutional market? Like, what's the institutional market sentiment out there right now that bit wise seeing? ", "start": 491.19388, "end": 505.28238}, {"speaker": "1", "podcast": "Sure. Brian, I'll take a first swing and then you can follow up. The interesting thing about the institutional market, which is a little bit different than the retail market. Is that their interest hasn't wan at all with the pullback in prices. We do more meetings today than we did six months ago, when prices were much higher. Institutions are moving on a much slower timeline and the the the level of educational interest is interesting is is growing. So that's the first part. Most of them still haven't allocated to liquid crypto assets, but they're doing so. And then the other big thing that's happening in any institutional space, is to the extent that there were people who were allocating, it was bitcoin only. And to the extent that institutions understood crypto, it was bitcoin only. A big thing that's changed over the last six months is that it's moved from Bitcoin only to Bitcoin, ethereum and other assets. And the narrative has shifted from sort of monetary use cases to a broader array of use cases. And that's been a big shift. So I would say the level of interest is high, level of allocation is still low, but it's trending up into the right. ", "start": 506.25443, "end": 581.75543}, {"speaker": "2", "podcast": "Yeah. I just to build on that, I think that's that's exactly what we're seeing. The the the upcoming transition, you know, v ethereum and from proof of work to proof of stake has been on a lot of advisors minds and a lot of the conversations that we're having. And I think that's in part kind of driving this this openness to and and kind of like understanding and discovery of other crypto assets with more use cases outside of, you know, just bitcoin and kind of, you know, additional goal or whatever that narrative may be. And that's really great. And there's a lot of discussions you know, in the regulatory circuits or, you know, we saw a lot going on with with stable coins recently. But I think all of that ultimately just kind of shows institutions and our institutional partners that there's a lot more to crypto than just, you know, digital gold and and trying to, you know, replace the dollar, create a new form of money. Yeah. I think that's right. I have one more thought, Justin if I can add on. ", "start": 582.4089, "end": 635.3592}, {"speaker": "1", "podcast": "The other thing that's changing is is sort of the the level of risk that institutions are taking from a career perspective, if they advocate to allocate to crypto going down. So a few years ago, Crypto was thought of as this wild west of the institutional space, no one was doing it. And if you worked at an institutional asset manager and you raised your hand and said, we should allocate to crypto. That was a very risky thing to do. But now there are so many more institutions allocating through venture through some liquid tokens. It's being normalized and that's making it a lot easier for the people in these institutions to raise their hands and say we should look at it. And that normalization process is sort of been building over time, but I think it's gotten to the point where you're no longer looked at. Strangely, if you say, we should do a research project and investigate whether we should allocate to Crypto. Two years ago, that was very risky thing to do. Now, it's much lesser risky, and that's actually a pretty big and important change. ", "start": 637.02997, "end": 701.5629}, {"speaker": "0", "podcast": "Yeah. That's interesting. And like what else are the institutional players paying attention to in regards to the crypto market? Like when they're looking to make an investment are they focusing on the tech? Are they focusing on who's building on top of it or partnerships or price spit stability? What are they looking for? I think that given ", "start": 703.9646, "end": 723.2165}, {"speaker": "2", "podcast": "given, like, it's institutional investors, financial advisors, you know, family offices generally are more long term oriented investors. I think they are approaching crypto as an investment in a technology that's gonna, you know, continue to kind of grow, evolve over the next ten twenty, thirty years. And are approaching it from that framework. I think we see less attention on, you know, who the specific founders are or you know, even what technology they're building on, for example, when you think about like, scaling solutions or anything like that. And it's more around you know, what what traditional service is what they're building going to disrupt or place? And, you know, how do we think about Web three in crypto as the next evolution of the Internet technology versus versus, you know, kind betting on founders or betting on, you know, individual kind like price movement. ", "start": 723.7534, "end": 778.5056}, {"speaker": "1", "podcast": "Yeah. I think that's right. Institutions are pattern matches is my experience, Justin they want to look at something and say it was like this. Right? Because they teach you that this time is different are the four most expensive words in finance when you enter the institutional space. So they wanna teach you that this was like this. And what Ryan said about them thinking about technology is really important. I see more and more institutions saying, this is like other technology waves that we've seen. This is like the adoption of the Internet. This is like the adoption of web two This is like the adoption of cell phone networks and they're pattern matching to those things that they've seen in the past, and that's giving them a lot of confidence. So as they shifted from, this is a new form of money, which was not something they had seen. To this is a new technology that can sort of be the backbone of how web three develops. I think they're gaining a lot more confidence because it pattern matches to things that they've seen in their career and have been great investments in the past. ", "start": 779.14166, "end": 836.1707}, {"speaker": "0", "podcast": "Yeah. That makes sense. And what is kind of the makeup of your client and customer base? Is it mainly, like family offices and high net worth individuals or where else are you getting interest? Yeah. I would say that our primary clients, our family offices and financial advisors. Financial advisors or people that manage money for other individuals. ", "start": 836.9831, "end": 856.88696}, {"speaker": "1", "podcast": "And those are really big markets. We have interest on the barbell side. So we have some more institutional, whether that's hedge funds that are allocating or sort of pensions and endowments that are thinking about it. And we have some direct retail investment, but the sweet spot is financial advisors and family offices. A little known fact about financial advisors they control as much money as institutional investors in the classic sets. So people talk about pensions and endowments, that's a huge market. But financial advisers actually control the same amount of assets. It's a massive market out there. So that's our that's our sweet spot. ", "start": 858.2439, "end": 895.89655}, {"speaker": "2", "podcast": "Yeah. I would just clarify that or add on. I guess that you have financial advisers. Many people, I think who aren't familiar with the traditional asset management space. Kind of group financial advisors into this unknown institutional category, but it's interesting once you spend a lot of time in the space that a lot of financial advisors are, you know, are are... The folks that are managing, like our parents money or grandparents money and and things like that. And so they really are spread everywhere. Kind of throughout the financial investment industry and, yeah, as massive control, so much of the wealth and their interest in Crypto is kind of only on up into the right trajectory, which is really promising. ", "start": 896.78937, "end": 935.29694}, {"speaker": "0", "podcast": "Yeah. What kind of trends is bit wise seeing in the crypto base right now? Like, what are you y'all paying attention to? And are y'all seeing, like, any potential pressure points that others are not noticing in the crypto space right now? ", "start": 937.5254, "end": 952.07874}, {"speaker": "1", "podcast": "Brian take take shot. ", "start": 953.6634, "end": 954.7726}, {"speaker": "2", "podcast": "Yeah. The... So I think some interesting if bit wise is is there's a lot of opportunity in the market with prices kind of compressing back to, you know, the levels they rat a year or or more so go. And so we're seeing a lot of interest in those who, you know, saw a bitcoin and really decided, like, pay look, I may need some exposure to this when the chance comes as markets were climbing or saw ethereum or N ts or what have you? And now the prices have have collapsed. It's really creating really an interesting entry point. For financial advisors for our clients. And so we're seeing a lot of people who have been on the sidelines kind of, you know, getting more serious and take, you know, more steps towards gaining that exposure to Crypto. And, yeah. What's also interesting I think is given the the broader market also turned down, in Crypto generally a small portion of our client's kind of portfolio. One to two to to five percent. They may have been hit harder in the downturn on equities, and that kinda just gives them a chance to reset and really think about Crypto as a whole. And how it fits their portfolio. So I think we're actually seeing more interest in the downturn in in the number of ways, which is which is fascinating. But there's definitely some I think there's some apprehension on the regulatory front. The the privacy sanctions, tornado cash don't help. The upcoming midterms and, you know, hot debates are on coins are also top of mind. So I think there's some bullish ness on a a good entry point being met with some you know, some some watchful on the regulatory outlook. ", "start": 955.4237, "end": 1055.0992}, {"speaker": "1", "podcast": "Yeah. I think that's right. Regulation is on my mind. There's also typically a lot of Sec enforcement actions and timber. So there's sort of a short term regulatory overhang. It has be worried. The longer term things that I been thinking about Justin. One is actually regulation. I think Crypto views regulation with t fractionation. They're sort of worried about the advent of more regulation. I view it as a critical catalyst for the next major bull market. I think a big part of Bit wise thesis is that institutional investors are a huge wolf of capital that's going to enter the crypto market, and they are only gonna do so when we get more regulatory clarity. So I don't I don't like the idea of living through the process of the Sec and the Cf ftc butting heads over what is the security? And Congress building legislation that probably doesn't fully understand the crypto market. That keeps me up at night. But at the other side of that, Right? There is a beautiful land of building and growth. And so I think a lot about that. The other thing I think about, Justin that I I think the market is going to turn its attention to soon is scaling. Right now, the market has been sort of exclusively focused on the merge and excitement about the reduction in carbon footprint on eth the reduction of new issuance of eat the introduction of yield, but a much bigger story is going to be scaling. I think people have underestimated the extent to which the lack of throughput on things like Ethereum has slowed mainstream adoption and slowed mainstream use cases and slow to entrepreneurial activity. And so I'm spending a lot of my time thinking about what does this market look like? When ethereum can do ten thousand fifteen thousand, twenty, fifty thousand transactions a second. What new applications can we see and will be built and will go main So I'm I'm sort of moving on to the next technological breakthrough, once we get past the merge, which which scaling is big piece of. ", "start": 1055.6576, "end": 1171.0391}, {"speaker": "0", "podcast": "Yeah. At Poly gun, we're obviously very, very focused on scaling. And we have very, very similar beliefs to what you just described right there. But let's... I kinda wanna take, like, a step back and focus on the macro environment a little bit more. And we've touched on it a little bit from, like, a regulatory standpoint, but, you know, in what does bit wise feel about the current macro environment? And how does that relate to the crypto markets? ", "start": 1173.3623, "end": 1199.6399}, {"speaker": "1", "podcast": "Yeah. We think there three drivers for the price of any crypto asset. There's the macro environment what the Fed is doing, what monetary policy is doing. There's the crypto industry environment. What regulation is doing. And then there developments that are specific to individual crypto assets. So like ethereum and the merge. And if you look at the returns of any crypto asset, you can sort of decompose into those three factors to give you an example, Justin. In the crypto bear market, there were sort of two phases. There was the November to January phase. Which was a macro driven phase. That was when the Fed shifted from quantitative, easing to quantitative tightening and took the market down fifty percent. Then from May to June, there was a crypto industry phase. When Luna collapsed Celsius collapse, three hours capital collapse etcetera. The Fe had normalized, but the crypto industry went through its own sort of echo troubles. Since then, the recovery has happened in part because the fed market is sort of normalized. We've built in expectations on the macro environment. The crypto industry has stabilized. The regulatory news is mixed. But the crypto asset news has been very good. Ethereum has been progressing towards the mers that's been giving book confidence. My outlook for like the next six to twelve months is actually that the crypto industry and the asset specific drivers are going to be dominant. I don't think I think the market is priced in the expectation of what the Fed will do and sort of already accepted that and built that into prices. And so we're going to see what happens in crypto dictate what happens in prices. Because I'm optimistic about what's happening in crypto. I'm optimistic about price direction. I also think you're gonna see crypto assets return not be correlated with the stock market for the remainder of the year because you're going to have these crypto specific factors. So I'm feeling good about it. That could go out the window if we could get a Cpi print that's ten percent or something, but I don't expect that. I think it's really down to the crypto industry and I think the net trends there are positive. Some regulatory risk, but some major technological advancements in crypto to off set that. And so I'm pretty constructive on prices from here. And thinking of, like, regulatory... ", "start": 1200.4513, "end": 1340.6261}, {"speaker": "0", "podcast": "The regulatory environment as being of like a hindrance to innovation. I kind of want to talk about bit wise or your personal thoughts, Matt and ryan on Tornado cash. You know, is this the type of regulation that we should be looking for? Or do you feel like this is more of an overs step? Does it hinder innovation, what happened just your thoughts in general on this subject. Yeah. ", "start": 1341.2423, "end": 1364.7263}, {"speaker": "1", "podcast": "I'll start and Ryan can build. Tornado cash is one of those things that's really challenging to think about. Right? Because depending on your starting point, you can view it in two different ways. You can either view it as a tool that facilitates money laundering, and that's a bad thing. And we should stop that or you can think of it as a piece of code, a piece of speech and a neutral technology that can be used for financial privacy and potentially also use for bad things. But core to the Us sort of view is we shouldn't sanction speech and neutral technologies. And so I think the market has to figure out how to interpret work with this. And I think it'll be a painful process. It is a process we've seen in other disruptive technologies. Again, the early days of the Internet, there were concerns about whether platforms like Facebook would be liable for anything that someone posted on them. That was a big sort of constitutional and technological challenges that we had to work through as a country and we ended up doing so. In a way that allowed the Internet to to grow and flourish. I suspect we'll get through it on tornado cache. But it raises thorn questions. I think anyone who takes the dogma to you is probably wrong. It's going to be complex and nuanced. I do think it probably slows down innovation as we work through this process. Right? I I think there sort of systematic issues around how things like Ethereum interact with sanction addresses and things like that. That that raise major issues that are going to be a challenge that introduce uncertainty, and uncertainty slows down progress. So it's not a good thing, but it's probably a necessary thing and we'll probably work through it over the next year. I don't know, Ryan, if you have anything to add there. ", "start": 1365.4429, "end": 1468.6365}, {"speaker": "2", "podcast": "Yeah. You know, first and foremost, I think financial privacy is a really big deal and and it's really important. So I I think I come at through that lens. And and what matt said about how, you know, ethereum and Defy applications, and some of these other kind of layers, I guess, of the crypto ecosystem are going to be able to deal with the repercussions of sanctions or, you know, regulatory change is kind of, you know, front of my mind, I know recently, there's been a lot of conversation over the past forty eight hours around how staking services would deal with these kind of sanctions if they were to you know, amplify. And that's really concerning, especially when you think about how many people and how much narrative is currently around, you know, the power of staking as they're transitions and what that does for D five with liquid staking and you know, and defy lending applications and so on. That starting to become very concerning to me and how how we'll deal with that as as a industry. And so, yeah. And that that's just front of mind for me is is where do we go from here? How do we how do we maintain privacy while also making sure that we can scale because it's inevitable that, you know, the digital world that we're oral building is going to collide with the boundaries of the of the world we live in and we just yeah need to maintain and we... Ensure we maintain as much of that kind of value eat ethos of of crypto as possible. But I do think it's inevitable that there's some kind of you know, collision, we're starting to see that now. I'm I'm a little worried how that how that shakes out for the application layer and some of the the primitives that I was very excited about and still Am excited about, but just a little more, I guess, nervous about the road hat. ", "start": 1470.1549, "end": 1576.3483}, {"speaker": "0", "podcast": "Yeah. I think we all share similar sentiments there. And I think it's just it's kind of lifted the veil on some other centralized points of failure that we have in the ecosystem system too. Right? Like, with Fur and A, sin transactions to tornado cash, so there's like, censorship there and, you know, the front ends getting shut down. So I think the centralized front ends and the centralized Rpc networks have been something that we've talked about for years in this space, but we have nothing never really done anything about it. And it almost feels like it's it's too late. Do you feel like we're too late to make those changes? ", "start": 1578.8386, "end": 1615.5634}, {"speaker": "2", "podcast": "No. I don't I don't feel we're we're too late. It is definitely something that we've talked about for a long time and and yet you still see the centralized front ends, really dominating the space. And and look, it's unrealistic that any a bunch of individuals are gonna coat trade directly through the smart contracts themselves. And so we do need decentralized front ends and infrastructure that can be accessible and and, you know, isn't controlled by a team that is concerned about their livelihood, you know, regulatory landscape, etcetera. So. Definitely need to have more focus on that. I do I agree. I think it's gonna just continue to transition from. Hey, this would be a nice to have to. This is absolutely critical for the state of the three and into move forward. And that's a necessary transition, but there will be some pain points as as we do that. And some of that pain is just the education. Of new entrants of kind of industry participants who have been around for a while and in that just because there's a D five protocol. It doesn't mean that the act access points and all of the pillars kinda prop that up are equally decentralized and and, yeah, they're equally important. So... Yeah. ", "start": 1616.3586, "end": 1684.1787}, {"speaker": "1", "podcast": "Yep. I agree with that. Broadening out to to societal impacts. One good thing about this is it's raising the fact that our financial privacy is disappearing and putting it front and center. Right? Privacy disappears very slowly and people don't notice. It's like boiling a frog and then you wake up and their their social credit scores that won't let you, you know, book a ticket overseas or something. And the fact that this is sort of pushing that into the forefront and saying, we need down a conversation as a society about, is their financial privacy Do we trust governments to be able to sanction every economic connectivity we do if if we want to. What are the rules for that road? I think it's better that we have those now than five years down the road when that had already disappeared. So there's a societal good for forcing this uncomfortable conversation, and we'll see how we we we exit. ", "start": 1685.3856, "end": 1733.7648}, {"speaker": "0", "podcast": "Yeah. This subject definitely hits on a bunch of very unique talking points like free like freedom of speech, you know, related to code and incredibly neutral technologies and financial privacy. It's just... It's very interesting to see how this all plays out in the future. I think. But let's let's divert a little bit, and I wanna talk about other big things in the news related to the bankruptcies of three arrow capital in Celsius. I think it'd be helpful for the listeners just to, you know, just to know how does bit wise compare to three capital in Celsius. And was any of this a shock to the two of you? ", "start": 1736.3369, "end": 1775.9276}, {"speaker": "2", "podcast": "It was definitely shocking. You know, I think that... Look, the the unwinding of Us t and Luna was not all that shocking. I think there was a lot of people, you know, in the months leading up to to that that imp that that we're kind of expecting something we got to occur. So I don't think that that was that unexpected. The the fallout in the I guess hand in the cookie jar missed that occurred thereafter and the unwinding all of that was a little bit surprising at least at for me, especially with some of these bigger players, I was disappointed to see the the, you know, level of risk they took, especially when it had exposed customer client funds So, yeah, I would say it was little bit surprising how it all shook out and sell some of the things we're finding out even, you know, this week who the earnings releases are are a little bit a little bit shocking, but it just highlights the difference between centralized finance, yeah, decentralized finance, and the importance and distinguishing between the two. But but but, yeah and Matt, I guess talk through how bit wise is a little bit ", "start": 1778.89, "end": 1842.5667}, {"speaker": "1", "podcast": "different from from those those firms like three, Celsius and others. Yeah. I would add... It it was shocking at the time, of course, in retrospect makes all sorts of sense. Right, during any great bull market, people let down their guard. If you think about the real estate market, you know, during the great financial crisis, of course, giving people loans with no income verification and no credit documents was a bad idea. And yet there was a whole industry on Wall Street dedicated to that. Right? And it looks insane in retrospect. So, of course, extending un collateral loans to to a hedge fund three hours capital, for billions of dollars was a terrible idea, but during the bull run am I surprise it happens in retrospect not. Bit wise is different from something like three capital and that we're a un lever long only investor. So investors give us cash, they give us a hundred dollars and we buy a hundred dollars a bitcoin ethereum and other crypto assets. And so we're not exposed to sort of the the blow up risk that you see it's leverage and poor lending practices that lead to catastrophe, non crypto, but in all financial activities, it's the oldest financial story in the world. It's happened a hundred times in the history of modern finance, and then happened to Crypto. But bit wise doesn't take on lever positions. And so as a result, we don't have that kind of risk. ", "start": 1843.022, "end": 1923.5698}, {"speaker": "0", "podcast": "Right. But it's not uncommon to see, like, 2x x, three x lever Etfs. Does bit wise offer any of those? Or is that something in the pipeline maybe in the future, do you think? ", "start": 1925.7211, "end": 1936.7764}, {"speaker": "1", "podcast": "We do not at this time. Lever Etfs can be interesting trading vehicles. Bit wise right now is more focused on sort of long term investors. And for that perspective, leverage is a is a dangerous tool. It's not to say we won't ever use leverage in a portfolio ever. We might we haven't, but but I don't wanna fore that opportunity, but we won't be, you know, yellow into ten x lever exposures. Into the fifty largest asset. That's not our style. ", "start": 1937.5057, "end": 1968.8455}, {"speaker": "0", "podcast": "That makes sense. That's say for your investors. As well. It it seems like it seems like your focus is really just to help individuals get access to this market because it can't be very complicated. Right? Like opening up, you know, transferring your assets from coinbase base to a meta mask wallet and then, you know, connecting to the uni swap and making that trade. It's very complicated. And so that's kind of where I see at bit wise is fitting in for the most part, ", "start": 1971.1598, "end": 2001.4413}, {"speaker": "1", "podcast": "I mean, what do you agree with that? That's exactly right. We make it easy for traditional investors to safely access the crypto market. And they take a lot of comfort that we've been doing it for five years. We've lived through two bear markets. We've lived through forks. We've claimed forks, We've handled air drops. They don't know how to do any of that. So we abstract away that complexity and get them exposure to what is on an un lever basis the best performing asset class in the world over the last three, five and ten years by a large margin. Right? So for for traditional investors, I know that Ethereum, you know, eighty or ninety percent recovery since the market bottom in June is like H in Crypto world, but for a traditional investor used to six percent a year, that's a spectacular return. So we we help them get exposure to crypto by abstract away the complexity. And, yeah, that's that's it's well put. That's our that's our value prop. ", "start": 2002.797, "end": 2057.712}, {"speaker": "2", "podcast": "What are... Oh, sorry. Go. Oh, sorry. I was just gonna ask. Add to that. I think the other element of it is that spoke a little bit earlier about how advisers are only allocating about, you know, on, maybe five percent of their portfolio the most to to Crypto. That's about... If you think about the amount of, like, mental capacity, have to follow the crypto market and evaluate crypto assets and subs sectors of the crypto market and then choose individual winners, like, they just don't have them capacity city or or not mental capacity. I'm sorry, about like, you know, the time to do that. I mean, you know, as as being full time in the space, I could spend and, I have spent just countless hours, diving N projects and in discord and still, you know, have chosen the wrong ones many times. And so I think the other elements of what we're trying to do is like, hey, if you're an advisor and you're excited about And you want exposure to the Nxt space. Great. There's an T index. Same with D defy, you know, same with same with the top, just ten kind of crypto assets as a whole, if you have a lot of bitcoin, great ex bitcoin, Just trying to create that kind of, you know, directional exposure versus helping you know, helping thick individual assets, which just as we all know in this space is very, very, very tough. ", "start": 2059.2197, "end": 2130.1477}, {"speaker": "0", "podcast": "My next question was gonna be, you know, what are some of the structured products that... Or some of the Etfs that you offer your customers? And and you hit on those, but is there are there any other ones that maybe you didn't touch on in that in that answer? ", "start": 2133.5837, "end": 2144.7534}, {"speaker": "2", "podcast": "Yeah. Definitely. So we have... The the Bit wise ten is our largest and you know, longest standing crypto index, That's the top ten crypto assets by market cap. There's no there's no waiting caps or anything like that. So it's kind of natural exposure to the top ten crypto assets. We have the same index just excluding Bitcoin because naturally Bitcoin becomes a large large weighting of that first index, so we have the top ten assets, excluding bitcoin. And then we also have a D defy index, which is the top ten d defy assets, N t index, which also includes the top ten art and collectible N nlp projects, So it excludes things like real estate or you know, like, on a trading card, F t's like Nba top shots. And then we have crypto innovators, index as well, which is really exciting. That tracks the publicly traded crypto companies like coinbase base, like micro strategy like Bitcoin miners and silver gate. So that product also really exciting. And, yeah, there's... I I believe that covers most of them. I know I'm missing one or two solid mac. Let Matt rent it out? ", "start": 2145.5503, "end": 2212.8682}, {"speaker": "1", "podcast": "That's exactly right. The the the service we're trying to offer Justin, is it a financial advisor or it's investor wants exposure to x in the crypto market, d defy, meta, layer ones, you know, broad based index. We have a fund that does that for them. We're not all the way to having that product suite and of course, we're going to introduce more funds in the future, but that's the idea Ryan ran through some of the the highlights, but we want to provide that kind of exposure to investors. ", "start": 2213.827, "end": 2242.2097}, {"speaker": "0", "podcast": "Yeah. I'm just kinda looking at some of these them somatic Etfs that you'll have like, the D f fund. I see you've got like, uni swap of a maker L o curve, in in some other ones, What goes into the methodology to decide which assets are included in these products? ", "start": 2244.5273, "end": 2263.325}, {"speaker": "1", "podcast": "To great list of assets you just read through, and it made be smile just thinking about that fund. From one perspective, it's very simple, Justin, it's the largest D defy assets. We have to define what a d five crypto protocol is we look for protocols that compete directly with a traditional financial services offering. So In other words, they offer trading. They offer lending. They offer insurance. They offer asset management. So we define what is a D defy asset. And then we take the largest ten But there's an important caveat, which is we have a huge number of screens that screen out assets that we think may have significant risks. So we look for assets that may have regulatory risk based on the statements of regulators that may have technology risk that may have liquidity risks and we actually have an advisory council with folks from four of the leading d defy, sort of venture capital firms in the world, electric capital, framework, para, etcetera, that help us screen out assets that may have other risks as well. That make sure the assets in our index have legitimate users, legitimate use cases and have been tested from a technological perspective to minimize the risk of hacks and other items. So what you're left with is what we think of as sort of a blue chip D defy index. There are other D five protocols that are interesting for investors that we just don't think past must for a Us institutional investor because of regulatory risk or technology risks But I think you're left with a pretty great list of sort of the foundational pieces of d five. We're pretty excited about that fund. ", "start": 2263.9788, "end": 2363.4146}, {"speaker": "0", "podcast": "Yeah. And I'm a huge fan of D defy. Obviously, that's what got me into the space. And, yeah, when I look at this fund, it looks like yeah. The... The blue chip D defy protocols and seems like pretty good way to get that just general exposure to the D defy space. And then and then looking over at the Meta fund, I see Poly gon, ethereum, Sol file coin chain link, And so these to me don't really seem like Meta first plays, but maybe more like, maybe med infrastructure possibly. So what's the methodology there? And I don't know why like, why not include things like the central land x infinity, n F t? Sandbox, things like that. Yeah. ", "start": 2368.285, "end": 2411.9348}, {"speaker": "1", "podcast": "Absolutely. I love that question. So the methodology is is somewhat similar. It's slightly more complex and that we try to invest in a variety of different sectors of the meta space. So it is right to think of it as a meta infrastructure space, you know, that's why the... Those assets are in there. We do have in smaller allocations some up some of the more traditional things. I'm not I'm not try to look at the actual every holding. So so Central land is in there, It's just not a top ten allocation. And the reason for that is things like the central land are still relatively small. Right? So there's just not that much market cap in digital worlds. It's a sector within the fund, but the majority of the fund is in the infrastructure space. And that... That's about what you would expect in anything as early as the meta. Right? The actual meta right now is about building the infrastructure so that we can develop these immersive of interconnected digital worlds in the future. And and so most of the fund is invested in it. It's a pretty unique fund. It has two advisors that help us build it. So Matt Ball, who wrote a book on the meta and and sort of a leading thought leader in the med and multi point capital. They're on the index advisory board and they help. Decide what's in the index and decide what to over and underweight in the index. And we're pretty excited about it. You know, if the meta turns out to be a really big deal. I think the assets in this fund should do well, but it it is an infrastructure play in more than a a physical meta play at this point just because of the nature of the space. ", "start": 2412.4946, "end": 2516.2695}, {"speaker": "0", "podcast": "Yeah. And I obviously love to see Poly as the top holding or the top weighted in this fund. Are you seeing a lot of institutional interest in Poly gon? I mean, I know obviously like Bitcoin in ethereum we're gonna be one in one and two, but I guess, like, what is number three and, like, where does Poly fit in that? ", "start": 2517.2236, "end": 2535.3816}, {"speaker": "2", "podcast": "Yeah. I do think Poly gon is up there. You know, one thing that that Poly does that's really great. It it has great brand recognition and, you know, does tremendous job marketing and and the partnerships. Being established you know, across all kind of different sectors of the of the crypto industry with with kind of traditional whether it'd be like gaming studios other companies. I think really helps accelerate their kind of like adoption and scent to one of the top crypto assets or at least from from those who... Well, I guess, people in the industry but also those who don't follow as closely. There's just a lot of, like, great news flow and announced. Coming from the Poly ecosystem. So I do see that as being one of the assets that we we see a lot of focus on. In addition, it's the the narrative around scaling ethereum, right, and kind of like a scaling, an ag of scaling solutions is really, really attractive. Today because of all the capacity issues we've seen over the past year. So outside of Poly, I think we've we've seen a lot of interest in Sol, which you know, for for whatever reason, it's some some of our prospects and clients customers kind of come into crypto or start to get past with non ethereum print blockchain. So Sol Card and some other ones like that. So I would say, yeah, Poly Sol salon, probably the top the top two I'm hearing hearing questions about outside of, yeah, during in Bitcoin. ", "start": 2536.3357, "end": 2627.3027}, {"speaker": "1", "podcast": "Yeah. I think that's right. I also think that the level of interest in Poly gon is gonna increase. Over the next two years because I really think scaling is gonna be the dominant next narrative. Once we get past the merge and that is over baked in and understood. The market's gonna turn its attention to what's next? What's next is scaling. And obviously, that plays directly into Poly Alley. When we talk to investors about our top ten fund, we like to call a handful of assets, our prod one of them. Because it represents an important part of this emerging ecosystem, which you need to have in order for crypto to be as large and as mainstream as we expect it to be. So we don't talk about all ten assets, because some of them are, you know, relatively similar. We're not gonna spend a lot of time going through, you know, Card and and Avalanche. But we do talk about Poly because it's this distinct new other thing that's an important part of the narrative and it does resonate with with investors. ", "start": 2628.1775, "end": 2682.5454}, {"speaker": "0", "podcast": "Yeah. That makes that makes sense. And I I kinda wanna change the subject a little bit to a topic that we've been talking about in the crypto space forever. It seems like, but definitely like quite a few years and that is related to the Sec and Why won't they just approve a spot bitcoin Etf? Why won't they do it? Matt, ", "start": 2685.2732, "end": 2707.4666}, {"speaker": "1", "podcast": "I don't know. At this point, I don't know. To give them benefit for the doubt of the doubt... When the first spot Bitcoin Etf was was filed in twenty thirteen, they were right to dis it, The market was not mature enough to support a Bitcoin Etf in twenty third team. There weren't institutional custodian. There weren't institutional broker dealers. There weren't auditing standards that we were comfortable with. So they were right at that point. Sometime between twenty thirteen and today, though, they went from being right about it to being wrong about it. There, I can't follow the logic that prevents us from getting an Etf in Bitcoin, and, you know, I spent fifteen years in the industry and and was the ceo of t dot com. So I just don't know is the answer. I do know that a Bitcoin Etf with lower costs and improve security and improve access for American investors. And so it would be a net good to society in my view to have a Bitcoin Etf. And a net good for crypto. I hope we get one, and I don't know when it will be or what the pathway is at this point. ", "start": 2709.7974, "end": 2773.6665}, {"speaker": "0", "podcast": "But there are future Etfs out there currently. Right? Is that typically how it works like you will approve the future futures Etf before the spot Etf from an Sec standpoint, like, what have you seen historically? ", "start": 2775.7583, "end": 2787.9822}, {"speaker": "1", "podcast": "I mean, yeah, they're are futures Etfs. And importantly, the futures contract settles to the spot price. So the the Et etf is referencing the spot price in a way. But it's a less efficient way for investors to gain exposure because, of course, their roll costs and features and it's just a more expensive, less efficient way if any exposure. I think the Sec allowed a futures based Etf because futures trade on a regulated market. Right? The C is a well established derivatives exchange. It exists under regulatory structures. So they had a easier time accepting that. Coinbase base and other crypto trading venues the trade spot Bitcoin aren't regulated as national securities exchanges. And I think the Sec would like to see that. So that's sort of the the logical line that they're trying to tread, but it it makes no sense to me because it references the spot price. So Historically, in Etf land, you've seen both. You've seen futures get approved in in things like oil, but you've also seen gold where there's a spot gold Etf. But just hold golden n, and that was the first gold exposure in an Etf wrapper. So I don't know, Justin. It's a challenge for me. I wish it had happened It would be good for investors if it didn't, and I don't know when it will. ", "start": 2788.54, "end": 2868.1926}, {"speaker": "0", "podcast": "What other trends are y'all seeing in the space right now? Like, I think on the Poly side, we're seeing a lot of credit protocols or under collateral lending protocols for seeing a lot of innovation in Game and Meta and then D, which is the decentralized science is something that we're starting to see. Yeah. What kind of trends are you y'all seeing? Are are you y'all seeing these same trends and and what else? ", "start": 2869.7092, "end": 2894.9407}, {"speaker": "2", "podcast": "Yeah. Definitely seeing some similar set trends around around game game five. I think gaming is gonna be a big catalyst as as we move forward and and not so much ac axiom affinity type games, but more the the, like, Aaa gaming studios that are that are investing tons of capital into developing like, really good blockchain games. I think that's a trend that we're gonna continue seeing, take hold and go from, like, a narrative, a bullish narrative to actually, you know, material analyzing. Another trend, I think that's really big is improving the user interface of crypto. That has been something that's been talked about for a long time, but I think we're finally hitting this Chasm of mass adoption and the reality is like, I get annoyed using my bed mask half the time and my ledger and stuff. And if I've been in crypto for years and like, comfortable with doing that, and it still is frustrating Or I still get hung up on random. Random transactions. I can't imagine, you know, my parents or my sister or anybody kind of coming in and using crypto and using, like, the true crypto application. So yeah. I think I think user interface kinda getting an entire makeover that it's much needed and is really important. But there's tons of talent that's come through, you know, from from web two into web three over the past year. A lot of that tale like long term here to stay and I think we'll we'll see that improvement in that face lift. So I guess happening over the next year or two. Yeah. I think that's just to double click on that. I think that's ", "start": 2896.2173, "end": 2987.3328}, {"speaker": "0", "podcast": "kind what we're seeing as well. I I was at a conference week in South Korea and we were talking to all these South Korea d defy teams and, you know, we were saying, you know, what what are the next catalyst that's gonna drive D defy further. And the things we touched on were regulatory clarity, user interface improvements, and then also just returning back to core principles, probably, I think we're starting to see that a lot in the bear market where people just put principles first when they're building. And I think that's that's a big benefit as well. To the users. So, yeah, like I said, we're run up on time, but I just kinda wanna give you the last word. Like, is there anything that we didn't necessarily touch on that y'all wanna talk about specifically? ", "start": 2987.7078, "end": 3031.7683}, {"speaker": "1", "podcast": "You Ryan? ", "start": 3033.3557, "end": 3033.9114}, {"speaker": "2", "podcast": "No. I I think... Yeah. I think I'm good. Nothing nothing here that I felt we we didn't touch on. So had a great conversation. Appreciate all the all the questions and topics. ", "start": 3035.4988, "end": 3044.9504}, {"speaker": "1", "podcast": "Yeah. I thought it was great as well. I'd also just remind people, people worried about the bear market to keep it in context, As I mentioned, Crypto is still the best performing asset cost in the world over the last three, five and ten years. There way more people working in the Crypto web three t five space today, then there were three years ago in the last big major bear market, I'm so optimistic about where we're going. The technology is improving so fast. That the introduction of scalability is gonna unlock so many more new applications that... Yeah. I I I worry people panic because the market has been down a little bit. If you look at the bigger picture trends, use investment, people working in the space, technology improvements, regulation, they're all pretty steady state up to the right. And so a little bit of patience and long term view, I think goes a long way. Yep. And we'll just close this off with where can people go to find out more about the two of you and bit wise. Sure. Come on over to bit wise investments dot com. You can sign up for the monthly letter that we send out. And you could follow Ryan and I on Twitter. He's a much better follower than me, but we're both there. I'm Matt. Underscore Hogan, and Ryan is ras rock, which is pretty unique and and you can find out there, but follow us there. Awesome. ", "start": 3045.8394, "end": 3131.3767}, {"speaker": "0", "podcast": "And, yeah, to everyone listening and watching. Thanks for listening and watching. You're watching on Youtube, be sure to subscribe. And if you're listening on Spotify or Apple, subscribe there as well. Thanks again, Matt and Ryan from Bit wise, and we'll catch y'all all next time. Thanks everyone. ", "start": 3131.9333, "end": 3149.0537}], "summaries": [{"title": "1. Insights from Bitwise Investments on Crypto Asset Management", "summary": "In this episode of the Polygon Alpha podcast, host Justin Havens interviews Matt and Ryan from Bitwise Investments, a leading crypto asset manager. They discuss the current state of Bitwise Investments and the overall crypto market. The text also explores the backgrounds and journeys of Ryan and Matt in the crypto space, as well as the author's own transition from traditional finance to crypto research. They highlight the growth and acceptance of cryptocurrency, drawing parallels to the initial skepticism faced by ETFs and the internet. The role of Bitwise as a crypto asset manager is also emphasized."}, {"title": "2. The Rise of ETFs and the Emergence of Cryptocurrency", "summary": "Crypto index funds are gaining popularity as a way for traditional investors to enter the cryptocurrency market. The largest provider of these funds manages nearly a billion dollars in assets. While index funds are common in traditional finance, they are still a small fraction of the crypto market. However, this is expected to change as the industry grows. The company also plays an educational role, providing resources and translating complex concepts for financial advisors and investors. Institutional investors are showing increased interest in cryptocurrencies, with more meetings being held and a shift in focus from bitcoin to other assets like ethereum. This growing openness and understanding among institutional partners indicate a broader acceptance of cryptocurrencies in the institutional investment space. Financial advisors, who control a significant amount of assets, are also showing interest in crypto investments, contributing to the upward trajectory of the market."}, {"title": "3. The Impact of Crypto Podcasts on Ryan's Interest in Cryptocurrency", "summary": "This text discusses various aspects of the cryptocurrency industry, including financial privacy, regulation, scaling, the macro environment, and decentralization. It highlights the importance of having conversations about these topics and addresses concerns such as privacy erosion, regulatory challenges, and the need for decentralized infrastructure. The author expresses optimism about the future of the industry but acknowledges the challenges and uncertainties that lie ahead. Overall, the text emphasizes the need for privacy, innovation, and decentralization in the cryptocurrency ecosystem."}, {"title": "4. The Importance of Crypto Index Funds in the Financial Industry", "summary": "Bitwise is a long-only investor that avoids leverage and risky lending, aiming to protect against blow-ups and maintain a stable investment strategy. They provide user-friendly tools and platforms to help individuals navigate the complexities of trading cryptocurrencies. Bitwise offers various cryptocurrency indexes, including the Bitwise Ten, which consists of the top ten crypto assets by market cap. They also have indexes focused on DeFi assets, art and collectibles, and publicly traded crypto companies. Additionally, they have a fund that focuses on investing in the meta infrastructure space, with a particular emphasis on building the infrastructure for interconnected digital worlds."}, {"title": "5. The Growing Interest in Crypto Assets Beyond Bitcoin", "summary": "The text discusses various topics related to the cryptocurrency industry, including the rising popularity of Polygon and Solana, the debate surrounding the approval of a Bitcoin ETF by the SEC, trends in the blockchain space, the future of decentralized finance (DeFi), and the impact of climate change on food security. The author also highlights the consistent growth and potential of the crypto market despite short-term fluctuations. They provide information about their investment firm, Bit Wise, and encourage listeners and viewers to subscribe for future content."}]}