{
    "podcast": {
        "title": "Polygon Alpha Podcast",
        "host": "Justin Havens",
        "image": ""
    },
    "episode": {
        "title": "Risk-Aware DAO Treasury Management | Aera | Tarun Chitra | Polygon Alpha Podcast",
        "number": "24",
        "date": "DEC 7, 2022",
        "description": "",
        "url": "https://www.youtube.com/watch?v=15xrqqAnGMY",
        "speakers": {
            "0": "Justin Havens",
            "1": "Tarun Chitra"
        },
        "file": "december.mp3"
    },
    "transcripts": [
        {
            "speaker": "0",
            "podcast": "Hello everyone, welcome to the Poly alpha podcast. Where the Poly community gathers insights from today's leaders decentralized finance web. Three in Crypto. I'm your host Justin Havens, a aka Crypto. Let's get started. On today's episode Poly on Alpha, we are joined by Tu Chi, Who's the Ceo of Gauntlet and the founder of Era protocol. Tu. Thanks for being here with us today. How's everything going? Hey, Justin. Great to be here. You know, I mean, ",
            "start": 0,
            "end": 30.610085
        },
        {
            "speaker": "1",
            "podcast": "it's obviously been a tumultuous week in this world, but I think there's is People now understand ",
            "start": 31.404913,
            "end": 35.975967
        },
        {
            "speaker": "0",
            "podcast": "You gotta be careful about risks. Yeah. I think that's... That might be my main concern with this whole a debacle is the understanding aspect back than just hoping that the regulators don't lump in F t x with what D defy actually is. And that's something maybe we can talk about a little bit further into this. But I I really just wanna start off first with your background and how did you get into the Web three and crypto space So I spent the last... ",
            "start": 36.671127,
            "end": 65.055
        },
        {
            "speaker": "1",
            "podcast": "I guess twenty twenty two, so twelve years working on on simulation based research. And that sort of involves things where... You try to model complex systems by, you know, a collection of simple simpler math models and you use that to get some understanding about how the whole system behaves. The first types of work I worked on was sort of computational drug discovery, and, you know, at this place called D show research. And there we built a a supercomputer. Where we made custom chips for it. That was the first time I'd had heard about Bitcoin. So basically, we were working on building Asics, but they were not bitcoin Asics, And in two thousand eleven, two ten, no one was really building custom hardware, other than... Academic labs and there's no Apple making custom chips. There was no self driving card chips. There was no Ai chips, a lot of that stuff just didn't exist yet or, like, people hadn't try this production it. And so the the way I sort of first heard about Bitcoin was you know, we had put out a chip order for, like, twenty five million dollars. And then our supplier, we gave them we escrow the money and then our fired ghost us for six months. And then came back and was like, hey, we'll give you a ten percent discount and we were, like, you just cost us, like, six months of, like, production time and, like, actually, like, building this thing, you know, we're trying to build this machine out. And that was the first time I'd heard that people were building cost hardware for crypto down. And I was like, whoa, this is insane. So I mined a bunch of bitcoin then, sold it at the bottom in twenty thirteen, and And, you know, at that time, I still wasn't totally convinced. But by twenty fifteen and sixteen, especially when proof of steak. First sort of started to to come out. I had, you know, basically started to really read the academic papers and the papers people had written on, you know, how to make these systems, What were sort of some of the advances that had happened, And I think around that time there's the first time I'd actually seen, you know, real consistent formal mathematical proofs of, like... When cryptocurrencies work and don't, because there's sort of some classical theory in the distributed systems. And this is one of the reasons why I think a lot of people who are, you know, really smart Cs people don't really believe Crypto works is that there's sort of, like, a lot of Nuance into understanding how it gets around certain sort of things that people know that are, like, certain types of networks that are impossible. And the the sort of theory and math and stuff for that only was invented in twenty sixteen, twenty seventeen. So, like, a lot of people if they didn't take a class in that, they would just like, oh, this thing must not work or it must be centralized by default or or, like, like, oh a lot. There's a lot of ways you if you didn't understand sort of, like, the academic literature of that time, you might not have been able to convince yourself that this is not all... Like, this could work and it does work in some cases. So anyway, long story short, people... You know, I read all these papers, really awesome crypto, really... Kind of poor financial stuff. So, like, a lot of people wrote these papers where they were like, proof of sake is the same as proof of work. The coin is the same. And they're sort of this sense in which they're not because to, you know, I can kind of borrow the proof of stake coin and increase my you know, stake in the network and how much of the rewards I earn. On the other hand, for proof of work, I have to borrow electricity and then convert the electricity into a bitcoin or into the theorem pre merge. And so that extra step actually changes the financial properties on sync safety and security, of the system. And so that sort of got me down the rabbit hole of... Okay. How do you make these things work? I started sort of I I told a bunch of... I made some simulations for it, like, based off kind of simulations that resembles some things I worked on before, but also took into account some of the crypto specific stuff. And then I found some attacks. I showed some people at some layer ones and then they... They were like, okay. Yeah. Sure. Like, do you wanna work? For us and... I... At that time, I'd kind of been, like, everyone who raised money for Layer one was a little bit of a scammer to me. I don't I don't know how to describe it. It just like, it didn't seem like that legit because it was, like, post Ico boom, like... Yeah. It's like the late twenty seventeen early twenty eighteen, like, still kind of man moment. But you know, at that point, I'd started talking people and then I I was consulting for people instead of trying to work there. And then at some point I quit my job at that time I'd worked in high frequency trading and that was sort of where I I got the ideas for how to model the these kind of attacks where you you you borrow stake and, you know, As we of course, learn this week, leverage can kill and if if not done responsibly. But that sort of led me... Down this path and then Facebook tried to buy my one person consultancy for for Libra. And that was I was, you know what? If there's enough demand for all this stuff, people really do care about this risk analysis, they just haven't been... They haven't had time to think about or haven't... Formula how to think about it... Don't have the mathematical tools, don't have the software tools, and that sort of yeah led me to start on where we you know, we do risk modeling for Five protocols. You know, we cover, you know, all of the sort of big protocols on Avalanche, Poly, Eth. And a couple other networks, I think Polka it out. And and and we... The idea is that you have to kind of monitor these protocols to make sure that, like, hey, if the Five protocol is giving loans that are too aggressively high while the market is going down, need to submit a governance proposal and say, like, hey, we should actually be lowering the what the loan is. And the beauty of crypto is that all the data for this is public, all the sets and liabilities or these protocols are public. So you can construct a very holistic, very accurate simulation compared to traditional finance where you don't know what your counterparts have. And, you know, as we saw with the the centralized lenders like Genesis and Celsius and Block v blowing up. They also, you know, didn't they didn't really... It's very clear they didn't spend a lot of time on this and that's... That's of what we do. But one one of the other things and and sort of, you know, something we've been building on Poly gon for, you know, I think, nine months or so. Is a protocol for helping Dow sort of manage their treasuries in the decent decentralized manner and that's what Era and can definitely talk more about that. In whatever direction makes my sense? ",
            "start": 66.415,
            "end": 477.04294
        },
        {
            "speaker": "0",
            "podcast": "Yeah. Absolutely. Well, that was kind of my next question was, you know, what what is gauntlet would you you've have already answered. Thank you. And so what is era also? Because Gauntlet lint just, you know, to be clear because I feel like in in these days, we have you to be very clear about what is a centralized organization, what is a decentralized protocol, gauntlet being a centralized to company and Era being a decentralized on protocol. ",
            "start": 478.2415,
            "end": 503.82858
        },
        {
            "speaker": "1",
            "podcast": "Correct? Yes. So Gauntlet let the company. Is a service provider to Dallas. So we we we go to Dallas. We say, hey, we will monitor your protocol send governance proposals, you know, we've sent the most governance proposals. I think, like over eighty percent in compound in Nav. And we will... Whenever there's something that goes wrong, you know, we're constantly running these simulations off chain, and then anytime something goes wrong, we, like submit a governance proposal and then you have dashboards to see why that decision, why we're choosing those parameters. So that people who are involved in this, even if they don't totally understand, they're not, like constantly monitoring the protocol, they can an understanding of what they're voting on when they're voting on changing things and these in Five protocols. And but we are a centralized company. And one of the problems we have encountered was we were, like, thinking about... Okay. How does someone like Are. Increase The amount that they can land safely. And so in normal finance, the way you do that is you have an insurance fund. And Avi does have an insurance fund. The safety module. However, the Avi insurance fund is mainly consist of Avi token. It doesn't really consist of the assets that are being borrowed. So if there's sort of a crisis sort of like the one we saw last week. The assets in the insurance fund are going to be going down at the same time that every all the defaults are happening and you have to sort of have this ability to match assets and liabilities. And so every while we were analyzed, you know, while we do these kind of very fine grained analysis of protocols, we realize that if the treasuries of these five protocols were managed, more actively where the the treasury matches how people are using the protocol, like, it's eighty percent of the loans are in Usc, then the treasury should have, say thirty percent of its assets in In case those go under and you have to pay back lenders. And and you and you want have more, you know, less conservative risk parameter. And so the idea is that that was what made made made to start thinking about, like, how do you think about treasury management for dow. Right? I think, you know, there's a lot of holistic type of stuff that there's a lot of people who are sort of holistically analyzing this being like, okay, we should spend ten percent of the Dow treasury on grants and twenty percent on security audits and thirty percent on liquidity mining and twenty percent on marketing, if there is such such a thing and then budget depending on the Dow. And those are not the things I think that era is really focused on Era focused on things where there's a quantitative sort of objective for a dow. So in the case of a lending protocol, it might be, do my assets cover my liabilities, you know, like, Obviously, we've seen a lot of stuff with whether it's with F t or whether it's with Sent vendors where they... Their assets didn't cover their liabilities. And D defy... Because... A real D defy, you know, like, the the stuff that's existed for a, not not sort of the the the Luna type of stuff and has survived for a while. Has generically been quite conservative with how how lending works, which is which is a good thing. Right? I mean, that... Inevitably. But in order to kind of get off chain finance and on chain finance to, like, be anywhere close to each other, you have to be able to sort of act actively manage these insurance or treasury funds. And so our initial version is really focused on actively managing insurance and treasury funds. So that, you know, when there is something like the last week, you can actually cover you know, the lenders and make them whole. But the long term architecture of era is such a any quantitative thing that you can say about Ada dow on chain. If you wanna make that your objective, your Kpi, your North star, Era can basically incentivize people to opt to make portfolios that optimize your treasury to optimize your objective. So another objective might be hey, we wanna have at least five years of runway. We also wanna make sure that we own the dow owns at least... Twenty percent of its governance token. And we also wanna make sure the Dow doesn't incur transaction costs more than five percent. Right? So those... That's that's a Kpi. Right? That's like a thing the member's of dow could agree on, they vote on that and you can turn that into a on chain objective functions, something that, you know, can be measured on chain. And the key thing is it being on chain. If it's off chain, then you have to trust off chain for. But when there's an on chain measurable thing. And then Era makes a game, the where people compete to to to to give portfolios, like how the Dow should spend its treasury that maximize that. So, you know, Maybe you give a portfolio that says the Dow should be eighty percent governance token, ten percent Usd and ten percent mad. And when you submit that... And someone else says that it should be fifty percent mad. Thirty percent governance token twenty percent stable claim. And so you could think of Era as saying, okay. I'm gonna take both your portfolios. I'm gonna make an aggregated portfolio, which might be like, you know, forty percent mat, forty percent Ga hook, twenty percent. Stable. And it trades and then it makes... It trades into that portfolio. And then, you know, it stays in that portfolio for some amount of time like say, a week. And then the people who submitted these portfolios are graded on how well they optimize the objective. So maybe the person who said, you know, really high mat percentage was actually correct because the Dow governance took and went down a lot over dramatic. And so they get rewarded more, And the person who says who chooses sort of, like, a portfolio that does less they get rewarded less or even slash if it causes a loss. ",
            "start": 504.30734,
            "end": 873.40375
        },
        {
            "speaker": "0",
            "podcast": "And So does that kinda make sense? Yeah. No. Absolutely It does. And and just for clarity, when you're talking about the the Dow treasury or the protocol? Treasury. This is revenue that has been generated by the protocol, which is then sent to a treasury that is governed by the token holders and not at all, the funds that are deposited ",
            "start": 875.0751,
            "end": 896.7725
        },
        {
            "speaker": "1",
            "podcast": "into the protocol by Us. Correct. So actually a Dallas treasury is usually when you create the Dow, some fraction of the Dow governance so can actually sit in the treasury to be spent over time. And then also fees, but this is not user funds whatsoever. This is this is pure... And the beauty of Defy versus sort of something like what we saw with that t x, is that there's a... Clear segregation of these funds on chain and that that's the the beauty of, like, being on chain as a Defect protocol. You always have proof of reserves and you always have proof of liabilities. You can always see both of them, and there's no way of anyone kind of manipulating those. And moreover, you also have separation of dow treasury owned funds by the token holders and user funds owned by the users and the users can withdraw whenever they want. Right? That's that's paramount. And, you know, in the normal in a normal bank in a normal capital structure. It's always sort of like debt holders first then equity holders than maybe customers. Right? And d five flips us on its head because it's customers first, ",
            "start": 897.1499,
            "end": 965.3698
        },
        {
            "speaker": "0",
            "podcast": "then Token holders. And, you know, right there's no debt holders because there's no debt in D defy, but maybe maybe there will be one day. Right? Right. Maybe maybe there will be. Yeah. And I've also seen... Now and you're talking about the safety module as well? And so is the safety module included in the Dallas treasury assets or is that is that a separate, I guess, pool of pool of funds? ",
            "start": 966.4898,
            "end": 988.8705
        },
        {
            "speaker": "1",
            "podcast": "So... Yeah. So I think the safety module is usually... Separate, but it is controlled by the dow. So one of the things in the obvious safety module, for instance, is that when they're is a an event to on chain that's like an ins solve, it allows the dow to withdraw from the safety module. And, like, basically, the safety module takes a haircut. So anyone can stake Abe in the safety module to earn yield. But the idea is that, like... The dow get is allowed to you... If you stake it, it's allowed to use that for insurance. But the key there, unlike what happened to people who held F, is that you are opting in to providing that insurance for the. Right? You're earning some yield, but you're opting in. You're not just automatically haircut as a ave holder if if it's covering the losses. And that's the key thing. I think it a Five's design that people kind of underestimate actually people who are who are only used to the centralized crypto world and haven't and, like, you know, most of their experience is, you know, at Bin or F t. As or coinbase? Well, I guess I should've have said was that F apologies. But but but but but like... The difference is that you you know, D defy is really a customer first place. Right? Like, it really is like you can withdraw first. And I think this is something people in traditional funds don't understand because without self custody, you can't guarantee that. Right? You... Without you being able to control your keys, you can't really guarantee you could withdraw time. You still rely on someone else like actually doing the transfer, whereas crypto, you don't do that. And the idea of Defy is the most customer first type of financial product I think is, like, something hopefully, everyone. Who, like, really committed to, like, the on chan Ecosystem, like, we can, like, convince people of, you know, in a world where people maybe can't differentiate between Say F and avi compound. ",
            "start": 989.58435,
            "end": 1105.8776
        },
        {
            "speaker": "0",
            "podcast": "Right. And I worked in traditional finance as a commercial lender for about twelve years and Yeah. Well, when I explain this to my former colleagues and friends who still work in that space, it's very difficult to get that point across to them, I think. The self custody aspect and how the the transparency on chain and how centralized entities like F t, bin, coinbase are not defy protocols like of, compounds synthetic, curve, etcetera, etcetera, etcetera. And I think you know, in my time as a commercial lender, I was also lending money to insurance companies. And, you know, the risk bearing entities and also reins insurance companies. And I've also seen Error be described as a treasury reins insurance protocol. And I I understand what reins insurance means in in the traditional sense, and I'm just kinda wondering, like, does that have a different meaning ",
            "start": 1106.7512,
            "end": 1163.6155
        },
        {
            "speaker": "1",
            "podcast": "when Era is talking about it. Yeah. So I think the way we we think about it is risk aware treasury management. So it's slightly different than reins insurance in some ways, but the similarities to reins insurance are the following. If we think of the Avi safety module as being the insurance fund, insect Avi. If the Avi safety module deposits at some fraction of its assets into era then era is basically taking on the risk, the first tran risk sort of of the protocol because it's it's it's adjusting, the allocation it got to, you know, whatever the objective is, which is, like, make sure that the assets in era match the liabilities and the Avi protocol. The liabilities an A protocol rate. Right? Anyone can open and close a alone at any time. Right? So the the point of this active management is to make sure that that trade But that is very similar to an insurance company selling off their a tran of their insurance prem to a reins to cover. That. So it it does share that similarity. I think the difference is in crypto, insurance funds aren't really actively managed. So In some sense, anything deposited into Arr serves as sort of half like the primary insurance and half like reins insurance. Does that make sense? Because, like, usually, you think of reins entrant... The... The reason this is kinda complicated is in normal a normal insurer, let's say an inch insurer of a bank. One the bank gives me dollars. And then with those dollars, I sell part of the risk off. But the difference here is that the protocol gives me its governance token mainly. So it's giving me a risky asset already. So it it that... In that sense it, like, it it has a bit of both reins insurance and insurance, so it's But the idea is that, you know, what does a reins do was insurer do they trade their prem to match their liabilities as much as possible. Right? Right? That... That's the point of Yeah. Exactly. And and the point is right now in D defy, we're a little bit held back by the fact that we don't do much management of these insurance funds. Even though the liabilities are changing all the time because people are using these protocol. And so the the point of arr to solve that in a way that's cr decent decentralized. Because right now, almost everything that's treasury management is effectively centralized or cr goes through a governance vote. But asset management has to be much more responsive than, you know, like a week on governance vote. Mh. ",
            "start": 1164.0884,
            "end": 1311.4613
        },
        {
            "speaker": "0",
            "podcast": "Yeah. And it it really just kind feels like the the focus of Era here is to provide this kind of almost traditional... Capital efficiency. And for these dow, these is decentralized autonomous organizations. And like, do you really think it's possible that in this like pseudo anonymous, transparent world that you and I work in, that we can actually have that traditional capital efficiency, with active market with like, with an active market where participants or I guess they're in sea. I think you said, like, they're incentivized to create the most capital efficient strategies. I mean, I I... Yeah. Okay. That that that sense to me. So, you know... Let's try to, like, ",
            "start": 1312.1145,
            "end": 1361.786
        },
        {
            "speaker": "1",
            "podcast": "maybe dissect it in the following way. So what is really capital efficiency? Capital efficiency Like, what is the maximum amount of risk bearing assets den dominated in a numerous say dollars, divided by the minimum amount of supply I need in the protocol of assets to to to service that risky thing. Right? That sort of you you can think that's your capital efficiency ratio Now in crypto, because it's permission list, the denominator, the minimum amount of capital you need is is higher. Because you really can't you can't, like, grade every user immediately. Like, but people are trying to do things like that, but I I think until We are in... A until we've really spent a lot of time on the the sort of like zero knowledge proof version of of lending protocols, I think it's gonna be quite hard. But the denominator is just always bigger. So the the only way to sort of increase the numerator is to... Effectively allow every dollar of risk bearing asset to be covered by sort of some portfolio. That's that's dip like one one one important part is that there's sort of the the denominator of, like, the amount of capital you need. The... How volatile that denominator is is right now, basically, how volatile is your governance took? Because ninety percent of these treasuries are mainly their governance took. Right? But if you reduce the volatility of that, you actually can start increasing the numerator. Right? You you you actually you actually know that the numerator is correlated into the denominator like, the amount of assets going out that are taking risk is correlated to the amounts of assets that are in holding that are held that are meant to back that. And part of those assets are the the the lenders assets, like the the users who are supplying But the key thing, and this is extremely important to avoid something like an Where the funds got come ming gold is that... You you you wanna make sure that the Dow assets that their supplier are being optimized because that actually does shrink the denominator and and then sort of the volatility in the denominator. So that you can have much more confidence in increasing the numerator. You can't just kind of... If you comm funds, like like we'll have that you you suddenly made the the denominator look really big. And so you you're like, okay, I can keep making the numerator really high, but you didn't you didn't really... Text solves the problem because, like, the denominator if if its volatility goes up, then you're you're blown out of the water on the the portion committed by the... The protocol or exchange in this case. And so so if we think about just do, you know, another way of thinking about this is The numerator is the risk assets taken by the borrowers by the people trading perpetual by people making options whatever. The denominator however can be split up into two components. One component is the assets supplied by lender trying Earn yield, and the other component is protocol owned liquidity protocol provided liquidity. Right? And the key is, like, making sure that you can minimize how much protocol provides liquid you need, while being able to service the same amount of risk. And that's, you know, in a bull market, you can get away with just making your governance token the protocol and liquidity. But in that in a more optimized market, you you do need to actually improve that. Does that make sense? Sorry. Maybe it was like two in the weeds technically. No, that totally makes sense. No. Absolutely. ",
            "start": 1363.1383,
            "end": 1574.6917
        },
        {
            "speaker": "0",
            "podcast": "And Another question I have is, are you focusing on Dow only or would you also be interested in, like, other web two... T web two point five entities using this product. I guess it doesn't matter because it's permission list. Right? Yeah. Yeah. So the the long term goal is... ",
            "start": 1575.0908,
            "end": 1591.8113
        },
        {
            "speaker": "1",
            "podcast": "Actually to basically... You know, like I said, first, these insurance funds. But then because the the framework is generic. There's just some index that you target. Think of the index that you target is like, an Etf index, the the index could be like this runway management treasury management, type of thing, like, generic treasury management type of problem. So Whatever that calculation is as long as it can be done on chain and you can compute it in a single block. You can use that to mark the portfolios that people are submitting. And so people are competing, do you ever remember do you remember the the company num? Absolutely. Yes. And so you could think of this as, like for da and and and there's, like, different objective functions. They're not just... Make the maximum amount of money. Right? The key thing is that that should not be a Dow goal with their Treasure. Right? The Dow goal is like, lower our volatility, cover our app, insurance funds like, they they have different goals. They're they are institutions. They are not d gen traders, usually. And One key thing is that P has one very key problem slash flaw in in some way that... I mean, works in traditional markets, but doesn't work in crypto. Which is it relies on an off chain entity, the company that's running to go execute the trades. Right? To go, and we have D defy here. We don't need that. You can have a closed loop. Like, people can give you all the predictions. You aggregate them, you trade into it, fully on chain, you grade them fully on chain. And the idea that you have this closed loop that never has to leave the on chain world, makes it much harder to tamper with than the the process if that makes sense? ",
            "start": 1592.4646,
            "end": 1692.786
        },
        {
            "speaker": "0",
            "podcast": "Yeah. It does. And when you were talking about Num, I had to look it up. I knew there was a protocol associated with it and it's like the Eras eurasia protocol. You're just having all these flashbacks, so thanks for that. So I I I don't know. I feel like Well, True, are you long term bullish on undo? And do you think they need the legal rapper? ",
            "start": 1693.5032,
            "end": 1712.4807
        },
        {
            "speaker": "1",
            "podcast": "My long term bullish on undo if I I Like, I think there will be hundreds of billions of dollars, if not trillions of dollars managed by Dow. So if if if you... If that's bullish then... Yeah. Take that for both. But I basically think the Internet has never had its own version of an analysis. C or an Lp nlp and, like, where it's like, cr an institution that you can you can actually have the you can validate and you don't need the court system to reconcile choices that are made. Right? That that that's sort of the like crazy part. Like, so far, if we've looked at the Internet right now, I kind of feel like we're in the fifteen hundreds and we're like living pre French revolution in a f. Right? There's like a couple big places. We're all really just surf till the land with with our content we're making. And, you know, there's no way to actually make your own institution. Yeah. Sure. You could, like, put your business on Facebook or Tiktok or whatever. But it's actually quite different than, you know, having your actual business be native to the Internet or native to the platform. Right? And like... Everyone who's ever said they're native to the Internet, like Stripe is not really, right? They're really a rapper on banks. And like, hide that from the user, so they think they're native on the internet. Right? But if you rebuild it from scratch, you have the French revolution of the Internet, which, you know, in my mind is sort of what You're hoping for, then you need to have the notion of the joint stock company. And you need have a a way that the joint stock company exists on the Internet as its own entity that can be managed and, like, has some notion of by laws and and some notion of how things get passed. And some notion of safeguards some notion of insurance, all of these things. Right? Like, all the stuff like a normal company has, except in a way that works without needing post hoc reconciliation from a court. And maybe you won't get all of them. But the idea that the you need cr neutral online institutions as the future is the thing I'm most bullish on. Whether those institutions are financial. Mean, obviously, the financial ones are the easiest ones to see it today. The they might not all be financial. In fact, they probably won't all be financial. In terms of the rapper, I'm a little bit torn on that. A lot of the wrappers are la. They're really just, like, governments trying to, like, get people who have crypto businesses to open in their end their jurisdiction. I'm like, some of the Dow laws don't even, like, understand what the decisions of Dow is making are. They don't talk about like, multi sig versus... On chain contract. They don't talk about, like, all the nuances of actually being a dow. And so I I think, like, At the current state, I would say I'm quite negative on the wrappers, just more from the fact that the the things you see, like the Wyoming Dal law. There's a lot of people who are registered Wyoming Dow who have never used a nurse's safe. And like, you know what I mean like that? There's there's this Right Right. Like, then there are a lot of people who kinda like, oh, we're crypto. We like have a Wyoming Dow Llc. And then you ask so many questions about that, and they don't totally understand. The on chain world at all. And I feel like if you believe in this future of, like, cr neutral institutions are on the Internet, that have money of their own that they can manage with their users that of their participants in general. Those things don't really match that. And and and I I Totally understand that regulators are going to try to come at it that way. Right? Like, the the Cf Oo da type of notice But in general, I just don't think that will be the the way this this long term evolves. Like, unless governments come up with some framework. Where there's some notion in which the, like, real wrapped wrapper of the Llc is forced to check to do this proof of reserves and liabilities for the dow and, like, really know it, like, the chain stuff matches the off chain stuff. And that every off chain instrument held by the Llc, corresponds one to one at all times with an on chain. Representation, whether it's an N, whether it's token, whether it's some other type of digital asset. And I think the only people who've actually really focused hard on that direction is Maker down in the sense that, like, the Maker dow real world assets do try to guarantee that. Now, of course, you could argue that they haven't been that a successful onboarding whereas, like, these rappers have sort of been faster onboarding. But I guess my long term point is, like, if we really want these institutions to be truly, you know, without the training wheels of like, the Fintech companies and, like, people who, like... Are really wrappers around existing systems. I I think we actually need, like, some type of thing that is force forces the off chain piece and on chain piece to be, you know, really, really really synchronized if that makes sense. ",
            "start": 1713.1151,
            "end": 2015.966
        },
        {
            "speaker": "0",
            "podcast": "Yeah. No. I totally agree. I was just really interested to get your opinions on that. Any, I totally agree in this sense... That you know, I think Dow in tokens, like they provide these new primitives for human coordination. And I talked about this a little bit two episodes ago when I was talking with John over at Op. But, yeah, well the first time when I was working with the index coop op Dow or the next cup? However you wanna to say it two When I first started contributing and I just, you know, got paid directly to my wallet on chain, and there's no bank account there's just a group of people who came together over common cause. It was it was pretty fascinating to me. It definitely like a huge light bulb moment. And I think it's like it's so interesting how tokens create this incentive of alignment for people who live. All over the world to act the way in which I guess the protocol is intending them to act and to go back to Era, y'all have, I think two or maybe three really different parties that help make the protocol act in the way it's supposed to You've got the guardians. You've got the arbitrage. And then you've got the actual dow as well. So I'm wondering if you can just kinda talk through those incentives those incentive structures that make everything work. ",
            "start": 2017.0157,
            "end": 2097.9502
        },
        {
            "speaker": "1",
            "podcast": "For sure. So the idea is that, you know, Dow would vote to deposit some of its treasury into an irr vault. And in the beginning actually for, aero governance would vote to allow it in in the same way that compound ave, you can't add any asset. And of course, you know, Gauntlet over the last two years has field many people trying to ask us to add F t or Usc and it can be quite important to be a little bit selective when it comes to insurance like things. And our goal is for objective functions that are like... Treasury management that don't don't have any risk. It'll be sort of trust list, You should be able to make your own vault without any reaction, But for things that involve risk we're being a lot more careful. Where, like, both governance have to agree on on the vault. You can think there there's like a bilateral partnership. And once once it happens, dow deposits, it's it's assets... Well, actually, the dow... Both dow are actually voting on the objective function. So maybe it's assets always need to be greater than liabilities. Maybe it's, you know, we need this much runway. We want this little... We want to be, you know, dis correlate to the market and this un correlate to the market. Things like that. And when after that, the guardians, they submit portfolios, for what the Dow should should be in. So maybe it should be fifty percent. Governance token, you know, thirty percent stable coins in the remainder and east or mat or options on those. And the guardians each will, you know, that then the protocols way of aggregating their portfolios. That's then think of the way, like, you know, an Oracle aggregates many people submitting a price. Here it's many people's portfolios, but aggregated is in a way that's based on how well they've done in this system. So you can I wouldn't call it like a a full reputation system as much as a system of, like, how good have you been at predicting over many rounds? And like, you you increase your relative score based on how well your predictions are work and you decrease if they they get worse. So there is it is a sort of track record, but it's not reputation in the sense of you know I think a lot of people in more in the Web three non finance space have a notion of, like, on chain reputation that's much stronger, like it involves some sort of notion of persistent identity? This is not quite the same. You can't transfer it, and it's really about, like, does this address generally send good portfolios. And if they do, they their their thing when aggregated is higher. So a bunch of oracle do actually do this, so chain link off chain has a scoring system. P on chain has a scoring system. So, like, if you're a good pitch submit, your prices get, you know, your price is weighted higher than someone who has less of a track record of good submissions. And so the idea here is you're building on chain reputation for submitting these portfolios based on how well they perform. And then, you know, there's sort of a notion of, like an epoch think like a proof of safety epoch where over a certain amount of time, you know, the the protocol trades insert portfolio and then it holds that portfolio and then at the end of the epoch, people get graded, And that's when you update the how well they did sort of this, you know, this sort of, you know, their track record, and then you pay fees or slash people. So the guardians have to stake in order in order to provide recommendations. And part of the reason for that is that the last agent in the system that that you mentioned is the arbitrage. So the arbitrage will trade against the Dallas portfolio and the Vault. Until it reaches the target portfolio. So let's say, initially, at time zero, the Dallas portfolio is fifty fifty Mat Dc. And then the submit say actually it should be eighty twenty Mat Dc and the the arbitrage is trade against the Vault until it reaches to eighty twenty. And then the eighty twenty portfolio is held for a certain amount of time and then the guardians integrated. Now, you could imagine the guardian and the arbitrage being the same person or c polluting And the guardian just gives the the... Like, there's just say one guardian, the... And they could skew the the portfolio to be, say, go from fifty fifty to ninety ten. Then the protocol would be sell or, let's say, ten ninety then the protocol be selling a lot of mat at at basically cheap prices. And the arbitrage would be able to buy the cheap prices. So in some sense, you need to make sure that the guardians are not c concluding with the arbitrage and and having the dow sell its assets cheaply. And so the notion of slashing in this system is to basically ensure that the economic damage done by a bad portfolio is at least... It is is sort of the amount that you get slashes at least that So is the is the slashing? Is that occurred ",
            "start": 2098.5894,
            "end": 2412.2593
        },
        {
            "speaker": "0",
            "podcast": "like in an optimistic sense? ",
            "start": 2413.1904,
            "end": 2414.542
        },
        {
            "speaker": "1",
            "podcast": "Yeah. It happens at after the... Like, you submit portfolio? East steak. And then, you know, at the end of the the round, you're slash if you get slashed. ",
            "start": 2415.4165,
            "end": 2425.6118
        },
        {
            "speaker": "0",
            "podcast": "And I think I think some people would also consider the fact that I guess the more... Technically the more capital efficient you are, the more risk you are accepting. And so I get... What are your thoughts on mitigating that type of risk or is it also if your two capital inefficient is the risk do is the risk there as well. ",
            "start": 2426.1836,
            "end": 2449.6152
        },
        {
            "speaker": "1",
            "podcast": "So you know, we Gone spent we spent the last four years basically working on how do we improve capital efficiency by adjusting these parameters with... With sort of when market conditions change. And one thing we realized is like, over time from, like, really, really analyzing these things and continuously running millions of simulations every week. Is that over you do need some notion of like a better capital buffer to inc to to be able to increase risk. Like, like, this gets back to the... The fact that the first defect protocols like compound when it launched, you know, the denominator of the... How much capillary we lending out versus how much you know, capital we have tabs sitting in the protocol to service that, assume that the protocol contributed nothing to that to the to denominator. Right? And so then all the capital come from the suppliers, which meant that it had to be way more over collateral. To be safe. And the the goal is over time to allow the dow to contribute more and more capital so that the the denominator gets bigger and then you can start increasing the amount of risk that goes out. That... So the numerator can go up, and then you basically improve capital efficiency that way. And right now, we just have not... You know, that is what a good institution does. Right? Is that they they put in their own capital ",
            "start": 2450.4265,
            "end": 2537.7964
        },
        {
            "speaker": "0",
            "podcast": "to ensure that the numerator stays up, while not mixing their capital. Wait. Did you say that was the point all along with? Compound was for the protocol to contribute its own capital for, like, that baseline. ",
            "start": 2538.2688,
            "end": 2549.7722
        },
        {
            "speaker": "1",
            "podcast": "I I I think not I I'm not sure if. Pension, but that idea is the protocol does earn fees. Right? Correct. Are sitting in the Dow. And over time, and in compound v three is starting to move to this... Model right? Where, like, the dow can do some of the liquidation is basically a a way in which all the capital that's acc over time, you can use it to sort of act as a backstop and then allow higher collateral factors. Right? That's what happens in traditional finance. It's just that in Defy, you have to really be careful because it's permission list and you can't, like, go sue someone when the loan goes bad right Which means like you have to be very very careful about these these these parameters. And obviously, why we error on the side of. Right? Safety over efficiency a lot. Right? But I I I think that your your second question about whether capital inefficiency can be risky. That actually can be true if you basically by being quite capital inefficient, you dis people creating liquidity for processing liquidation because they happen so infrequently that no one wants to Lp in the... The Uni swap pool or or balance or pool or Since you swap pool for that asset over time because they're not getting... The fees they're getting is are are not that big and often oftentimes liquidation generate huge fees for Lps. And so there's sort of this interesting thing of like, yes, inefficiency is bad if liquidity goes down. Down. So but it's it's not super intuitive and I would say we haven't seen it happen with many assets. One example, however, where we did see this happen. Although, obviously, it has many con confounded variables. So it's not as simple as a story I'm seeing, is is... Was sort of with ex sushi on on Nav and and and sort of. There there been a couple examples where we're were like... ",
            "start": 2550.809,
            "end": 2676.2854
        },
        {
            "speaker": "0",
            "podcast": "Right Then whole. I I I remember I remember that that was recent too. So... Yeah. Yeah. So I actually have a a ",
            "start": 2677.1802,
            "end": 2683.7952
        },
        {
            "speaker": "1",
            "podcast": "presentation I gave at this security conference like detailing how the math of that thing works, because the attack is actually quite complicated. And we we put up gauntlet put up, like the emergency proposal to like, help freeze that. So I spent a lot of time thinking about it. But the weird thing there is Theoretically, ex sushi was a redeem one to one. But the way it calculated how much you could redeem. Allowed you to redeem more. And the liquidity in the Lp pool for liquid it looks very different if you kind of cause this wrong side redemption. So the reason I bring this up is there is a sense in which capital inefficiency doesn't incentivize people to Lp, which can be bad when there's actually a bunch of defaults. Whereas capital efficiency actually will have a ton of liquidation, but then that the Lps who are lp in those pools are making money, so then there's enough liquidity. So this is why I'm saying these complex systems. You have to... What, you know, how do how do you how do we simulate things is you take the pieces you understand really well. You and like, you really, really, really, really have accurate models for each individual lego. And then you... You simulate interactions between two legos and you spend a lot of time really, really testing the interactions, and then you slowly build up more and more interactions. You don't just go, like, hey, here's the whole system. I'm gonna simulate the world all at once. And I think that's some of the things that sometimes people don't understand about doing sort of agent based simulation and and and fine fine grained simulation, which is done in a ton of engineering fields. It's done in finance. It's done in basically every type of engineering field petroleum engineering, like, building cars, like, every everyone does simulation of some form. Right? And so one thing that's very hard to understand is people often like, this is so complicated. There's so many pieces there's some many users, like, how do you keep track of with everything. The beauty of blockchain chains versus anything I ever dealt with in traditional finance is that the data is all there. There's no data that's missing thing. There's no, like, infer things about other people in the way the option works. And arguably thing something like F happens because they had to they stayed off chain. Right? They stayed away from this thing that, like, really guarantees that you know what's happening. And and because of that, you can do better simulations, but you have to simulate each component really carefully and slowly build up. System not just try to, like, simulate the whole world all once because it's actually very hard then to know what assumptions you're making at each step. And so the you know, I don't think I would have thought about Era without actually trying to to run these experiments and and and really see see what how under different assumptions of these things. And this is why I build able it bring up this capital efficiency point. It if I looked at the Defect protocol, it alone if I look at a lending protocol on its own in isolation. Capital efficiency seem fine. But if I look at its effect on another protocol like, the Lps is in the Uni soft pool. Cap it it actually can be bad. And so that... That's sort of. I I sort of went through the the long description of that ten make make it clear of, like, why you need to be very careful about how you put put together these pieces and reason about. You know, how they interact and and safety in those scenarios. Yeah. No. That actually, that that makes a lot of sense. And ",
            "start": 2684.312,
            "end": 2890.4985
        },
        {
            "speaker": "0",
            "podcast": "I before we, before we have to sign off because we are kinda running up on time. I also wanna talk about just more... You've touched on this a little bit already, but you know, how in defy, and you're probably exhausted about talking about F t as much as I am, getting calls from all of your traditional finance friends and just trying to explain everything. But how Defy are some of the problems that F had like mitigated or it couldn't have gone or or it could have gone in a much different way, especially like using era because, like, in my opinion, and a lot of other people who are very involved in D defy and that are crypto native, like, this is D files tied to shine. Right? And a lot of people are not seeing it that way because they don't understand ",
            "start": 2891.2886,
            "end": 2939.2441
        },
        {
            "speaker": "1",
            "podcast": "quite yet. I mean, there's there's there's a couple of con confounded variables that I've always found funny, which is like people always like to point to Luna as being defy and like, it does have some some sem of, like, d defy, but it doesn't have the sem of, like, taking advantage it, like, being very careful about the excess assumptions that are being made in the decentralized world. Like, ",
            "start": 2939.7012,
            "end": 2964.2898
        },
        {
            "speaker": "0",
            "podcast": "you can't really prevent borrowers from from, you know, continuing to borrow on outside of how well aggressively you set the parameters for liquid. Them. Right. And it's like, in Luna case two, it's like... It is an algorithm table coin technically d defy. I mean, I guess, but it's just a poorly written code, ",
            "start": 2965.0083,
            "end": 2984.2085
        },
        {
            "speaker": "1",
            "podcast": "defy a sense. In my my opinion. And the idea of, like having an infinite qualification, like yes borrow one. Like, this is why the risk parameters and all these protocols are extremely important to as set correctly, and b constantly monitor and update. Like right before Luna blew up, there were a bunch of governance proposals for just, like, lowering the interest rate and anchor by, like, ten percent or fifteen percent and like, no one wanted to do it. And and and this this just tells you it's, like, you need a community that also values risk management in in when when you're dealing with these these systems. In a way such that they don't make mechanisms that, you know, don't even have levers for people to to to fix. Right? But I think, you know, if we get back to the the benefits of Defy, the two things that everyone on Twitter, for instance, is talking about is proof of reserves. Proof of reserves is not that interesting. Because if you think about F, they're they're net their liabilities were the thing that was minus nine billion. Their reserves were still a billion. And like, yes, users could be like, oh, I have more than x there. But like, unless there was a single deposit with more than a billion dollars, they would maybe not be so convinced. Right? If like, it's like the largest creditor, let's say, which is, like, at least the one large, I know. There's, like, genesis at, like, one seventy five million. If you had one seventy five million dollars on exchange, and you saw a reserve and you had a proof for it that it was a billion. You're probably like, seems a little tight, but like, it's not so crazy. I don't know who else is there. Maybe they are left. Like like like like, it's not so it's not so obvious at all. Whereas, like, the liabilities were the real problem. Right? Like, where's is the minus nine billion? Like, that's coming from these loans and, like, you need you need something more like a Z k but the problem Z K piece is you have just like, you have to trust the inputs that to the Z k. Right? And so being on chain, you trust the inputs input. So you can do things like their knowledge proofs. You can do things like inspecting the entire set of creation and destruction of liabilities and assets. And it's done in a way that you... No single entity can manipulate it. In terms of era, I think the main thing, right? And this gets back to what we talked about. And and I know this is often oftentimes, like, maybe like Nuance mean not super interesting thing to think about if you're not like a finance nerd. But this notion of an asset liability mismatch exactly what F had. Right? At some point, they had more assets and liabilities. There there's no way they did that didn't happen at some point. Like, they couldn't have always had more liabilities. So if we go back in time and try to trace when did the assets and liabilities diver, And, like, could they have done something to to to to reduce that divergence? Probably, mean, obviously, you know, there's tons of tweets from Alameda saying they they stopped hedging in twenty twenty one, so maybe not. But The point is that people can keep them honest. That, hey, your asset liability gap is growing, like you should do x, you should do y. You need to do add more safeguards here. And I think that type of stuff is done best by people who have skin in the game. In keeping that type of system stable. And not just skin in the game of, like, I'm gonna just keep borrowing from this thing and no one can see me doing it. Yeah. Right. You shouldn't use ",
            "start": 2984.8435,
            "end": 3199.5679
        },
        {
            "speaker": "0",
            "podcast": "current liabilities to buy long term assets or buy versa long term... Yeah. You shouldn't you shouldn't use short term liabilities ",
            "start": 3200.503,
            "end": 3209.2405
        },
        {
            "speaker": "1",
            "podcast": "or long term liability by short term assets, etcetera, etcetera. Yeah. All of that type of stuff can be tracked by everyone who's participating in the protocol whose funds are in it in Defy. That's absolutely not true in that space. In fact, Arguably, this is just I'm not lawyers on my, like, ",
            "start": 3209.6995,
            "end": 3227.2915
        },
        {
            "speaker": "0",
            "podcast": "opinion. But like there's no financial advice, not Legal advice, not life advice. ",
            "start": 3228.3303,
            "end": 3232.406
        },
        {
            "speaker": "1",
            "podcast": "But arguably, Luna is not actually like a criminal. I'm not saying that art. I mean, personally I have an opinion, but I'm not gonna say my opinion. But but, like, Luna could be viewed as a non criminal act. Or like the collapse in some. I mean, there there might have been stuff like, off chain that was. But because everything you could see and you could argue that all of the users explicitly, we're agreeing to the terms of service of the node, like the nodes code, how it process things, the risk that was there. And look, the assets and liabilities were public. That's why everyone could see it and like, that happened. F acts on the other hand is much closer to fraud. Right? Like, it is actually like... That was not... You didn't agree to do that. Right? You didn't agree to lend out your money. Like, the terms of service you and say that. So it's quite... It's... One is much more like and the accounting, like, they had to tell the auditor something different. Right? Like, clearly, there was, like fraud there whereas in in the t in case, there's, like, obviously calamity. But there was actually technically, like, you could see what happened. And so even even even just j those, like the... You have to you have to just see that, like, the transparency aspect is is really something that we've never really had in finance. And I ended... I know it's gonna be hard to use. It's gonna take forever for the Ux to get easy for the average person use. But ",
            "start": 3233.4585,
            "end": 3325.8035
        },
        {
            "speaker": "0",
            "podcast": "you know, long term, this is this is the way of of actually being able to have, like a responsible system. Yeah. And how on on your point like, I I think you and I might be on the same there, But how interesting would it be, if Dough did go to prison for a... What I would consider a failed project and S spf there doesn't go to present for what is what I feel like is just fraud. ",
            "start": 3326.1157,
            "end": 3349.9883
        },
        {
            "speaker": "1",
            "podcast": "I mean, it it's just it would be very interesting to see, like that double standard I think. Yeah. All I have to say with that is the the court system has had. Historical double standards. So I that's that's very true. That's very true. I do think However, this is, like, it it it does feel like En ron where I remember, like, in in the En run case, like the the the executives were, like friends with the president Bush at that time. But then like, because they on trouble and were known to be friends with him, the, like, law actually went a little bit harder than it would could have. Because, like, everyone was a little too embarrassed. So, like, I kind of feel like that might be... There might be a little bit of that reaction here. ",
            "start": 3350.787,
            "end": 3391.323
        },
        {
            "speaker": "0",
            "podcast": "Well time will tell, we we will see. But before we sign off because we are pretty much up on time. Is there anything that you wanted to... On really relay, I we kinda got off topic there a little bit. But related to era or gauntlet that maybe we haven't had time to address. Yeah. I mean, I I think the the main thing is like, ",
            "start": 3392.1326,
            "end": 3409.1538
        },
        {
            "speaker": "1",
            "podcast": "dis decentralized lending decent decentralized treasury management are are the key things defy that you know, every protocol effectively somehow will need or need to do in a world where we have Internet institutions being da. And I think if you look at what happened, Alameda that paid back all the G f protocols first. Because they knew their get liquidate. At right second. And of itself should be the ultimate truth for why this stuff is wake really good. Like, even the worst actor ",
            "start": 3410.4402,
            "end": 3441.2822
        },
        {
            "speaker": "0",
            "podcast": "still has to pay back smart contract. Right? Yeah. And it's like, in that case, it's kinda interesting because those decentralized lending and borrowing protocols are the most senior lender ",
            "start": 3441.7551,
            "end": 3450.9573
        },
        {
            "speaker": "1",
            "podcast": "in the entire capital stack in that sense? Right. Because they put the customers first, like they put their customers first above the equity holders and, you know, maybe debt holders ",
            "start": 3451.4297,
            "end": 3460.7856
        },
        {
            "speaker": "0",
            "podcast": "Yeah. That makes sense. Walter, it has been a real pleasure having you on. Thanks for talking Era and everything to decentralized finance with us here on the Poly alpha podcast. For those of you watching on Poly gon Tv on Youtube. Thank you for watching for those of you listening on Spotify and apple. Thank you for listening. We will catch you all next time. Thanks everyone. For and thanks again, to. ",
            "start": 3461.3044,
            "end": 3484.0
        },
        {
            "speaker": "1",
            "podcast": "And ",
            "start": 3490.421,
            "end": 3490.4707
        }
    ],
    "summaries": [
        {
            "title": "1. Understanding the Impact of Recent Events on Public Perception of Gauntlet and Era Protocol, and the Risks of DeFi and FTX",
            "summary": "In this episode of the Poly Alpha podcast, Justin Havens interviews Tu Chi, the CEO of Gauntlet and founder of Era Protocol, about decentralized finance and the crypto industry. They discuss the importance of understanding the risks involved in the crypto space and the need for clarity in distinguishing between centralized and decentralized entities. They also highlight the role of risk analysis and monitoring in the crypto space, as well as the development of a decentralized treasury management protocol for DAOs. The text explains the concept of the safety module in DeFi and the customer-first approach of decentralized finance. It also discusses risk-aware treasury management and the similarities between risk management in DeFi and reins insurance in traditional insurance companies."
        },
        {
            "title": "2. Optimizing Treasury Management for DAOs: Exploring the Relationship Between Revenue, Protocol, and Treasury in the Dow",
            "summary": "This text explores the challenges of achieving capital efficiency in decentralized autonomous organizations (DAOs) within the cryptocurrency space. It emphasizes the need to optimize assets and minimize liquidity provision to maintain high capital efficiency. The text also discusses the concept of on-chain treasury management and the benefits of eliminating off-chain entities. The author expresses skepticism towards current DAO laws and highlights the importance of synchronization between off-chain and on-chain components. The text also discusses the alignment and incentive structures created by tokens in DAOs. It further explores the concept of an on-chain reputation system for portfolio submissions and the importance of preventing collusion."
        },
        {
            "title": "3. The Benefits and Safety of DeFi Protocols: Understanding DeFi Tokens, the Safety Module, and the Differences from Traditional Finance",
            "summary": "This text discusses the relationship between capital efficiency and risk in decentralized finance (DeFi). It highlights the importance of capital buffers and risk management in DeFi protocols and the need for a better capital buffer to increase risk-taking capabilities and improve capital efficiency. The text also emphasizes the significance of liquidity and the potential negative impact of capital inefficiency on liquidity providers. It discusses the challenges faced by traditional finance professionals in understanding and explaining DeFi and the need for caution and thorough analysis when building and evaluating complex blockchain systems. The text also emphasizes the significance of risk management, proper risk parameters, and community involvement in maintaining stability and security in DeFi systems."
        },
        {
            "title": "4. The Importance of Risk-Aware Treasury Management in DeFi: Mitigating Risk, Improving Capital Efficiency, and Simulating Complex Systems in Blockchain",
            "summary": "This text discusses various topics related to finance, law, and climate change. It emphasizes the importance of using long-term liabilities for purchasing long-term assets and the need for improved tracking mechanisms in the Defy protocol. It also highlights the significance of transparency in finance and the potential influence of personal relationships on the court system's decisions. The text discusses the importance of decentralized lending and treasury management in Internet institutions and the role of decentralized lending and borrowing protocols. It concludes by addressing the disruptions to global food production caused by climate change and the need for urgent action to ensure food security."
        }
    ]
}