{"podcast": {"title": "Polygon Alpha Podcast", "host": "Justin Havens", "image": ""}, "episode": {"title": "Bringing Privacy to DeFi | Railgun Protocol | Alan Scott", "number": "8", "date": "JUL 27, 2022", "description": "", "url": "https://www.youtube.com/watch?v=15xrqqAnGMY", "speakers": {"0": "Justin Havens", "1": "Alan Scott"}, "file": "july27.mp3"}, "transcripts": [{"speaker": "0", "podcast": "Hello everyone. Welcome to the Poly gon Alpha Podcast, where the Gon community gathers insights from today's leaders in decentralized finance in Crypto. I'm your host, Justin Havens, a aka Crypto. Let's get started. ", "start": 0, "end": 12.086199}, {"speaker": "1", "podcast": "On today's episode of Poly Alpha, we are joined by Alan Scott, who's the c founder and Jan of Rail gun protocol. Alan, thanks for being here with us today. How's everything going? Oh, man, Everything is great. I'm out in Paris currently for Hcc. ", "start": 20.210001, "end": 34.925507}, {"speaker": "2", "podcast": "And yeah, I'm happy to be on. Thanks for having me. Yeah. I'm happy to have you. ", "start": 35.655163, "end": 38.904633}, {"speaker": "1", "podcast": "How was the vibe out there at Eat hcc right now? ", "start": 39.77644, "end": 42.233353}, {"speaker": "2", "podcast": "You know, so far so good, man. I think this is like the the first conference that I've been to where, like, like, the vibe is pretty decent this year, You know? Like, a lot of people have had the bear market blues, but that's just not in the case here. So things are things are pretty good, man. Yeah. And you and I met at in Austin for consensus. Did you feel like there were bear market blues, vibes around that conference or were thoughts about that one as well? ", "start": 42.96296, "end": 66.498085}, {"speaker": "1", "podcast": "It's my home state. So... ", "start": 67.23, "end": 68.43001}, {"speaker": "2", "podcast": "Yeah. First of all, factual. Everything is bigger in Texas, including the conferences. Consensus was massive. Right? And yeah. I really enjoyed it. I guess, you know, you don't really feel like the bear market like blues at conference but we did have, like, that little move down, like, during during the conference You know what it means? I feel like this is like one of the first conferences where I've been at the conference and I look at the charts and they're going up, you know, So I don't wanna jinx anything. So we'll we'll we'll leave it at that. Yeah. But, yeah, generally speaking, the people are always positive but you know, in this particular circumstance, the the chart you're looking good too. So that's a good thing. Yeah. It is a great thing. Absolutely. And, you know, that Hcc, the one that you're at in paris right now. That is like probably the most prominent conference in ", "start": 69.07001, "end": 112.515}, {"speaker": "1", "podcast": "the ethereum space. At least, definitely like the biggest conference in Europe that I can think of. So pretty exciting that you're there A little jealous actually. But... So when I was doing my introduction, I... Your title, I had you as c founder and Jan. Can you explain a little bit of your janet real roles at rail gun and what that means? Yeah. Yeah. So ", "start": 112.975006, "end": 134.66824}, {"speaker": "2", "podcast": "I've been very perhaps aptly named. I don't know the the jan of the group I do everything that's primarily based on the, you know, non coding side of things. So we have some really great developers this at this protocol, you know, there's Ky, There's His sham and the... You know, these has a very, very talented been doing development for a very long time And, you know, my role is a little bit more on the... I guess, the soft skills side. And so, like, I guess, I've been called the jan because, like, all I do is just clean stuff up, you know? So, like, if there's a a non development thing. I've I've just been to do her on the protocol. You know. So when It came to, like, you know, structuring partnerships and doing the strategic alliances with the folks like Dc, you know, I was, you know, front running the opportunity there, if you will. So... Yeah, I guess that's... I'm not really sure how I got named the the jan, but I think that's why. And how I kinda like it, you know, I've never been a man for titles. So to have one that's a little silly. It's it's kinda nice actually. Yeah. That is nice. And since you don't have a developer background... ", "start": 135.28462, "end": 203.53545}, {"speaker": "1", "podcast": "I mean, I'm just curious, you know, what is your background? And how did you get into this... ", "start": 204.15424, "end": 207.43066}, {"speaker": "2", "podcast": "Crypto web three d device space. Yeah. Yeah. So my background is more in the... I guess, the traditional finance space. I worked in actually, the the insurance space for for many years before this... For a company called the A Holdings back in the day. But I got ne crypto back in two thousand and seventeen, because I wanted to, like trade my own money, and I had been trading stocks before that. And I was... You know, the strategy that I was doing was based on, you know, was based on, like, you know, access to beta. Right? So just trying to get access to, like, volatility. Basically. Like, so, like, the bigger the move, the better for, like, what I was doing. And so I started out and stocks moved into, like, leverage Etfs and then it, you know, followed up weird path to options on leveraged Etfs and then my friends were telling me, hey, man matt, like your you're doing this the hard way, like, you should just get into crypto. And so I did. And you know, I started out on, like, centralized it. Exchanges moved into the leverage centralized its exchanges and felt like I was a genius like everybody did up until you know, I got wreck pretty hard in the two thousand and eighteen two thousand nineteen market. And then d defy summer was really good for me. I really enjoyed that as a market. And I had always really liked crypto and I always thought was really fascinating. I'd participated in a lot of telegram and discord. And I was, you know, when the team would come in, I was always thinking, like, wow. Like, those guys are so cool and like, they're working on, like, the future of finance, and I had so much respect for all these guys that and I got the opportunity to to take and, you know, join this team as the as the jan and you know, I I, you know I quit my day job and, you know, my parents thought I was crazy and my friends and family were like, you're gonna get work on, like, magical Internet money stuff, and I'm like, No. That's a different project. I'm gonna work on this thing called Rail gun at, you know, fast forward to today. Here we are. Yeah. And ", "start": 208.24478, "end": 330.43204}, {"speaker": "1", "podcast": "with rail gun being a privacy related crypto protocol. Have you always have a had a patient for privacy? ", "start": 330.8234, "end": 339.3462}, {"speaker": "2", "podcast": "Not really. To tell you the truth. It was really kind of like an epiphany for me whenever I was in a lot of groups. You know, I like a lot of people, whenever I originally got into crypto, I con inflated pseudo like pseudo anonymous, with anonymous. Right? And so a lot of people do that. Right? They think that crypto is private. And it's actually quite the opposite. Right? You know, when you're ignorant, you don't know, but, like, you know, the truth of the matter is that, you know, crypto broadly speaking is on public ledger blockchain. So it's it's the exact opposite of private. Right? And I didn't really recognize that until I was in a group with some folks, and it was a private it was a private group for, like, you know, investing. And someone reached out to me and they were like, hey, you know, I saw you were in in such and such. You know, tell me about that, Like, why why why are you in this? You know, position. And I was really freaked out by that. And like, I had like forgotten that, you know, we had exchanged some tokens for whatever reason it was at a time. But anyway, suffice it to say, like, that was, like, my first experience with, like, oh, man. Like, people can, like, track you, you know? And so I became, like, really aware of that just before, like d defy summer, which is why D defy summer was, like so good for me because I started creating, like, a lot of wallets. I have a... Well, I've created. Actually, I guess an accounting nightmare for myself. Right? And so, like, it was because, like, I wanted to have, like privacy in Crypto. I think that's like really natural. Right? You know, it makes a lot of sense because people they appreciate this this for their their finances. Right? The last thing that I'm sure, you know Justin, you wanna tell me is, you know, how much do you have on, you know, in your bank account. Right? This is a completely ob thing. Right? And so Yeah. Like, I wasn't at first, but yeah, I'm am definitely ", "start": 339.83997, "end": 452.5046}, {"speaker": "1", "podcast": "a a staunch privacy advocate now based on that. Yeah. And I've always kinda thought of it as, at least like in the in the earlier days, that it's like, you're kind of giving it away some trade offs. Right? You have the benefit of self custody in your assets, but you're losing it on privacy in the blockchain space. Whereas, you know, in the traditional finance system, where you have a bank. It's like, you have a lot more privacy. Right? Like not everyone can look, like, there's definitely like some employees and maybe some government officials who can look into your bank account and your transactions, but you're giving up the self custody aspect as well, which a lot of people in the space, obviously, appreciate. And now it's kind of like now that we're... I felt like scalability was like number one. Like, that was the first thing that we needed to take care of in this space. And now that we are with all these, you know, layer two's and other scaling solutions, we are starting to achieve the scalability, I feel like privacy is the next step in this process. And so I would I would also like to get into now, like, what what is rail gun? And how is it solving this privacy issue in the blockchain space? ", "start": 452.8835, "end": 517.80493}, {"speaker": "2", "podcast": "Yeah. Yeah. So I'll start out with first, like I will wholeheartedly agree with you. I think, like, if we want to, like, protect, like, the core tenets of of crypto and so much, you know, and I'm talking about, like, censorship resistance and, like, I and this kind of thing. Right? There has to be some sort of element of privacy. Right? Because like, censorship isn't just like someone's ability to take in sensor transactions like, directly, by way of, like, I don't know, like, attacking the network or something like this. But like, someone knowing who you are and, like, blocking your ability and, like, the the the Ir universe. Right? And so like, you know, it's really, really quite important for us to have, like, privacy and, like, they, you know, separate ourselves from our pseudo anonymous addresses. Completely when possible. Right? I think this is gonna be really important in the future going forward. And so, you know, Re gun was kind of, you know, built for this. Right? And so Re is a smart contract system. It's deployed on Ethereum, Bs c and then Poly as well, which is why we're here the day. And the the the way it works is it's it's primarily it acts like an incognito mode for A wallet. And so, like the Sd sdk allows wall provider is to take an integrate this smart contract system to develop in incognito mode for their their wallet. And so, like, the first wallet to do this is it's called railway. And Railway has his incognito mode. And that's... Yeah. That's kind of like the... I guess, the thesis behind, like, this project is that, like, wallet side privacy is, like, the best privacy. Right? It's like the the the most important type of privacy, like, being able to have, like, the ability to keep your your bank balance if you will, anonymous. Because this a kensington to, like, the traditional finance space where like, if you were to go, like, if, you know, Crypto is gonna truly be the the future of finance and you're gonna go and you're gonna swipe your, you know, crypto debit card and it's gonna draft your, you know, whatever staples you're into, maybe it's like F or magical Internet money or Usd dc, and whatever it is. For, like, coffee and a Croissant here in Paris. Right? Which is great. It shouldn't, you know, it should reveal like your bank balance. Right? And that's how it works today. Right? When you swipe your Visa, you you don't reveal, like, how much money you have in the bank and, like, all the other places that you've, you know, swiped your card and all these other things. Right? And so, like, that's kind of what we're after in in in rail god. Right? Is the gift people wallet side privacy and allow them, like self determined ", "start": 518.5395, "end": 673.81525}, {"speaker": "1", "podcast": "right over who gets to see, like, their financial data. That's that's what's really important here. Yeah. And something you touched on there is, you know, like, if I go into a cafe and I buy a croissant and I don't want, you know, that Starbucks, for example, to see my entire history of transactions. I think that the the converse, the other side is also true too. Right? Like, Starbucks doesn't want you to see all of their accounts and maybe how much they're paying their employees. ", "start": 674.2743, "end": 700.26495}, {"speaker": "2", "podcast": "Yeah. Exactly. You know, there's So if we look at... If I think if you look at privacy like that. Right? There's probably... You know, you could think about it, you know, on the individual level. Like, I... It's none of your business, what's in my bank account, and it's none of my business what's in yours. Right? And we sell select, like, who gets access to that. So, like when you apply for maybe a car loan or mortgage or something like this. Like, you get you can, you know, self ad communicate, you know, giving someone access to this. This is this is really important. And you know, very normal for people. We're very used to this in, you know, traditional finance space. But they also, you know, corporations. Right? Yeah. You kinda hit the nail in the head. Like, if they were a public ledger system where I swipe my debit card at Starbucks, like, I'm they're gonna have access to whatever wallet that they're holding that in, which is maybe the the local Starbucks in, you know, Texas you know, I maybe it's an Austin. Right? You swipe it. And you get to see the Austin, Texas Starbucks or something like this and kinda do you know, Na analytics on it and, you know, chase how much they're spending on coffee beans and all of these kind of things. And so, like, from a corporate Espionage, like standpoint, this would be like, a wet dream for someone wanting to do research on, like their competition. You know? Like, take, for example, maybe the Toyota Corporation has a special deal on aluminum. And the last people they want to know about this special deal is Gm. Right? And so like there's no way they're ever gonna take and do a public ledger transaction for, you know, these these precious materials and these, you know, well negotiated contracts. And so, like, it's it's gonna be really tough to, like, maintain competitive advantage for corporation, you know, training aside, like, being able to copy somebody's trade, Like, that's a very obvious thing that you can do in public with lender spaces. But, like, like, being able to, like, steal, like, in a corporate espionage way, like, people trade secrets, like how much they're spending on, like raw materials and this kind of thing makes it a really high barrier for entry for corporate, you know, entities to yeah to to participate in this economy. And then with with governments. Right? You know, they definitely have their own, you know, state level secrets. And so, like, everybody needs privacy, it's just a matter of taking and solving private see in the right way. And that's... Yeah. That's just as important, I think. Yeah. I'd say that's something that we've ", "start": 701.46497, "end": 842.92316}, {"speaker": "1", "podcast": "discovered at Poly as well in our interviews with, you know, retail users, enterprises, nonprofit, government agencies is that all all of these different, I guess, like sectors. They have their own privacy and security preferences, you know? And that's kind of one of the reasons how, like, Poly on nightfall came about is because that's more of like a privacy faced or enterprise based privacy play. But, yeah, that's that's one of those reasons. And so Alan, when I was doing my research on Rail gun, there I you know, having, like, almost no knowledge at the beginning. I first thought of it as like, similar to looping in the sense that I I thought that it was a deck that was using, you know, like Z k sn. Right? And then and I was like, okay, But there's, like, a privacy feature and And so there a lot of misconceptions that I was coming through as I was doing my research on this. But what you have essentially done if it's if this is my understanding is that This is a a smart contract wallet that's privacy focused. Right? So you don't lose that on any comp comp. ", "start": 843.63257, "end": 911.5899}, {"speaker": "2", "podcast": "Correct? Yeah. Exactly. And so, like, the... There was a couple of things that we were... I guess we had established is, like, non negotiable for developing Rail con. And the two most important parts of it were decent centralization and the like, compost comp ability, like, being like, on purely layer one. So, like, not having, like, a layer two or a roll up or like, having, like, additional nodes that needed to be deployed in order for, like, the the contract to work. Like, we wanted it to have, like uncompromising, like, security, and compost comp ability. Because that's that's the kind of privacy that people want. Right? You know. So when we think about, like, you know, privacy layer two's when it comes to like d defy, there's there's there's issues. Right? You know, So for example, if you wanted to take and, you know, provide liquidity to Uni swap v three and then emits E seven twenty one for your position. Right? It's gonna be really hard, like, bridge that that n that represents your position back to that layer two. Right? And so, like, being able to have that, like, true on chain privacy was really the goal. And then in terms of governance, like having the ability to you know, be controlled and governed in a very decentralized way was was really quite important. But, yeah, you're you're exactly right. Like, our goal was to basically make a private wallet that people can do, like arbitrary smart contract functions from. So if you wanted to do a flash love, like something really complex, like, you can do that. If you wanted to take and provide liquidity and, you know, to Uni swap, you can do that. If you wanted to get a loan from Avi, Whatever it may be, you know, you can take in and and participate and defy in in whatever way you see fit and use Re gun for that. And that's kind of the, yeah, the the long term vision of what we're building here. That's a really good point. ", "start": 912.04987, "end": 1019.89825}, {"speaker": "1", "podcast": "So I guess that is the reason why the rail gun team decided to build a smart contract wallet focused on privacy as opposed to building a privacy ", "start": 1020.53467, "end": 1029.8148}, {"speaker": "2", "podcast": "layer two. Or a privacy layer one. Like like Ast tech or Mane narrow or or z cash. And they're really good. Right? Like Ast tech amazing tech. Those these are really bright. Mon narrow, like z cash if like solve, peer to peer, you know, transfer of wealth, like, being able to pay people privately. Like this is you know, it exists and it works. Right? But like, the holy grail that exists right now is, like true, compost privacy that doesn't have any you know, any, like, limitations like being on a... I guess, like... I kinda think of it like this. Like, we... Are striving to, like, bring the the solution to the ecosystem. Right? And so, like, deploying on ethereum, deploying on poly deploying on Bs c and allowing... Like, allowing builders to take and build in, like, these, you know, integrations where they're developing already and, like, being able to use an S sdk without, like, deploying on a new L two or, like, having to, like, integrate bridges and this kind of thing. Like, it was really quite important. You know, for us, you know, as like I guess like, go to market strategy to allow people to integrate rail gun, where they're doing business already. Right? Because it's incredibly difficult to try to convince, you know, let's say a curve to, like, you know, build somewhere else and do another thing. You know, their team's spread than enough. But like, if like, we put a, you know, a privacy solution in place, that's just arbitrary smart contract calls. Now we don't have to ask them to do anything. Like, we can leverage the true permission nature of D defy and Yeah. Just build in spite of them and if you will. Right? You know? And I think that's, like a really unique ", "start": 1030.1936, "end": 1132.7793}, {"speaker": "1", "podcast": "capability of road. And Real so unique like, who would you consider are your closest competitors in the space? ", "start": 1133.2354, "end": 1140.709}, {"speaker": "2", "podcast": "Man, that's a good question. I would probably say... I probably say Ast is definitely a very very good competition. And I hate I can't I can't hate the word competition. Right? Because anybody who's building privacy tech? Best I could tell. Right? Are, like, after the same thing that I am, which is like privacy for people. Like, that's just the number one goal first and foremost. Right? So if it's rail gun, that's great if it's ast ethical to. You know, I'm a bit biased, obviously, you know, given what I do. But I think that... Yeah, ast tech, you know, probably, you know, Tornado cache is, like the industry standard name for, you know, defy privacy, if you will. And, yeah, I'd probably put those as, like, the two most common things that people talk about in terms of, you know, privacy besides relevant to me. Yeah. And tornado cash is pretty gas intensive as well. Is that the same with rail gun? Like, I I think we're do shield transactions? Is that how we're doing it And like, is that process pretty guess intensive? Yeah. Exactly right. So the first step to using Re gong is taking and putting funds into your private balance. Right? And so basically, what you're doing is your depositing funds into a dark pool that are then encrypted to your your private keys effectively. So only you have access to those funds and only you can take and spend those funds, no one else can actually take and spend your funds in the dark pool. So that's like the first step of privacy. So let's say you have a hundred thousand dollars and you wanna p fifty thousand hours of it. You split half of it. Maybe some things you don't care if they're public. Right? So you put fifty thousand die into your private balance from that point, you can take and do, you know, private sins, private swaps, you know, private smart contract calls this kind of thing and do your private, you know, d defy with your private balance to your public d defy with your public balance, these kind of things. Right? And so, like, I think that Yeah. It's... In terms of gas, being on chain you know, for zinc case sn is definitely computationally intensive. So we're talking you know, for a standard transaction on Ethereum. You know, it's seven million to, you know, one point two million gas. You know, so on Poly, it's practically free. You know, it's like seven cents to do a transaction, which is one of the beauties of Poly as an ecosystem. It's really cheap gas. But on, you know, ethereum, you're probably looking know, somewhere in between the forty to a hundred and twenty dollar mark if, you know, gas spikes. So... Yeah. Definitely is cost ", "start": 1142.4688, "end": 1293.6656}, {"speaker": "1", "podcast": "costly to use it on ethereum. Who would you say your target audience? Like who are the users that you're trying to go after? Is it retail or are are you focusing on enterprises at all? ", "start": 1294.5939, "end": 1304.9373}, {"speaker": "2", "podcast": "We're trying to build it with, like, anybody who wants to have, like privacy from the wall side. Like, that's really the end goal. Right? Like the the long term play, I envision is that we will be able to take and integrate with wallets like brave, we'll be able to integrate with wallets, like meta mask. And, like, I believe that in, like, eighteen to twenty four months, you know, that it'll be like, having a web browser that doesn't have an incognito mode. Like, it'll just be ridiculous be a wallet provider and not have an incognito mode. And have this capability with your, you know, with your wealth. So, like, the S sdk, you know, and the people that we're trying to target in terms of builders it's definitely the the wallet the wallet providers. Because I think that this is like, a really powerful use case for them. But in terms of like, the end user, I think that we're really kind of focused on the the most track players in D defy. You know, so that is, like Whales that's funds. You know, anybody who has, like, their alpha being stolen on a day to day basis in the crypto market. That's like the the first people that were after because those are the people that need the privacy the most right now are all these people being watched and, like, having their liquidation docs, you know, They're like, oh, man, You know, Justin's liquidation point on eth is twelve hundred dollars. Let's see if we could push it down to twelve hundred bucks, so he has to sell or you know, you know, manage his margin or something like this. So like, being able to, like, provide these people with, like, a privacy solution that allows them to take in you know, do defy in a private way where they don't have to deal with that like external is is really, really important and that's kind of like the the short term focus. Yeah. That makes sense. And let's talk about the Sdk. ", "start": 1305.9082, "end": 1410.5718}, {"speaker": "1", "podcast": "What is the rail done Sdk, and what are some potential use cases ", "start": 1411.9254, "end": 1416.5778}, {"speaker": "2", "podcast": "that you foresee or that you would like to see personally? Oh bad. So the the ro band S sdk effectively has three parts. Right? Is the wallet side Likes to being able to build that incognito mode as a wall provider. I think that'd would be really huge. Right. I would love to see, you know, meta mask brave wallet, these kind of people being able to take and build out a incognito infrastructure that allows people to take and transact in a private fashion. Right? And I I'll also, you know, say that it'd would be really cool if we could get people like copper and fire blocks and have a no safe app and all these different ways that people are interacting you know, with their balance provide like this this incognito mode through the Rogue Sdk. The next part of the S sdk is arbitrary smart contract calls. So this will be for, like, the Mega nerds who wanna take and do a a flash loan or something like this. So being able to take and do, like, arbitrary smart contract calls, against the private balance this Sd sdk will allow you to do that. And then the third part of it is the the Rail gun connect. So being able from the front end of a different da, take and, you know, connect your re gun balance. You know, so go to Uni swap, you know, connect instead of your Meta mask, connect your row gun balance and do d defy privately natively know, on the apps that you're already using. So that's kind of like the, yeah, the trifecta of the of the Sdk. But like, for me, the, like, the coolest part, I think is definitely the wall provider side. But in terms of, like, really cool functionalities. The thing that I'm most excited about is an integration with the Rent protocol. And so I'm sure you're you're familiar, but being able to take in ren assets directly into a private balance is gonna be huge. And that's that's the thing I'm most excited about. And the reason why is like, it's gonna be really cool to not, like, you know, tie my bitcoin address to my ethereum address. Right? Or, like, being able to ren into Ethereum, like, or something like this. And then, you know, being able to deal with, like, the Ren vm a private way. You know? So, like, you know, tapping into some of the things that are being deployed there, like catalog, and like those cross chain swap functionalities is gonna be really big because that'll... I think that'll a kind of replace a lot of reasons why people are using centralized exchanges. Like, if you could take your Usd, that's on Ethereum and privately swap it for bitcoin, you know, on the Bitcoin network, Like, this would be really, really huge. And that's that's one of the iterations that I wanna see the most. So yeah. That was why, I guess we announced that partnership so early because we're really excited to you know, work on that with Brent. Like, we announced that partnership a year ago. And, you know, we're just now starting to break ground on, like, finalizing those you know, integration. So pretty excited about that. ", "start": 1417.43, "end": 1587.3118}, {"speaker": "1", "podcast": "Yeah I'm a big fan at the Rin protocol, and I think I do remember that partnership announcement. But what you're saying is that, I guess the Rail gun S sdk could potentially be leveraged to be or... ", "start": 1589.3092, "end": 1602.1101}, {"speaker": "2", "podcast": "So that privacy is is the default for Rin. Is that what you're saying? Like, there's the potential for that? Yeah. Exactly right. So being able to take in remnant assets in a private and anonymous way. Right? So you could take and connect your rail gun balance to the the... You know, the Rin system take and ren Btc. So let's see, You wanna take a red ten Btc. You can do that directly into a, into a private balance on Ethereum. And then, you know, anonymously taken and provide that that Btc to something like badge or something like in order to take and get yield on it. So being able to get like anonymous yield on your bitcoin, I think is gonna be really cool. Well, yeah. And Alan, what would you say people who say ", "start": 1603.0609, "end": 1645.7384}, {"speaker": "1", "podcast": "things along the lines of, you know, only criminals want privacy or I don't need privacy because I've got nothing to hide. ", "start": 1646.9291, "end": 1654.5204}, {"speaker": "2", "podcast": "I think that that's a very interesting... I think it's like a... It's like a really good straw man. Right? But I don't think it's really good. Right? I don't think it's unreasonable to assume that, like, you know, hackers or something like this could use, you know, rail gun. Right? But I don't believe that, like, the propensity or like, The potential for, like, the presence of bad actors to be like like a indication for, like, people's, like, right to have privacy. Right? This would be, like, saying, well, you know, I don't really care about free speech because I don't have anything important to say. Right? And I think that that's that's a bit of a, like a cop out as, like an argument if I'm I'm being honest. Right? And I think that, like... Which you start to, like, really dive into with people who make those like statements, you know, they can kinda see, like, that there is a need for privacy. Right? It's really quite important. Especially when it comes to like, their financial data. Like, people immediately get kind of like, you know, squirrel whenever you wanna, like, hear about, like, how much money they have in the bank or something like this. Right? Because it's it's it's somebody's business. Right? You know, like so if I were to ask you, you know, mister Crypto tech, like, how much money is in your bank account, would you be inclined to tell me? No. I would not. Yeah. Exactly. Right? Not of my business. Right? It's suddenly people believe in, like, you know, financial privacy. And we have it in in traditional finance. Right? It's called cash. Right? And so I could take and walk into a store and buy a soda with, well, I guess, euros at this exact moment because I'm many Paris. But I could take... Go and buy some soda, and do it in an anonymous way and the guy at the the seven eleven or whatever I think And Pm is the cool thing here. I'm not too sure, but sure people in France will correct me at some point. But suffice it to say I can take and do an anonymous transaction in, you know, in traditional finance. And I think that the same things would be really important for, like, the future of of crypto. Right? I believe that, like, if you have like, this really heavy transparent system, like it creates like an ability for, like, powerful people to create different forms of censorship. And like, we we need to have privacy in crypto for, like, the long term vision of Crypto to really work out. So, yeah, do I think that people will will be ben actors in in crypto? Sure. Right? But I also believe that there's bad actors with with Fiat. Right? And I think that if we set it up with, like, the capabilities for good actors, to be able to, like prove that the are good actors and demonstrate that they bar actors you know, will be able to have privacy. And this is like the same for, like, cash reporting standards. So if you're, you know, really savvy and knows some things about... Obviously excuse me fiat regulation in the Us, you you'll know that there's a a form called the the a three hundred form. It's a form eighty three hundred from the Irs Like, it's a cash reporting form where if you as a business taken receive ten thousand dollars in cash or a suspicious suspicious transaction of cash. Right? You taken you thought this form and you submit it to the Irs, basically, and they, you know, they do with that what they will, Whether it's, you know, they investigate let's say, you know, Justin you go, and you buy a car with cash and it's twenty thousand dollars. Right? You they'll fill this format and, you know, the Irs may contact you as an individual to say, hey, you need to prove that your cash is from a a good place. Right? And you'll go, oh, you know, well, I have this cash for all these legitimate reasons and the Irs goes. Cool. You're a good guy of further questions. Right? And so the same thing will happen in in Crypto. Right? We'll be able to take and, you know, in a privacy first kind of system, you know, prove that we aren't bad actors in other words, like self k and reveal to people, you know, how we transact. And I so I think that, like... Yeah. I think it's just like a straw man when people say, like, oh, we're privacy is only for actors. But and I think it's that they don't understand, like, the the stakes. Or, like, how, ", "start": 1655.1743, "end": 1899.038}, {"speaker": "1", "podcast": "you know, how privacy works for for Crypto. Yeah. That makes sense. I think he touched on, like, a couple interesting things there And, like a very interesting thought experiment I think is to think of, like cash as, you know, cash is very private. Right? No one's looking in on all of your cash transaction, if you're using just cold hard Us dollars or euros. And also that's cash is self custody as well. But I guess what we're missing out on here is really just like the comp of cash. ", "start": 1900.925, "end": 1928.6318}, {"speaker": "2", "podcast": "You know, when you're using that and also the utility that it has would compared to digital assets. Yeah. Exactly. It's very hard to pay cash for some thing on Alibaba. You know what You mean? Like, if you wanna, like order some hats or something from for Alibaba, you, like, I don't know you would do, maybe, like, ship them in envelope of cash. And hope it, you know, they said you stuff back. See say, yeah. Right. I could send you some Ether or somatic like right now, and you would get it in ten seconds. Essentially. Yeah. I'll d my address letter and you can. ", "start": 1929.2845, "end": 1956.0121}, {"speaker": "1", "podcast": "Okay. Great. So, Alan, what are some of the drawbacks though? Like, maybe like, what are some, like, unforeseen issues or drawbacks that y'all all have noticed with the rail gun protocol if there are any and, like, ", "start": 1956.7302, "end": 1968.726}, {"speaker": "2", "podcast": "deal plan on addressing any of those? Yes. I think it's I think it's fair. Right? So let's think. Right. If you think about, like, some of the things that you could you could take issue with. Right? Is you'll currently You know, there's a railway, you know, there they're a separate, you know, entity, they're they're Building a wallet and, you know, they integrated the Ro on S sdk. And, you know, that's the only place that you could take and use Re god very reasonably right now. Right? And so we're working really really diligently to take and make the the repo very easy for people to to deal with. You know, so, like, over the last, I guess, call it, year and a half of of building, you know, we've... I guess, as a team, I'm not, I should say. Our developers the core contributors of the project are really familiar with the repo and that doesn't really translate to, like, external folks. So, like, being able to take and You know, so being able to take and, like, make the Sdk easier for people to use is something that we're focusing on, so we can like expand those efforts out and like, get other wallet providers on the word. I think that that's that's that's a bit of a drawback. As it sits right now, there isn't any hardware support for private transactions. And this is a case for, like, Z cash as well. So there's a signature scheme called Ed over baby job job and which is a very adorable name for an elliptical care baby jump up. But suffice it to say, like, you don't have the ability to have, like a hardware wallet for your your private transactions. And so we've, you know, kind of taken up building a ledger app that will allow you, you know, with a ledger nano x, like sign your private transactions with a hardware wallet. So, you know, we're just you know, we're working on it ourselves and, you know, we're coordinating, you know, with some other folks out there in the ecosystem to try to build this. And so, you know, please anyone on the, you know, the in the world of crypto Twitter, feel free to, like, at the folks over at ledger to ask them for, you know, the ability to sign your private transactions. Right? Because it's not just for Re. It's for a whole myriad of, like C k tech. And then I think that, you know, gas are on Poly gon, not so bad. Right? It's it's practically free to use Poly gun, which is really awesome. But on Ethereum, you know, gas is, you know, it's pretty expensive. And, you know, working towards, like, driving those down is gonna be really important. And so like, in the short term, we're gonna take and we're developing some new crypto photography circuits and these circuits will allow us to deal with more complex balances and more complex transactions in a more well, efficient way? So more efficiency in the computation. It means lower gas costs. You. So we should be able to take and drive down gas cost more. You know, currently, I think we have the most efficient I don't know a Z k tech on Ethereum. That's directly on chain. Just comparing the attorney to cash. It's cheaper to execute a Rail transaction, than the Tornado cash. But we'll continue to drive that down. And then in the long term, we'll take and look to develop the the system using recur Z k sn. And so, like, this will taken drive down gas cost even further So being able to take prove multiple statements so not only like the validity of a transaction, but like the update... Excuse me the update of the the Ut and Merkel Tree. All in like one Smart proof will be really, really cool. And it'll definitely lower the gas cost by landslide. So that long term you know, we have that. But that's, you know, however, you know, that could be even a year who knows maybe longer. You know, we need the pre compile and things like that for recur some sn in order to take and do that. But those are probably the three things. So, like, currently, you know, there's there's not a lot of integrations, you know, so that'll be carried over time. I think that, you know, gas costs are, you know, being driven down. And then, you know, what I'm most looking forward to is hardware support because I think that'll be a huge win for Z k tech, ", "start": 1969.8599, "end": 2221.4087}, {"speaker": "1", "podcast": "just like broadly not just for rail down. Yeah. That's really interesting. You touched on like, some very interesting things there and some things that I wasn't necessarily aware of either. So is it... I didn't realize that the Edd, I guess, that signature auth authentication was not compatible with ledger wallets. Is is that for all of them? Or is that specific to smart ", "start": 2222.4443, "end": 2243.1228}, {"speaker": "2", "podcast": "contracts? You know. That's a really good question. I don't wanna like, speak out of turn, but that is my understanding of the way it works. Right? Is that, like there isn't no, like, compatibility for this signature scheme. And so a bit ironic giving that the guys who are pretty high up in the ledger world we're just talking about the importance of Z k tech yet. They have very little support for it you know, currently. And so we're kinda hoping that we can take and, you know, basically build it for them and say, hey here you go. But, yeah, yeah. To my knowledge, it doesn't really exist at this exact moment, the ability to take it sign a shielded transaction through Re gun or like c cash. I think is absolutely insane because see cash has been around for freaking ages. It's been around for a very long. It's been... You know, it's been around for a super long time in terms of crypto. Right? You'll need to team up with Z over there. At z cash and get the ball rolling on this, I think. Yeah. I think they have they have some folks that are working on it on their side. To. You know, So there's definitely some some github repo that exist in the world that are working on it already and Yeah. We're gonna, you know, try to see if we can leverage some of that you know, such as the way of open source, but then also take an add on to it, you know, And that's kind of, like the beauty of open source too. Is that, like, anybody can help and, like, you know, work with each other. So, you know, we're hoping that we can contribute to that and kind of, you know, get that get that across the finish line because I think it's gonna be really, really important going forward. ", "start": 2243.6616, "end": 2333.582}, {"speaker": "1", "podcast": "Yeah. I love that y'all know, you weren't only just focusing on, you know, the centralization, privacy and comp, which is very important, But you're also focusing on, you know, this Sdk for Wall developers, which I think is like, it it's very unique. And I I think that's that's really interesting. And I'm I'm very excited to see how this plays out for y'all in the future in the coming months because it's a bear market. It's time to build. Right? So now now's it's the time to do it if you're going to do it. Yeah. It's definitely a build to market, you know. And so, like, being able to build ", "start": 2335.2524, "end": 2364.9473}, {"speaker": "2", "podcast": "these kind of things for other people to take in leverage to... Produce, like, really unique value propositions is gonna be really cool. Right? And so like, I can just imagine, like, you know, maybe, like Meta mask institutional, for example, would be able to take and go to their institutional clients and say that they have an incognito mode. That will help them protect their alpha, right? In their trade secrets in this kind of thing. Like, this is gonna be really, really cool. Like, there's a a whole new market that can be opened up by I guess what's currently being called P. Right? And so, like, I think that I see, you know, real gun being a really big part of this. If, you know, the Earth moon sun and stars all the live for us, which, you know, so far so good, things are, you know, going really well. Few ones out, the contracts work. You know, we're getting the very intensely audited on a pretty regular basis and getting good feedback from, you know, the folks that are auditing. So Yeah. I think with, you know, with an enough bear market determination, you know, we could take and come out the other side with some really key partnerships in the ecosystem that will, you know, bring, ", "start": 2366.1138, "end": 2435.2078}, {"speaker": "1", "podcast": "you know, privacy to fruition for for quality fire. Yeah, That's that's really interesting. So I kinda wanna take a a different turn here and talk specifically about, I guess, like the economics of the protocol now, you know, like, what are some of the revenue drivers to rail gun? You know, how does the protocol make money? ", "start": 2435.9048, "end": 2456.0059}, {"speaker": "2", "podcast": "Yeah. Yes. So the the protocol has a a twenty five basis point. So that's zero point two five percent of the transaction that goes to the Re garden treasury. And I think what's really unique about the way that mechanism is designed, is that it is actually paid to the treasury in that transact asset. So if you take a new transact, matt in the treasury. If you're taking you transact die or Ren btc or Usd, whatever it may be, you take and that is paid into the the treasury. And so if we look at it now, you know, there's a whole, like, even now, like as early as we are, you know, there... There's a myriad of tokens in there. And this would be really important for, like, treasury durability. Right? I guess is what I'll call it. Right? And so, like, I don't know how close you follow the crypto Twitter world, but there was, like, this post that showed, like, a lot of a lot of treasuries have been wrecked. Right? Or they at least look like they've been wrecked. But, like, I think that was probably a bit of a mis of, like, what cash on hand if you will, means. Right? It doesn't mean that you know, you have, like, your protocol token in your treasury, therefore, you're you're rich because well, you've just added directional risk to your particular token. You know. So, like, you know, pick on Uni swap a little bit, like they... You know, their treasury you know, truck really, really hard because it's really exposed to or Uni. Right? And so the the rock on treasury as it sits right now, it's primarily in die, which we'll we'll talk about in just a moment. But, yeah, it'll actually grow over time in, like, myriad assets and that'll allow the protocol, I guess, in terms of the treasury, at least a lot more resilience. Right? And then the the dow also controls the right to take and meant more rail. Now there's a hard cat on how much can be mint. Right? There's a hundred million that can that can ever be mint. And as it sits right now there is... Yeah. There's fifty... Yeah. Fifty... I forgot. A fifty seven point five million that's been mint so far. And the... So that was an additional seven point five million. That was just recently mint back in January. And the reason why we did that was we actually structured up a strategic partnership with with digital currency group. And they've just been an absolutely amazing, you know, ecosystem partner for us, They've given us a lot of resources, which has been really good. You know, so we took and we structured this deal with Dc g and L Capital as a Dow. And so technically, the the Dow I could see, you know, could foresee take in, you know, meant more token to sell to more partners or something like this as well. And so there's a couple of different ways that I guess, we could take and generate... The lifeblood if you will of the ecosystem whether it'd be from taking and the fees from the the protocol itself, you know, applying for grants, you know, again point grants all sorts of different things. Maybe who knows? Maybe we'll win the Z prize one. So... And But more to the point, Right? The actual question here is, like, you know, what's it for people who hold and stick the token. Right? Is that fair? And so... Right. Yeah. Everyone wants to hear. Yeah. Okay. That's all great. What's it for me. Right? And so what are the most you know, talked about proposals that's that's coming along here in the the the world of Re gone Az the, like the the the treasury or the fee distribution proposal that everyone's really looking forward to. And so effectively, what this will do is take and payout the treasury assets to people take staking the token. Right? And so the the dow is, you know, debating that, talking about the mechanisms that can work. And, you know, we'll see a proposal for that. I imagine pretty soon. And I think the the general consensus of everybody who staking and is in our... We call it the dow score. It's a a private discord for people who were taking the token. You know, the the general consensus is that it'll take in pay the natural asset that's in the treasury. So unlike, you know, other, you know, po economics where, you know, it pays out in, you know, more rail or does it burn or a buy back or something like this, it'll actually take and just pay out the the raw assets that are in the treasury. So if there's die in the treasury if there's ren Btc in the treasury, if there's Eth. Right? Mac, it'll take it, it'll pay out those natural assets to people who are staking which I think is... Yeah, which I think is probably the best yield, at least in my degenerate heart. I don't know how you feel about that. Yeah. I think it's interesting. I ", "start": 2456.66, "end": 2742.931}, {"speaker": "1", "podcast": "I do like that strategy. I think that it's very interesting to see how all of these different protocols address that issue. Right? Especially when it comes to, like, locking... Like, do you have to, like steak or lock up your rail in order to vote, Yeah. That's right. Yeah. So there is a... Yeah, staking mechanics participate in governance. ", "start": 2743.3997, "end": 2764.8638}, {"speaker": "2", "podcast": "And the... Yeah when you stake... I should say rather, when you click the un stake button, which is the easier way to say. And you click un stake, there's a thirty day cool off period before you can actually take and claim your tokens. And this is by design. It prevents people from taking and like doing let's say they buy up a bunch of tokens and they create a proposal and it's, you know, bad for the protocol or like it only benefit them or something, it, you know, basically deter them because, well, they're gonna have to live with the consequences of that proposal as well. Right? So this is a bit of a deterrent against people, not taking governance seriously or, you know, trying to, you know, manipulate the system by buying a lots of tokens taking them and then voting for something that's not beneficial from the clinical. And is the treasury private as well? You know? It's not. You can actually see it. Yeah. So there's a contracts on Poly gong, Bs c and then ethereum. And, yeah, you could see those and watch those fees accumulate live. Yeah. So it exists out there in the world for the, you know, viewing pleasures of those who want to take and do the due diligence associated with, you know, buying the second. Because I think that's important. Right? You know? And that's kind of Bit of a tangent here, but I think that, like, some things need to be transparent. Right? I think that something should be transparent. Right? I should say. And that's like like... So for example, like, I believe that you should be able to see code of a smart contract that you're interacting with and, like, verify by looking at it, that like, it's gonna do the things that I expected it to do. Right? So when I take and I sign a transaction to swap, you know, a million Shi for whatever, like, it's gonna... Actually happened the way I expect it and the tokens are gonna go into my wallet, and I'm gonna, you know, not be any poor or rug or hacked or something like this. Right? So there has to be you know, publicly verifiable things in the ecosystem. And I believe that, like, you know, having, like, public treasuries and, like, open forms for discussion and, like, communicating with, like, you know, people in into the community, you know, these things are really important. And, you know, we need transparency on that kind of stuff. And so... Yeah, Like, I believe that... Yeah, one of the things that should be, you know, publicly, you know, verifiable that, like, you know, the dow can actually take and, like, support itself and sustain itself you know, otherwise, like, you know, you can't really know that, like, a protocol is gonna live to the future unless like, you know, it can fund itself to, ", "start": 2765.5002, "end": 2914.9429}, {"speaker": "1", "podcast": "you know, live. Right? That makes sense. And I think outside of governance and the developers, the relay layers are also a pretty essential I guess, puzzle piece in this protocol. Can you kind of explain, like, what the relay layers are, what that means? And how do they help the protocol just to work in general. Yeah. Yeah. So love all these good questions, man. ", "start": 2915.8784, "end": 2938.2307}, {"speaker": "2", "podcast": "And makes week be excited. Give us, like, it seems like you've done your due diligence, which is really cool. So, like, in terms of, like, layers, Right? I guess, let me neck up actually a little bit. And so, like, when you talk about on chain privacy in a public ledger you know, in a public ledger blockchain. Right? You effectively have to think about a couple of things. You have to think about the sender, the recipient, the token type, and how much you're sending. Right? These are the the things that you have to think about. And so everything other than the sender is privatized by the Smart contract. Right? So, like, at least when we're talking about a Rail going to Re gun transaction. In other words, you know, Crypto and you're on Rob gun. I'm on Re gun and I take and I send you a private, you know, a private payment. You know, that's ob stated by the Smart contract there is one thing that's not by a contract and that is the gas payer. Right? Because on a public letter blockchain, some public address has to take and, you know, pay it has to pay. Right? And so what are layers. Right? So a layer They take and they they broadcast over the W P to p network, which you may or minute analysis was developed by the guys who made status dot I. Right? So they taken they broadcast a couple of things over that peer to peer network. They taken they broadcast the tokens that they'll accept for payment as well as, like, the the fee and they'll also broadcast their public key to take and address the the fee to. Right? And the client, the front end, in other words like, the wallet, takes and subscribe subtract to the fee broadcast and whenever you're doing a private transaction, it'll take and estimate the the transaction fee, and you take and you pay that. You effectively, you know, generate a populated unsigned transaction that, you know, has at least two Z k... That's it? One of one of which is, like, the actual transaction and another meat, in other words, like me sending you die, and then one representing the the payment to the lair for signing and paying the gas on your behalf. Now the the layers, it's important to note are not required for, like, access to your private funds. So let's say, let's go like disaster scenario and, like, the relay ecosystem like creators. Right? It just cease this to exist. Your your funds are still safe, You can still access your private balance and, like, withdraw it or do whatever you would like to with it. You'll just have to take in, like, you know, docs the w associated with it. Right? And so, like, you don't have to worry about, like, the layers ever failing or like this. But then, you know, two, you have to think about, like, oh can, the layers like, docs me or identify other metrics about me as a user and like, the answer is no. Right? You know, as long as, you know, all the messages are relayed through, like, the W P to network, like, they can't know a particular message is origin. Right? And so, yeah, they have no way of, like detecting your actual individual Ip address or any other identifiable metrics. Right? But probably the most important thing, not just your privacy is, like, are my fun safe rank and, like, they steal my money. Is this a trust ecosystem. And, you know, again, you know, they cannot. Right? They can't take and steal money from you it's completely trust list transaction. Right? And you know, the long answer there is, you know, layers can't circumvent the the security of the transactions and the the reason why is they don't have access to your private keys that were used to generate the sn groove. So as long as your keys are safe, right? And share those with I don't know some admin on telegram or something like this. Right? There's no way for anybody to to to brute force manipulate stark proof the stark fair fire and the Smart contract will detect that it's an invalid proof and the transaction is reverted, and the layer with b out of pocket for the gas for the effort that, you know, for for them trying to to manipulate it. And so, you know, it's a frequently ass thing, and I think it's really important. Right. I think it's really cool and unique way to take and solve gas pay privacy. It's been really exciting the the the folks over at Lo just like a quick shout out to those days are just super smart. They're really cool dudes. Like, the guys who built that library me. They're they're just absolute giga chance, they they know exactly what they're doing, and it's really cool stuff. So, yeah, if you're trying to take and into, like, private messaging of some sort, like, in a period to pure way, like, ", "start": 2938.8706, "end": 3217.8823}, {"speaker": "1", "podcast": "they're are the dudes. They're the dudes. And it seems like you've done a really good job of developing and fostering these partnerships you know, with the Rin protocol team, with Bc, what other partnerships are out there that have helped y'all become such a great success. ", "start": 3218.7593, "end": 3234.0664}, {"speaker": "2", "podcast": "The most important one has been the the right to privacy foundation, like, they they... Sponsored the development of the the protocol for, you know, it's Quite time. You know, So they take they they took and they paid out a grant to develop the the protocol. Right? And so, yeah, We definitely wouldn't be here without those guys. So definitely the the right privacy foundation of the Uk. They're really great. I would also say the folks over at Foundry, which is a subsidiary company of Dc. They run, like nodes and things like this. They've been really instrumental for us to gain access to, like, test net nodes and things like that. The folks over at zero x, which is what we use for the ability for folks to take a do private swaps. Right? We leverage the, you know, the Zero x Api in order to take in perform private swaps against a private rail gun balance. You know, they were they've been really great at answering questions and like helping us, you know, use their Api, which you know, if you're trying to do, like, swap functions in space like Xerox. Again, they are the way. It's Yeah. It's been really cool to work with those dudes. And then, of course, I don't think we could do without our community members. Like, we have a lot of really dedicated people who are in the community who are really great connectors, facilitator. We have people making, like, you know, marketing materials and designing like really funny memes and this kind of thing. And that's is a really great team. But like, a lot of the people who are really interested in our protocol have have done a lot of work to help set up some, you know, future strategic alliances in the space too. Like, Well, I mean, the reason why I know some folks over at Poly. Right? Is because of some community members in the space. And so, ", "start": 3235.1826, "end": 3343.0457}, {"speaker": "1", "podcast": "yeah. I think that that's probably one of the most important parts of the community. Yeah. Absolutely. I think we we completely agree. You know, I think the meme that everyone's been pushing is like, it's not a bear market. It's a build market, build a dip. But I think that's mainly focused like, on the developer side, but also, like, building out your community is also very important because I think like, you could have the most revolutionary and innovative technology that's ever been created. But if you don't have any users for that technology then that technology is completely worthless. And I think that's for the community and your users come in. Community members, they help with like the the cope as well. Right? So when your bags are down, You have to worry about that. Well, we're kinda getting close run up on time. I've just got a couple more questions for you. And the first one is like, how do you address privacy personally. Like, do you use the brave browser? Do you use any Vpn or are you just sticking to rail gun? I guess my personal favorite browser, ", "start": 3343.6628, "end": 3403.6328}, {"speaker": "2", "podcast": "which is the one that I'm using to be on this... I guess, this recording is brave. I think that's really great. I use a Vpn. At home, I use I just used, like, regular old Express Vpn, probably not the greatest, but, like, it gets the job done at the house. But whenever I'm traveling, you know, I'll use like, a Vpn inside of, like, a an the Vpn kind of stuff. So, like, you know, I don't wanna like, hit anybody over the head with like, you know, the shout out who taught you how to do that. But, like, I'm not clever enough to do this kind of thing on my own. And so, like, I've had some people help me set up, like, some various ways to do, like, really tricky things to make sure that my Internet connection is very secure. And then in terms of, like, privacy for, you know, wallets up until now, I did what everybody else does. Right? Which is, you know, taking put funds into a centralized exchange and then bring them out into a different wallet. You know what I mean? It's like the centralized mixer. You know? Like, no one talks about that. Right? Everyone always talks about cash. But, like, the real true biggest mixer around is is centralized exchanges. It's finance and coinbase based baby. You know, like, I take it and I put funds into, you know, coinbase base, they they disappear and then they come out on the other side of a different wallet. I've done that many times you. But now Don't have to. I don't have to worry about, like, you know, putting my funds at risk you know, with a authority, I just, you know, you can just use re gun for that. ", "start": 3404.5117, "end": 3491.0698}, {"speaker": "1", "podcast": "Yeah. And is there anything else? You know, as as we continue to get closer up on on time. Is are there any other topics that you wanted to address that we haven't really got a chance to touch on necessarily. ", "start": 3492.833, "end": 3503.0173}, {"speaker": "2", "podcast": "No. I would just say, like, if if you're interested in privacy, you know, feel free to look us up on on Telegram on on Twitter, you know, I'm pretty easy to find. And, you know, if you thought that this is appealing to you, I'd say that, you know, give it a go. The folks over at railway a really great wallet. And it has these privacy preserving capabilities already. And I think that the more people that talked about the importance of privacy, you know, the better. I think that, you know, as you know, consumers demand it, you know, it'll come to fruition. And so, like, you know, just get involved and, like, the things that you're passionate about. And if you're passionate about privacy, you know, do research do your due diligence and and and look at the protocol that he says that can provide that to you ", "start": 3503.7341, "end": 3546.1367}, {"speaker": "1", "podcast": "and and give them a go. Absolutely. And Alan, it's been really great. I really appreciate you coming on, talking privacy and talking re gun. And for those of you who are watching on Youtube, Thank you for watching. Hit the like button, Subscribe. If you're listening on Spotify. Subscribe. If you're listening on Apple podcast, subscribe. And if you got forwarded the subs email, maybe subscribe to that one, too. ", "start": 3546.749, "end": 3573.5757}, {"speaker": "2", "podcast": "Alan, I hope you have a great time in Paris, and I really appreciate you coming on the show today. Man. Thank you so much for having me, and I will have I'll have an espresso an a croissant on on your behalf. ", "start": 3574.8704, "end": 3583.9941}, {"speaker": "1", "podcast": "I'll send I'll send I'll send the ether your way. Affirmative. Thanks dan. Alright. Thanks. ", "start": 3585.1892, "end": 3589.7478}], "summaries": [{"title": "1. The Rise of Decentralized Finance in Crypto: An Interview with Alan Scott, Co-founder of Rail Gun Protocol", "summary": "The Polygon Alpha Podcast explores decentralized finance in the crypto industry. Alan Scott discusses the Rail Gun Protocol and his experience at Hcc in Paris. The Polite Exchange of Thanks discusses the positive atmosphere at Eat HCC and its impact on customers and employees. Climate change's impact on California is also mentioned. The text also discusses a conference in Europe focused on Ethereum and the role of \"The Jan\" in a development team. Cultural background is highlighted as important in shaping individuals' career paths."}, {"title": "2. The Current Atmosphere at Eat HCC: Positive Vibes at a Conference Amidst Bear Market Blues", "summary": "This text emphasizes the significance of privacy in financial transactions at both the individual and corporate level. It discusses the potential risks of public ledger systems and the importance of privacy for governments. The author shares their background in traditional finance and their transition into cryptocurrency trading. They highlight the lack of privacy in cryptocurrency transactions and the need for solutions to protect users' identities and financial information. The text introduces Rail Gun, a smart contract system that aims to provide wallet side privacy. It also discusses the trade-offs between self custody and privacy in the blockchain space compared to traditional finance systems. Overall, the text emphasizes the need for a balance between transparency and privacy in financial data sharing."}, {"title": "3. The Impact of Climate Change on California: Positive Outlook at Texas Conference", "summary": "The text discusses the development of privacy-focused solutions in the cryptocurrency ecosystem, particularly in decentralized finance (DeFi). It highlights the Rail Gun smart contract wallet and its focus on privacy and compatibility. The text also mentions other privacy technologies like Ast and Tornado Cash. It emphasizes the importance of privacy in the industry and the high costs associated with using Ethereum. The goal is to provide privacy solutions for individuals and integrate with popular wallets. The text also discusses the Rail Done SDK and its potential use cases in transportation management. It mentions the partnership with the Rent protocol and the potential for privacy and anonymity in the Rin system."}, {"title": "4. The Biggest Conference in Europe for Ethereum: The Role of \"The Jan\" in a Development Team", "summary": "This text discusses the difficulties of using cash for online purchases and highlights the convenience of using digital assets like cryptocurrency. It discusses the challenges and future plans for Zk-SNARK technology, emphasizing the need for easier integration and hardware support. The author emphasizes the potential benefits of hardware support for Zk-SNARK technology in the crypto space. Another text discusses the lack of support for Zk-Snarks in current signature schemes and the need for collaboration with Zcash to develop this technology. It argues for the importance of privacy in cryptocurrency transactions and suggests that privacy can be maintained while allowing for verification of good actors. The text compares the privacy of cash transactions to cryptocurrency transactions."}, {"title": "5. Understanding the Importance of Cultural Background in Career Paths", "summary": "This text discusses the significance of centralization, privacy, and the Software Development Kit (SDK) for Wall developers in the current bear market. It highlights the potential of a new market called P and the importance of real gun and successful contract auditing. The text explores the economics of the Rail Gun protocol and the fee distribution mechanism of the Re Garden protocol. It discusses the role of staking in governance protocols and the importance of transparency in governance and treasury within a decentralized autonomous organization (DAO). The text also explains the role of relay layers in maintaining privacy and emphasizes the importance of partnerships in the success of a company."}, {"title": "1. The Importance of Privacy in Financial Transactions: Entering the Crypto Space: A Personal Journey", "summary": "The author discusses the importance of VPNs for secure internet connections at home and while traveling. They mention using Express VPN at home and a different VPN while traveling. The author also talks about the use of centralized exchanges for protecting funds and mentions a new solution called \"re gun\" that eliminates the need for such exchanges. They ask if there are any other topics to address and emphasize the importance of privacy. The author encourages individuals to explore the Railway wallet for privacy-preserving capabilities and urges readers to research protocols that provide privacy. They express gratitude to the guest and encourage engagement and subscription on different platforms."}]}