{"podcast": {"title": "Polygon Alpha Podcast", "host": "Justin Havens", "image": ""}, "episode": {"title": "Self-custody & the DeFi Mullet Thesis | Streams | Kieran Daniels", "number": "5", "date": "JUL 6, 2022", "description": "", "url": "https://www.youtube.com/watch?v=15xrqqAnGMY", "speakers": {"0": "Justin Havens", "1": "Kieran Daniels"}, "file": "july6.mp3"}, "transcripts": [{"speaker": "0", "podcast": "Welcome to the Poly alpha podcast. This is where the Poly community gathers insights from today's leaders and decentralized finance and crypto. I'm your host, Justin Havens, Aka Crypto. Let's get started. On today's episode of Poly on Alpha, we're joined by the C founder and Ceo of Streams, Kieran Daniels. Kieran, thanks for being here with us today. How's everything going? That's going great. Here in Sunny, San Diego. ", "start": 0, "end": 30.555}, {"speaker": "1", "podcast": "Yeah. Working hard and enjoying a day. Good. Yeah. That's awesome building in the bear market. Right? Yeah. Building just always building seems like the the bowl and of the bear but, yeah, it's it's definitely easier to focus. ", "start": 31.115002, "end": 42.294613}, {"speaker": "0", "podcast": "Yeah. And, like, when you and I first started getting to know each other, it was when I was at the index coup, and y'all were building streams or what is now known as Stream? What was it previously? Yeah. I've been previously smart d defy ", "start": 43.26484, "end": 57.895}, {"speaker": "1", "podcast": "And when we love that name, Like, it was great. And that was kind of... You know, we we started building this over a year ago. But, yeah, we recently rebranded the streams. The main thing was from real users. Like, once we had, like, the alpha and the beta and we started doing, you know, consumer research and talking, like, you know, Smart d files is a cool name for people that know what D fight is, but it was the first question with what's Defy. And that was kind of another love up wake up call, like, you know, who, you know, our target, you know, kind of, whether it be retail or beginner or or everyday person They are not really familiar with others this. So you kinda have to speak their language and we felt like streams really describes what the products are at to core and kinda gets that pointed across easier. ", "start": 58.57362, "end": 95.51153}, {"speaker": "0", "podcast": "Yeah. Also, oh, yeah. That makes sense. Yeah. If your target audience, non defy natives, it makes sense what you wouldn't want to call it. ", "start": 96.08352, "end": 103.62708}, {"speaker": "1", "podcast": "Defy, smart defy or something Defy. Yeah. In hindsight. Yeah. But we love that name, but I mean, we're we're we're so happy with that. Like, in it And we've had multiple kind of, I guess, learnings or or points where we realize like, oh, like, you know, they don't know what exactly stable points are in that they don't know exactly what these, you know references are and that's most people. So, you know, our main marketing focus after we launches content mark educational content, like, creating that, you know, giving that up free. And that's a lot of the burden that we have in that. But, yeah, we tried to extract away as much as the complicating stuff possible. Yeah. And do you have a marketing or education background? I guess that's a good idea. Like, what is your background? And how does you get into crypto so. Yeah. Great. Great question. So I'm thirty five now. I grew up in Idaho in the mountains, and I was always interested in guess, like, tech and and marketing, like, video game early and whatnot. That's actually how I got into, like, bitcoin initially was, I guess it, like, two thousand ten or two nine or something but buying, you know, job two items on online and stuff. But that really kinda, you know, red pill me into how banks work and how money works and how you know, what we're getting at here with self custody and whatnot. But I... Exactly like you said, I was always marketing focused. So I'm not, you know, developer by trade I understand the code and and and work with that. But, you know, I I I do growth early stage and marketing and and and communication, whatnot. So Yeah. I I originally started back in the day doing, like, Seo and web development and then got started in Saas. So I come from web two, I a previous company called Ins insta page. We scaled that from, you know, bootstrap from the ground up to about two hundred fifty thousand users It was, like a drag and drop website builder similar to wix, focus on conversion rate optimization and whatnot. But I really, you know, through. I did a little bit of school, but dropped out early and kinda just dove head first Saas for many years. So that's where I learned kind of these core concepts of getting users and what users want, and understanding a psychology and, you know, how referral works and how there's these core principles that you can, you know, build something. So did went two for a while, exited insta page in, like, two thousand fourteen, I think. I did early stage consulting. So just did help people like launch? Launch web apps or, you know, if they were failing, Like, I came in and kinda help them do early stage stuff. And then around two thousand seventeen, you know, same stories as everyone that's been around. I've been, you know, watching Crypto involved in it, kind of, but there wasn't really any room for non developers. Around two thousand seventeen, that really changed. It was, you know, a lot to do with Ico boom. But, you know, projects started happening and and they started getting funding and that's kinda where it kicked off. Yeah. And then from there, I got, you know, introduced like eat global. That's why I ended up meeting my c cofounder, J, that east global community, Ethan denver. That's really where I started to kinda see the light where everything was going and and a and it I ended up meeting a company there called Block native. Shout to Matt Cutlery and Chris Miles amazing. They're they're doing awesome. So it's a medical monitoring company. So I I was doing business development for them and it gave me ability during that bear market. So, you know, it's that was two thousand eighteen to to, like, work with No to, like, understand what protocols are to really, like, get, you know, the deep education on how this all works and where it was going. I actually met J through block native and working with that. And that's kind of where we developed the thesis around where we started to realize, like, you know, we're in this, like, kinda D defy bubble where we're all understanding what it is and aware of it. But the, you know, the everyday user doesn't get that, and that's kinda like the next frontier in the big pool. What we need to do and, it comes down to you know, user experience and speaking their language. ", "start": 104.358315, "end": 316.64496}, {"speaker": "0", "podcast": "Yeah. And Julius is your Cto ", "start": 317.28494, "end": 319.30493}, {"speaker": "1", "podcast": "now. Is that right? Yeah. Correct. Yeah. He... Mean Judith actually, you know, I met him through Block native. And then he actually had the idea of smart d defy in a previous form before beforehand And it was very similar to what Idol was. So what we... What he wanted to do initially is aggregate the lending protocols together and we can get into idle a little bit later, but Once we, you know, started talking about that realizing that. I think I I believe I was... I think he was previously connect with Title or whatnot, we we figured out about them, and then realize kind of the opportunity together that we can layer up on that. And, you know, what we got this idea of a self custody, like, buying power layer. And that's was more defy and eventually streams turned into. ", "start": 319.60495, "end": 357.27863}, {"speaker": "0", "podcast": "Yeah. Yeah. So with streams... What like, what was the main objectives? You know, like what is the need in the market that you're trying to solve? Is it like educating new users on how to bring them into D defy? ", "start": 358.07373, "end": 370.6383}, {"speaker": "1", "podcast": "Through this application. Yeah. I mean, that's a big part of it. Right? Like, you know, there's two sides with it That come the product, and then there's the education on what it is and risk assessment. So what's strange is really doing is it's solving a huge problem that everyday users are facing, which is earning passive income of device confusing in our. It's complicated to understand how do to use blockchain products from, like, wallet extensions to saving past raises. And even just acquiring it first assets is hard for most people. You know, someone's totally new to that, and they wanna earn passive income a D defy, most of them can't. Even though it's kind of, you know, it might be easier for us or people that are aware of it. So strangely really fixes this. It creates a seamless, like, you know, new friendly, beginner friendly onboarding experience. We've extracted abstract away the complicated hurdles of earning passive income. And it's basically just like, using a normal Fintech app, you know, we integrate with stripe and plaid. And... Yeah, I guess, we can kinda get into the different integrations and whatnot to later on. Yeah. And is is this wallet? ", "start": 371.2091, "end": 429.91232}, {"speaker": "0", "podcast": "Is this like a self custody wallet or is is streams custody game, the assets of the user. What's what does that look like? Yeah. That's a great question. So we're built on Notes is safe. ", "start": 430.54987, "end": 441.09836}, {"speaker": "1", "podcast": "We use their contracts interact with everything else. We have our own custom and battery contracts went whatnot, But that's really kind of the the the cool part about this is we're built on a multi sig wallet, which is a self custody wallet, so the user's control their own assets, and there's multiple signer. So while our infrastructure built a multi stick wallet. We don't really consider ourselves the wallet. Like, we wouldn't be a competitor ar or to zero on even though, like, we love those apps. And we use those What we really are is, you know, we're focusing these core products on passive income. And really, there's multiple stages. You know, there's exiting via beating eight point five percent inflation, you know, getting out of of fiat individual assets? And then how do you put those digital assets to use? So the most users, like I said, can't figure out how to do a wall wallet can't figure out how to do that. So we integrated with Stripe and plaid to seamlessly create an onboarding experience, that they can exit that system. So we partnered with wire, they're a fiat on ramp, and then the users use plan and in their bank account interact with wire. In the back end they're getting Usd, but, you know, they see that as as buying power that they can earn and then they can enter these different products. ", "start": 441.73703, "end": 511.1074}, {"speaker": "0", "podcast": "Okay. So it is like an onboarding tool. And like, how how does the know a safe ", "start": 511.83997, "end": 517.3}, {"speaker": "1", "podcast": "work? I guess, like we can get a little more technical here. But so like how many keys are involved in this? Like how many signer are there? Like the user Like let's say, I I'm setting up one of these. Right? So I've got a key obviously And then who else has a key and how many are there? Yeah. That's a that's an awesome question. And this is kind of the the principle of it. So the point of it at the top level is that the user has more keys than we use. So really, we're just the super app. You know, the un... Like, the... Yeah. Like the sexy way to do it is like, we're almost like an affiliate. Like, we're We're using all these different products to create this experience. So what we're doing is we're deploying a new nose safe for each new user who deploying that on Poly gong. So that's a multi si wallet. The user has two keys, an operational and a recovery key and then Streams has one operational key, and that's used in app when they're buying or selling streams. The the key that's the... So first off, the keys is encrypted and then it's stored on the user's device using Apple secure enclave, secure enclave, is used by Apple secure your information like your face Id and your biometrics and it's the most secure mobile and christian option that's that's currently available. The recovery cr is encrypted and it's stored on the user's icloud. So it's only used when the user needs to recover their account or log in to a different device. So they have two keys. They're they're controlling signer, and then or the majority controlling signer. And then we have a third key that's it's controlled by strings. And that's used for c signing transactions. So what this allows us to do what the app is doing, it's a ton of heavy lifting across multiple chains, But what we're doing is we're packaging up all these contracts and then the user signing that. So it allows us to protect them from list malicious transactions. And it allows them to not have to continually assign messages and whatnot. So you know, not so to be clear, like, we're marketing towards traditional investors we are a closed source front end. So, like, there's no there's no... We're not saying that we aren't... Like, that's not the goal. You know, we charge fees. We're creating this. Seamless onboarding experience risk assessment and providing, you know, the self custody buying platform. So so that's that. But the back end is full self custody. Like, we can't take money week without permission, we can't, like, go grab fees. If streams went away tomorrow, you could back up, you could, you know, you could retrieve your backup keys and and get your money and go sell your tokens and all of these are are standalone options. So, you know, we really think that that's kind of the missing I guess, I don't know, like, bridge for lack of a better word between kind of mainstream adoption is, like, people... You know, they might be unaware of self because how important it is, but look at what's happening in the market right now, you know, we're seeing that at the forefront. So having that core self custody in the back end and then still having a seamless experience in the front end is key, I think. Yeah. This is interesting. So like, could I send assets from, like my... Like the met the law that I access through Meta mass? Could I send assets ", "start": 517.75995, "end": 686.8406}, {"speaker": "0", "podcast": "from there too my streams, ", "start": 687.3135, "end": 688.98676}, {"speaker": "1", "podcast": "No safe? Yeah. That's a that's a great question. So what we're doing again, we're creating this closed source packaged up, like, fintech experience. Right? So we... So the back end is true cell custody, we can't touch those funds. But in order to use the app, we white those address. And that's not like a bad word, but like, in order for you to use the app and to go through and pay the fees and to use our risk assessment and do whatnot, then we like... Wait white those addresses to use the iphone app. Right? But you have your notes as safe and your recovery key, which is encrypted and we don't have at any time. So most users, we, you know, they they they don't they need the they need the recovery, and they need that, but they the people were targeting want to use this app and wanna use that front end. But if you wanted to send money to that. No is safe. If you wanted to take those idle tokens or take that spot eat out of your nose say, if you wanted to recover it. If you wanted to go use it on your own, then you're more than welcome to. And really, what we're doing is you know, we're the products, the streams are different idle... Different percentages of idle products and e spots. So for an everyday user, like, you, that understands Meta mask, like you wouldn't wanna use app. You know what I mean? Because you would just be paying fees. Do you maybe maybe you wanna do if the risk assessment or maybe it's easier and that's the convenience, but really, you could look at our model and you could go with Meta mask and you could buy that amount of idle, that amount of the earth and you would get the same results because we're not managing money. We're not, you know, trading. We're not doing any of that. We're really just a super interface for, you know, beginner users. So that's a great question. ", "start": 689.7835, "end": 774.1541}, {"speaker": "0", "podcast": "Yeah. No... Yeah. Thanks for that answer. That helps clarify quite a few things. So what are some of the Defy apps that... I mean, it this sounds like this is like the traditional, you know, defy mu. We've got Tech in the front and define the bat. So what kind of d five protocols and da around operating under the hood, so to speak. Yeah. It's a great question. So we ", "start": 774.7116, "end": 796.4521}, {"speaker": "1", "podcast": "you know, I'd like to keep saying, like, we really created this self custody buying power layer. And that's just kinda what we termed it as to make the most sense. But you know, it allows the user to within this app, take their bank account their money, get digital assets, escape inflation and start earning money with that. So Initially, the Mvp will consist of the most those multiple products that are offered by the Defect protocol idle finance. What Idle finance does, is it aggregates multiple lending protocols together. It's like Abe, D x, maker earn and a few others, and it creates two products. And these are tokens, and that's what you'll see in your nose is safe if you understand how to look at the notes is safe and whatnot. One rebalance Mac yield and the other rebalance to minimize risk. So really what's going on to, like, make it, you know, kind of very simple is a user's is taking the money other bank account. They're getting Usd. And then they're... The... They control that notes safe and that money in that. And then if they choose to purchase one of these streams, then they're taking that, they're signing the transaction from their safe and they're buying idle tokens in spot E. So that's confusing to an everyday user, but it's fairly simple on the back with that. So what what that is is, you know, it it allows them to to off board out of fiat easily get in and earn digital assets or sorry, Earn passive income with their digital assets. Now this is just Mvp launch. So what we did is, you know, we built everything on those save contracts. So any any chain that's E compatible we can integrate with. Any protocol. I meant. So at first, we're hyper focusing on these passive income products and we really think that that's what people need and that's what kind of the Is. But like you mentioned before with index c op. Like, we're creating this buying power layer. So you know, the, I guess, the natural progression we can assume is that a user, you know, exits beyond, excess inflation starts earning money with their passive income, you know, their digital pro... Sorry. Start turning passive income with their digital assets. And then six months down the road. They're like, hey, I've earned some money I'm... I've learned more. I'm educated now... Okay. Now what else can I do? So that's where we plan to expand. And we're gonna be very conservative about it because, you know, this is a new user and whatnot. But we have ideas of offering like, the index c products like Dpi. You know? So it really is this... Like, you know, like, you said a self custody buying car later where you can earn money, you can eventually get, you know, broad exposure index products. Another thing we wanted to do is since day one and we have full plans to is insurance, like decent decentralized insurance and offering that. We think it's not quite mature enough yet. But that's that's like, you know, you if you could think of that's an actual progression, it's, you know, you you exit fiat, you start earning passive income, you have this money there's last I to ensure that passive income. So Yes. And these streams that you say the users can purchase, is that Is that just your version of a financial product? And I'm I'm assuming it's income streams, but there's different types like is there like, ", "start": 796.8442, "end": 966.0312}, {"speaker": "0", "podcast": "passive ", "start": 966.84344, "end": 967.34344}, {"speaker": "1", "podcast": "or aggressive type of investments? Yeah. Great great question. Yeah. So the four products, we we, you know, we have, like, in house analysts that have worked with fidelity and that that are from the traditional finance sector. And what these are is we copy the historical model historical volatility model on purpose. Because, like, the biggest thing is... Or one of the biggest things is, you know, speaking a user's language not you know, saying too complicated to good things, But also if they look at these products and it doesn't make sense, like, they're not ever gonna use it. Right? So when you look at the products, we have conservative balanced growth and aggressive And these are... The way to think of it is baskets, even though now that it's tokens is not really baskets. But each of these, you know, when a user downloads the app, they take a six question risk assessment quiz. Very similar like what Fidelity or Vanguard is done over the years. And then we match them or align them with a risk profile. And that's the conservative balance growth they're aggressive. Now they can choose any product they want. We're not telling them what to do. We're not managing money. We're not touching the funds, but they can... You know, if they get massive throws, they can growth or they can decide to go conservative or whatnot. But all of these products are, it's using eat data, using their Api for five six years now using idle data, they're real products, but it showing what happened in the past. So based on volatility, you can see what the best twelve months were what the worst twelve months were and and what happened. So for a totally new user to defy, like, that's very helpful because they can look and they, okay, look, I'm know maybe I have a lot of funds and that's kind of what we're seeing is a a profile user. Maybe it's an older person with more funds. They'll be more conservative. You know what I mean? Or maybe like we see a lot of younger profile users Robinhood type, that might lean towards more aggressive. But the idea we're not saying what's going to happen in the future, but we show transparent on chain what's happened in the past. ", "start": 968.1203, "end": 1069.4916}, {"speaker": "0", "podcast": "And so, like, when users full money from their bank account, and it goes through wire to purchase Usd. And so when they're purchasing these streams, on the back end, is it essentially taking the Usd dc ", "start": 1070.1445, "end": 1084.7299}, {"speaker": "1", "podcast": "from their No safe and investing it in, like, idle or like, through Ave? Is that is that essentially what's happening? Yeah. I mean, it's it's much more complicated because we deploy things on Poly gone and batch over, we could talk about that. And that's why it's all affordable and we can wrap all the fees in. But in the most simple way, like, that's exactly it. So So we abstract all this. So the user use create account. They see, you know, start a saving stream, which is what we renamed buying power because they can earn one point three percent just by just by funding the app. That's Abe mat. And then like I said, each of these high yield streams, that conservative balanced growth and aggressive, are combinations of idle and Spot e. So what it is is The user is Interacting with Plaid and strike, Verifying their identity Using their Bank account like he normally would with another Fintech app. Then they're taking their fiat and Then from Their bank account and then they're buying Usd, like You Said. So The Usd is In Their Nose mistake now. So we've deployed enough say for the New user. They control that those keys and they control that wallet. Now they've purchased, let's say, thousand dollars of Usd dc. And then if they buy the conservative, I don't have the percentages in front of me, though, I think it's like, fifty percent of best risk adjusted twenty five percent of the other one and then idle. Right? So they'll have that Usd, and then they would buy five hundred dollars worth of the idle token, and it goes into their wallet, two hundred and fifty the other token and the remaining percentage of E. And then that, you know, I don't handles all of the rebalancing aisle handles all the yield generation and everything and and whatnot. So what, you know, strings takes a percentage of fee off the top and that's how we wrap everything in, but those tokens and everything is in in your wallet and you own those. So I guess the best way to, like, sc him. If you purchase, you know, conservative stream and you have those and then streams to disappear tomorrow. You still have idle tokens and you still have eat. So you could go sell your eat, you could go you know, I guess for team is the right word with your idle tokens and get that to get those profits and that those assets. Again, I love the emphasis on self custody as well. And I'm wondering like y'all have like a certain philosophy on why you chose to make this self testing? Or I don't know. What's what's the importance of that to you? Yeah. I mean, that's a great question. I mean, we like you said, we were... You know, we're real deep fine nerds and we're we're P with, you know, we kind of all or not grew up. But, you know, it's only, you know, five years older or four years old older or whatnot, But with a ethereum and with self custody. And, you know, there's been cycles before where you can kind of see why this is important. And, you know, there's always... There's this old adage that just comes back to where if you don't know where the yield coming from, like, you are the yield. So, I mean, the easiest way to answer why is the important is look at what's going on right now? Like, with Celsius with Block v, anchor incur, Like, gets extremely unfortunate. Like, I don't want anyone to lose money and that's very sad, but like, those people probably unknowingly and that's where the burden of education comes on us, but they sacrificed self custody for convenience or whatever you wanna call it. And when you don't know where the yield actually coming from, it's not collateral, You can't see it on chain. It's not backed by anything, then you know, bad things will happen. So self custody is is is the thesis of this and kind of one of those, I guess, pillars where we'll never compromise on that. And you know, we could make a lot more money. Like, you know, you could... If you were just taking funds in and and yolo gambling it and doing all this. Like, you could make a lot more money, but that is not like, from the beginning, you know, we felt self custody was the most important thing. It's fine it's close source in the front end Like, the people that were targeting want that. Like, they prefer pla. They prefer right. They prefer using a Fintech app where they can, you know, at least trust money on that But, again, the self custody in the back end is truly there and and you own those funds. ", "start": 1085.4298, "end": 1299.4465}, {"speaker": "0", "podcast": "Makes sense. And it's really like, you're in charge of your funds, but what the stream app is doing is almost restricting which type or which specific Defy apps can be used within the app? Right? And so how do all... Well, first of all I write in thinking that? And then how do y'all all make that risk assessment on which Deep applications are safe enough for your users? ", "start": 1300.3376, "end": 1323.845}, {"speaker": "1", "podcast": "Yes. So, you know, that's the hard part. That's kind of what's on us. Like, we can... Like I said, we capable of integrating any E compatible protocol. So we could have launched with a bunch of different options. From my mindset is understanding like consumer mindset not, I think we need to hyper focus on something. And that's, you know, earning passive income. But other than that, it's, you know, the smart contract risk. And so initially, you know, I... What it does is first of all, it's like very old. I think, you know, Canine and synthetic and invented d defy in yield farming, but I it's been around for I don't I don't remember the exact years. I don't miss. You know, three or four years coming on that. And from the beginning before d five summer before Andre before Urine before any of that. They were focusing on this concept of risk adjusted and and and rebalancing and and this long term sustainable yield. So You know, we really built this product to perform the best in a bear market ana bull market. And you can see that, like, with this last... You know, this last crash, if you would've have bought at the top, I, these are, you know, hadn't launched yet, but all the data's is there. If you would a started to stream at the top of twenty twenty one, he would still be, I think, one point eight, I believe that's right, percent and positive. So, you know what I mean? Like, the average and something like that is, fifteen to eighteen percent. Like, back in, you know, if you wanna go and that's what it'll again be if that happens, but there's a big difference between losing all your money and and investing in something that can rebound up and down. So you know, to answer your question directly, like, I don't kind of checked all those boxes to the, I guess, safest or the most secure bet at launch. It aggregates multiple platforms. So, you know, if all hacked. It's not just that if if maker gets hacked or whatnot. They've been around for a long time. Their products aren't focused on getting rich quick, they aren't you know, some po economics type thing Like... So... But, you know, again, with that being said, like, that's just the core of of what streams is initially and kind of these core passive income products. And then as d five evolves and as, you know, new things are created, we can we can see where those fit into the product offering. Yeah. Absolutely. ", "start": 1324.4019, "end": 1437.3424}, {"speaker": "0", "podcast": "Yeah. It makes sense to use the the seasoned ", "start": 1437.7411, "end": 1440.6476}, {"speaker": "1", "podcast": "blue chip V g defy protocols. And I didn't realize idol had been around for that long. That's that's really interesting. Don't call me anything second. But I, they were... I think we were working with almost three years of data, and that was a while ago. So, I mean, they've been... Whatever maybe it's not four. So I don't think has been out that long. But yeah. I should look at that. But, yeah. They've been, you know, from the beginning It was before any sort of yield farming or or that term was ever used. So... Yeah. Interesting. And something else you were starting to talk about was ", "start": 1441.0226, "end": 1468.2631}, {"speaker": "0", "podcast": "something to do with batch the transactions of your users down to Magnet net or ", "start": 1469.2084, "end": 1474.4165}, {"speaker": "1", "podcast": "what were you saying there? Can you elaborate on that? Yeah. Exactly. So, I mean, this is how we use Poly gone. So, you know, I guess, seven months ago or so, we I get, you know, is when D five summer started, then we realized, like, oh, man, it's it's gonna be a lot more expensive. It used to be about five dollars per user to generate a notes say for them. Which still is, like, too much. Like, you wouldn't wrap that into acquisition cost. So we still had to figure something out, but it it it on up, like, ninety dollars or a hundred dollars or more per users. So We, you know, personally and been always always been big supporters of layer two in the concept. But back then, you know, not only was Poly gone the only one that was, like, able to support users and still kind of is you know, they... Their team is amazing. Like Sand deep and Jd, you know, they organize run when you host from That works with them or you guys have chance, you know. But Mean, like, it's like actual real real business development, real understanding with that. So we had early support from the beginning and realize what we could do with this. So what we're doing is We we used we use the notice contracts for pretty much everything. So that's, you know, that secures. I think it's like, five billion dollars in digital assets now. It's, like, five percent of all ethereum or something. So that's how secure streams is essentially using those contracts. And then we have our own custom contracts, which are otter by Pe shield. There... What those do is we We generate the nurse's safe on Poly, which costs cents compared to one hundred dollars or whatnot. And then we we do all of that and all the poly on. And then once every threshold so right now it's like twenty four hours, we batch those over to main net. So instead of you know, ten users paying each individual transaction cost, then it's split by ten or a thousand or ten thousand or whatnot. So the cost of deploying and the cost of doing that decreases as the user scale. That's that's really interesting. So what mechanism are y'all using to batch those transactions down to magnet. Those are the custom contracts. So what we did is we have no... We deploy no on Poly gone. We do all the transactions over there, and then we have a custom battery contract that we've, you know, been developing over the last year. And that just... You know, we can set a threshold journey time. So it could be ten minutes. It's gonna be you know, twenty four hours right now, is twenty four hours. So have our many users are created and no the saves are generated in twenty four hour period. Then we take all those transactions and batch them over to main net and commit them at one time, and that only costs one transaction cost or fee, I guess instead of however many was split. Does that make sense? It does. That's that's really interesting. So these... I guess these you've created drone bridge essentially. Right? Yes. But a bridge is something very different. And a bridge has vulnerabilities and a bridge supports a much. You know what Mean? Like, really what we just create a very simple I think it's like twelve dakota. It's a very simple like... I'm not... We, you know, we can talk to J next time you gotta have him on to get into more details of of the exact on that. But what it's... We're only bashing those transactions. Those are pre committed and their and their vast and committed to the main net. So As far as I know, it's it's it's it's very simple, like it's... You know, and it's only the only risk if that contract were to get hacked, let's say, it's always risk. Is however much money's held within that, like, twenty four hour interval and whatnot. So much majority all the user funds, everything that's happening is held on there, and then it just our daily transactions essentially. So... Yeah. I think that that there's other there's other people that have done this, and I I really think that this will be how pretty much everything works. Like how... How any sort of app will work? Because it makes much more sense to bash things on layer two or poly owner scaling solution or whatever you wanna call it. And then and then pass them all over at once to make net versus committing main at every time. I mean, I think that layer one will always be the settlement layer and that layer two is a consumer layer. And that's kind of like how we built this Yeah. Well, that's that's really fascinating. That's really interesting. ", "start": 1474.7942, "end": 1692.1583}, {"speaker": "0", "podcast": "Yeah. I'm have to dig into that a little little bit more. But, yeah, let's talk about Poly for a little bit. You know, why why did y'all decide to use Poly gon? Obviously, low cost transaction fees, but, like there any other reason outside of that? Yeah. I mean, like I was saying before, we started talking to everyone. You know, this is, like, nine ", "start": 1693.1129, "end": 1709.5947}, {"speaker": "1", "podcast": "months ago or so. You know, So we knew we need a layer two solution. We understood it pretty well. We talked to everyone at the time and, you know, no one at that time was even viable or or ready to use that was initially why. But then, you know, once we... Once we start talking to San And Jd and once we, you know, realize hands on everyone is. And, like, what we can do it. It's it's just the perfect solution for us. Like, we're not an Am market. Like, we don't need the heavy lifting of optimism. Like, we don't, you know, like the case, like, all of those different amazing things in layer two, Like, we don't really need you know what I mean? Like, we're a consumer app, and that's like, what we're focused on. And and that's Poly gong can do a lot of amazing things and we're only talking about the, you know, the the single channel. I know Poly gong has Ck and all that coming too. But for what we for what we needed, Poly is just is this the best. Like, we can, you know, we can generate these saves, We can deploy everything. It's it's pennies the dollar And then like I said, we can just batch everything over to Main net whenever we want to. So it's... I think people are gonna start... Everyone everyone's gonna do this. You know what I mean? Like, we might be first to market and some of this dispatching stuff, but the concept have been out there. And once I think people see that the heavy lifting pays off and it works, then I think a lot of people you'll see start to just to do it like this. Yeah. That's that's really interesting. ", "start": 1709.9845, "end": 1783.4103}, {"speaker": "0", "podcast": "So what's next for streams? I know you mentioned the insurance side? I don't know if you can elaborate on that a little bit, but and then what else in general is coming up for streams? ", "start": 1784.8586, "end": 1794.1108}, {"speaker": "1", "podcast": "Yeah. I mean, exactly. We've been building for about a year now, and, you know, we realized nine months ago we need layer two. We, you know, wanted to remove some red or dependencies guess mount red with the key thing and whatnot. So, you know, we've been building and building. So we're really just focused on launch right now. We're really focused on getting that content out, getting getting the app live, We're already starting to get some some early users in data and the feedback awesome and we're live transactions now. So... Yeah, The... What's next is we're launching in July. It should be, you know, end of July. Testing is the only unknown so that might take another couple of weeks or whatnot, but we're already starting to invite people. So, you know, you can visit streams, dot x y z, sign up for the wait list, and we're gonna, you know, just kinda dump everyone in here really soon. You, we're raising our equity round that's exciting. So that's kind of another thing that we're focusing on another side of this. So... Yeah. When it comes to insurance in the different products, that's it's something that we're capable of doing and we wanna to do and we've wanted Juice since the beginning. We would have logged loved to, like launch with that. But it's one of those things we're it's up to us to be very conservative and very cautious about like, what protocols we add and what we use and all that. So we're gonna... You know, with insurance it it it kinda of just depends on the development and the maturity of that. But, you know, look for things right away after to launch, like with the index c products, T dpi. There's multiple other structured products we can integrate. And, yeah, we're just excited to to get it out there and into Start Helping People Passive Income. What About Any Ns ", "start": 1794.6844, "end": 1886.5836}, {"speaker": "0", "podcast": "Integration? Do See Opportunity There? ", "start": 1887.1141, "end": 1888.6997}, {"speaker": "1", "podcast": "I mean, their so much cool stuff to do in D. Right? Like, So that... You know, if there's something I've learned from from working consumer and and Web two and stuff like that is you really have to focus on doing, like, one thing to best. You know? So so that onboarding and and earning has been coming and kind being that buying power layer like that, you know, we really want to target people that are kind of focused on that type of investment and whatnot. But, I mean, the technical the technologically who capabilities there. Like, we could do anything, But I don't see that probably being something that that we add to this type of product, but there's so much other cool you know what I mean Like, hey... I... So I'm... I've always been a product person. So it's like, if someone else is doing it way better, like, why? Just choose there, you know, do that focus on what, you can do your best and do to that? Because, like, you're just gonna make something that's kind of just additional and whatnot, you're just losing focus from the main point. So... Yeah. That makes sense. Like, if someone's already... Yeah. Someone else is implementing something better than you, especially in the device base where you have this compost comp ability feature, you know, just ", "start": 1889.8097, "end": 1949.079}, {"speaker": "0", "podcast": "plug into their app and have them do it for you essentially. Yeah. So what I don't know what else can we talk about? Like, what have I not talked about or addressed that you wanna touch on? You know. We really went over so much about this. You know, ", "start": 1949.5391, "end": 1964.1389}, {"speaker": "1", "podcast": "Like, we... We're just really excited to launch. You know, we like, the the team has built this, like, Jig and I started it initially and and, you know, we we kinda funded the back end and and and did the, you know, the proof concept brace preceding and whatnot. But, neither of us have done a mobile app and, like, our Ios developers, our product managers are smart contract developers like everyone, you know, we've focused heavily on on creating awesome remote team over the last six months and, you know, even longer than that. And so, you know, it's... I'm just very guess I'm very confident in the future of this and and where we're gonna go, and I think that this is one of the first examples of many that we're gonna see of that it's gonna bridge that gap like mass adoption, or whatever wants to call it, but it's really just, you know, speaking the user's language and and and you know, people always... You know, we have this problem of you know, the the average return on one of these products was, like, eighteen percent. So a lot of people will just be like oh that scam Like, that's a po z. And that's because their brokers have been telling them that a scam for the last ten years and taking a cut. You know what I mean? So, like, we try to find to people is, like, there's a difference, Like, this isn't like us being a broker. This is, like, you being a bank essentially. Like, if you're... Because banks get that rate, You know what I mean? Hire. They can lend that out. So this is essentially eliminating you know, those middle man and kinda getting that out there. So I know that wasn't really, you know, your question Just kinda start talking about that, but we're gonna try to support that the best with educational content and just try to, like, really, you know, beat these narratives in and just absolutely. Well, another question that ", "start": 1964.7789, "end": 2050.7126}, {"speaker": "0", "podcast": "listeners have wanted me to ask is just, you know, as one of the leaders in the space Karen, like, what are your thoughts on the current market conditions right now? Like, what like, what are you like, what are you seeing that maybe ", "start": 2051.0916, "end": 2062.1975}, {"speaker": "1", "podcast": "others aren't as you're in this space twenty four seven. Yeah. I mean, I guess that's a good thing. You know I mean, there's a lot of noise. So you gotta that's one of the things just filtering through it. You know, I'm not a trader and I can't I can't really say what's gonna happen, but I've seen a couple cycles Normally, in traditional finances it takes, like, ten years to see a couple cycle. And we've seen, like, three in the last, like, five years or six years or whatnot. So, like, we're talking about earlier, I think a lot of it has to do with leverage still, and I don't think that we're quite to the fundamentals part of this market. You know, the... You can have a really great project and and and it cannot be well in the market and and vice versa and whatnot. So it's a lot of it's a lot of leverage, lot of speculation. You know, it's definitely a bear market I think right now. Like... And and we're seeing that and we're past that kind of... It's a accelerating cycle of people realizing that. The... Yeah. I mean, it's it's just it it's an interesting time. I think that it it's a time to reflect, like you know, there's been a lot of a lot of po z type stuff, a lot of people not trusting... Or a lot of people trusting third parties and and not using self custody and there's been a lot of, you know, kind of ", "start": 2062.587, "end": 2130.3572}, {"speaker": "0", "podcast": "fallout from that. So I think it's a good time to kind reflect on everything and just, you know, heads down build and and look for what products come out of this that are that are sustainable and that can help people. Yeah. I just, I guess a little relieving to just kinda of be able to get on Twitter and not really have to deal with all the noise. Right? Like, not worried about Elon pumping dose to a dollar or, you know, what other crazy things kinda went on in the bull market or like, was it Like, s in Or was a thing when people are buying all those in ease of was it like, Irene dow or something like that? Yeah. Just... Yeah. And I mean, people always say like, you know, what was the top signal? And man, you look back and, like, how to like, they were a there were a hundred of them. Yeah. ", "start": 2130.7478, "end": 2176.6519}, {"speaker": "1", "podcast": "Exactly. But, like, we're in this post bubble. Right? So I always like, no that. But I know a lot of people that get caught off guard this time. You know what I mean? Like, it was... I think that there was some sort of mass solution or or, you know, the whales what they want, but it it's it's it's been interesting. Like, a lot of people got caught with their pants down. A lot of people, you know, work sideline like when they needed to be and whatnot. So it'll be interesting when it comes up. But again, I think it's all healthy. Like, we're so focused on the short term. You know, in five years, none of this is gonna matter. Like, we need to get the leverage out, then mark needs to stabilize. And these products, they're gonna start opening up to, like, mass adoption or gonna change everything because it's easy to be volatile and there's such a small pool of, you know, whether it's assets with people or users. But once that grows, I think we'll start to see more stability. ", "start": 2178.4026, "end": 2222.175}, {"speaker": "0", "podcast": "Yeah. Absolutely. And I also wanna know, like, since Everyone's just kind of focused on building the bear or building through the dip. Like, what do you have advice for developers who are just kinda starting out or that are building right now? Like, what kind of advice would you get to these people? I just don't look back. You know what I mean? Like, web two and whatnot like, you know, they're like, ", "start": 2222.8914, "end": 2241.2698}, {"speaker": "1", "podcast": "it there's gonna be volatility. There's gonna be these different cycles of adoption. There's gonna be other thing and that's exciting. And, you know, what we're building here and what we're you know, we're like, you know, bank same, like banking un bank and and champion self custody and and getting like these these things that you know, there was, like, separation of, like, search state. That was, like, a huge thing for society, and I think that what we're doing is we're creating like, the separation of money and state. And you know, if you're in Web three, even if you're older or if you're younger if you're, you know, when of these, like, there's so many fifteen, fourteen year old whenever, like, you In all of history, there hasn't been a greater opportunity than this. Like, it's not just finance, it's not just the Internet. It's not just... It's it's like this is you know, just don't look back. Just keep doing it, Just keep learning, there's so much to learn. And if you just immerse yourself in it, and you know, find your kind tribe or whatnot, Like, this isn't gonna stop. So this... This isn't even a dip yet. You know what I mean? Gonna get way worse, I think. So it's like, you know, if if if if it's if if your finances rely on trading, stuff again, that's very different than than building and being involved and whatnot. You can do both. But And it's nice to have both when there's these times. But, yeah, just, yeah, just stay focused. Yeah. I might do with you. Also not a traitor, but also, do not believe that we have reached max pain yet. So... Yeah. It would be ", "start": 2242.1643, "end": 2321.355}, {"speaker": "0", "podcast": "Yeah. Yeah. No. Yeah. Yeah. We can stop... We can stop the market doc there. ", "start": 2321.8137, "end": 2325.1697}, {"speaker": "1", "podcast": "So, yeah, we're kind of run up on time here, but Kieran, yeah, like, if there's anything else I wanna talk about or if not, just you know, where can people go to find out more about you and streams. Yeah. Right now, we're doing a fifty thousand dollar giveaway. So a legit contest. We know the incentives work. So that's going to be our pre launch giveaway. So you can go to strings dot x y z, sign up for the waitlist list. You can refer your friends to get more entries, you know, the normal type deal. So we're gonna give you, like, twenty five thousand dollars One person, ten thousand five thousand to multiple people and whatnot. So that's happening in the next month. And then as soon as we're ready, which will be, you know, in the next four weeks or so we're gonna start inviting people and and and the apps ready. It's working. It's live transactions. We're just kind of in the final testing phase. So what I'm excited about is we finally start marketing it, we have the new website launching. We're gonna be doing a case study with Poly gong. Case study with No, case study with Idle. And the majority of, you know, our focus is a team is just gonna be on creating, like, awesome educational content and really just you know, educating new users and kind of creating that net for them to to exit inflation and the Ph system. So, yeah, just just join the wait list and look forward to to seeing everyone getting everyone's feedback. Awesome. I appreciate it, Karen. ", "start": 2327.4963, "end": 2397.5017}, {"speaker": "0", "podcast": "Love the app. Love the idea of Self custody, no matter how it works. Even... I mean, and you utilizing that safe. It's fascinating to me. I and I love that idea. I'm not sure how many other apps to do that, but I I definitely like it. And To everyone who's watching this on Youtube? Thank you for watching on Youtube. If you're listening to this on Spotify, Thank you for watching listening to this on Spotify. Karen it's been a pleasure, and I'll catch you next time. I'll see you later. Thanks. Appreciate it. Have a great day. You too. ", "start": 2398.2964, "end": 2426.7092}], "summaries": [{"title": "1. Poly Alpha Podcast: Interview with Streams CEO Kieran Daniels", "summary": "This text is a summary of an episode of the Poly Alpha Podcast, where the host interviews Kieran Daniels, the CEO of Streams. They discuss decentralized finance and crypto, and how Streams is contributing to the industry's growth. The conversation takes place in San Diego and highlights the challenges of building during a bear market. The text also discusses the rebranding process and the importance of selecting a suitable name for the target audience. It further explores the challenges faced by the company in marketing and educating users about DeFi, emphasizing the importance of user experience and effective communication."}, {"title": "2. The Benefits of Building in a Bear Market", "summary": "This text discusses an application that aims to make earning passive income through blockchain technology more accessible and beginner-friendly. The application provides education on blockchain products and risk assessment, and integrates with popular payment platforms. It focuses on generating passive income through a multi-sig wallet and offers various stages for earning passive income. The app utilizes multiple keys and encryption to ensure secure transactions and protect user information and assets. It also explains the features and functionality of a closed-source fintech app that offers a user-friendly interface for beginner users. The text also discusses the concept of Defy apps and protocols and the concept of a self-custody buying power layer. The initial launch of the Minimum Viable Product (MVP) focuses on passive income products offered by the Defect protocol idle finance."}, {"title": "3. Confusion and Evolution of Stream Technology", "summary": "Climate change is negatively impacting global food production, leading to concerns about food security. Sustainable agricultural practices and resilient farming systems are needed to ensure future food security. The text also discusses investment products offered by a company, with users matched to a risk profile. Older users tend to be more conservative while younger users lean towards aggressive investments. Another text discusses the importance of self custody in financial applications, emphasizing transparency and security. The Stream app restricts certain Defy apps and raises questions about risk assessment. The concept of risk-adjusted and sustainable yield in cryptocurrency investment is also discussed, along with the potential for future expansion in the DeFi sector. The text also mentions the use of seasoned ingredients in cooking and explores the confusion surrounding blue chip and defy protocols."}, {"title": "4. Rebranding and Naming Considerations for a Product", "summary": "This text discusses the importance of prioritizing and focusing on one specific aspect or feature when developing a product. It emphasizes the benefits of integration, improved communication, and streamlined processes within a company. The author cautions against trying to do too many things at once, as it can lead to a loss of focus and a diluted end result. The text also discusses the advantages of using Polygon as a layer two solution for a consumer app, highlighting its low cost transaction fees and potential additional benefits. The speaker predicts that more people will adopt this approach once they see its success."}, {"title": "5. The Importance of Choosing the Right Name for Your Target Audience", "summary": "The speaker discusses the volatility and speculation in the cryptocurrency market, emphasizing the need for reflection and building sustainable products. They believe that the market is currently in a bear market and stress the importance of self-custody and reducing leverage. They predict that the market will stabilize in the next five years with increased adoption. The speaker advises developers to stay focused on their goals and not get distracted by trends. They also discuss the potential of Web 3 and the importance of market research in business decision making. The launch of a new streaming platform is mentioned, along with its incentives and plans for educational content. The speaker expresses their appreciation for an app that allows for self custody and thanks viewers and listeners."}]}