{"podcast": {"title": "Polygon Alpha Podcast", "host": "Justin Havens", "image": ""}, "episode": {"title": "Using Stablecoins in DeFi | QiDAO | Ben & Pablo", "number": "6", "date": "JUL 13, 2022", "description": "", "url": "https://www.youtube.com/watch?v=15xrqqAnGMY", "speakers": {"0": "Justin Havens", "1": "Ben", "2": "Pablo"}, "file": "july13.mp3"}, "transcripts": [{"speaker": "0", "podcast": "Hello everyone. Welcome to the Poly alpha podcast. This is where the Poly community gathers insights from today's leaders in finance in Crypto. I'm your host Justin Havens, a aka Crypto. Let's get started. On today's episode of Poly Alpha, we are joined by Benjamin Pablo, who are two of the core team members of the C stable coin protocol. Benjamin Pablo, thanks Be here with us today how's everything going. Hey, man. Thanks so much for having us. It's really a pleasure. Thank you for having us. Yeah. Absolutely happy to have you guys here. So we usually like to start off with just like some background on our guests. So benjamin lets start with you, like, what's your background? How'd would you get into crypto? And then Pablo will move on to you after he's done? Yeah. My my how Going to Crypto is actually pretty tense here. Isn't in his pablo ", "start": 0, "end": 53.55582}, {"speaker": "1", "podcast": "or or the penguin some people call them. You know, he he, like, very early on where we're very like little, he would tell me about this crazy thing called Bitcoin and how we should all be we should all be using it. You know, we did a lot of projects together. Outside of chi out, mainly like in the infrastructure space, more geared towards like developers. I then left crypto and went on to the like, traditional finance M and A, which is a terrible idea if you're like a huge. Like, I learned a lot, but I realized, you know, the the faults in the financial system and how crypto is like. Seriously the feature, and that's why we should go with. And so that's kinda of where I pivoted it back to Crypto. ", "start": 53.930412, "end": 101.42939}, {"speaker": "2", "podcast": "Yeah. Pablo What about you? Well, I mean, that that's the fun origin story. See like you see it from the banking side on, like, the t five space. I came more from a technical. Like, you academic group. I did computer science in university. So I was already doing a lot of stuff, doing hack pumps and all that. And I was super into Ai and, like, applications, but I had hit our roadblock in terms of building because a lot of what Ai required was just huge computational power and, like a lot of money. Which as a college student I only had access to like, a lot of Aws us credits and stuff like that. So those are a lot of opportunities to create like, awesome Ai as like the l opportunities that would be... Would have been available with like crypto or you can just create something and it scales infinitely to the power of the network. So in hindsight, I think that's what propelled me to start working a lot more with company companies like consensus and others where we put throw events at my university and then suddenly I had a lot of french crypto and we could build a lot of things together. ", "start": 101.988785, "end": 175.24559}, {"speaker": "0", "podcast": "Yeah. And you both eventually found your way to C out. And all of you are founding members of C, core contributors, ", "start": 175.97946, "end": 185.01012}, {"speaker": "1", "podcast": "how did all that come to be? Well, you know, we all we all met, like hack with a team, we some some like plan the hack, some participated them. But I as I you know, like Hack are just a great space for meeting people. And so, yeah, we've been it out for for a long time since the beginning. And, yeah, that's kind of how we came together. We we all really like stable coins. And obviously, like as we saw a cross chain becoming a very strong narrative. We knew that stable coins are gonna be necessary native on each chain. And being that a lot of the stable claim protocols are very like eth nazi, we knew that they weren't going to port over. And most of the applications we'll see would be maybe lending but mostly like Dex, like Unity v two forks. And so that was like, a huge opportunity. Strategically right to insert ourselves as the stable coin on all these different ", "start": 185.50499, "end": 241.71327}, {"speaker": "0", "podcast": "platforms. Yeah. And I think stable coins are fascinating to me too. They didn't used to. I I used to think they were so boring. And then, like, the more and more I dug into stable coins and the different types and how they work. The more interested I became. And I I think it'd be good idea to just kinda set like a base layer foundation of knowledge for our listeners, and our viewers if they're watching on Youtube. Of just like, the different types of stable coins and maybe like the security trade offs that you might have there, because I think in my mind, there's, like, like the fiat back, like the one to ones, and then there's the over collateral, and then there's a so algorithm. Those are the three that I can think of off the top of my head. So can y'all all elaborate on that and just kinda talk about the the wrist trade offs? Or if I'm missing any maybe touch on those as well. Yeah. I think nowadays, ", "start": 242.25047, "end": 295.0101}, {"speaker": "2", "podcast": "there seems to be... The the views is very much blunt. It's either algorithm or fiat feedback. And at least that's what happens in the media today. If you go to Coin desk, they think, oh, make or down. Well, technically pizza algorithm because there's no money behind it. But I I tend to agree with the with you this idea of fiat backed, maybe different exogenous collateral and then algorithm, which can we describe as endogenous collateral. So things that you're holding, like, your governance token like such as f or Usd where the same governance token can be used to back the the stable. With those three, I think... One... If you can say if you can divide into the three options you're able to dive deeper into what is backing the token, which is very important when it comes to these over collateral loans that back the token because... Well, you can you you also have other tokens that you have to then kind of fit into one of these categories such as Faye, which is more about protocol controlled value rather than user controlled value. And that yields different responses because when you have a protocol control value, your governance token basically manages this huge treasury, And so there's an incentive to hold a bunch of tokens and control this huge treasury rate, but you are now kind of responsible as a protocol to maintain the collateral utilization ratio over a hundred, which can be sometimes impossible if, you know, Let's say, you had a bunch of ef and it just dumps ninety percent, might be difficult to maintain that. And, yeah, kinda... Like, I as I'm explaining here, like, you can kinda see why we picked the model that we did, the over collateral over collateral system with a user controlled value. Seems the most effective one because it's the most independent one. So now you are able to have many different parties and many different individuals kind of building together this similar system. And the system could then run with similar risk parameters on multiple chains and be connected in a pretty straightforward way through different bridges and we can get into how we do multi chain soon. But Yeah. The main thing is the having multiple exogenous collateral, which means collateral that are being held that are not controlled by us directly. Allows us to create a very stable system. Some might say better than endogenous collateral could. Or protocol control the systems could? Yeah. I would say that I share that opinion and full disclosure, ", "start": 296.33755, "end": 481.74387}, {"speaker": "0", "podcast": "none of this is financial advice none of us are financial advisors or attorneys or life coaches. This is not life advice either. But I I tend to agree with you in the sense that I I feel like having an over collateral stable coin that's backed by a digital asset like Ether or mad. Feels more secure like in the in the long run, like, if you think of like the most dystopian edge cases for stable coins, like even Usd dc and and t, I feel like... I don't know. Are not as secure just because you have that centralized force. And that's... Those are kind of my thoughts on this. And is that kind of the philosophy a fee that y'all have ", "start": 482.30032, "end": 528.67706}, {"speaker": "1", "podcast": "when y'all were creating G out? Yeah. Definitely. I mean, we signed this last crash that you know, whereas a lot of investors see c or centralized implementations of crypto are safer. They're clearly not safer. And that's because they like transparency, which is kinda like the core of collateral like a crypto collateral backed stable coin? Because you can check on the contract. Is there collateral or this not collateral? Is pretty it's pretty simple. ", "start": 529.0536, "end": 558.95953}, {"speaker": "2", "podcast": "And on to that, like, pm back stable coins are perfect for on ramping and not ramping, they provide a clear arbitrage opportunity for certain actors. So, you know, if you wanna buy some, you don't have to go to circle. You just buy some Cc on curve. It slowly pushes up the price and then some financial institution comes in and says, oh, let me arbitrage this. And, you know, I will buy Usd dc from Circle transferred in there. Bison some Bitcoin would draw it into a centralized exchange. And you do do a loop. And so that in insult is pretty healthy for on ramping and off ramping. But when it comes to actual Defy, it doesn't necessarily make sense to provide liquidity into Dc positions all the time because there's only so much of it. So you're dealing with a very Scarce resource because it's a fiat backed bank account or fiat back token. So by having a bank account, you were kind of limited by the amount of money that can flow into that. If you can use some crypto based secure crypto based say coin, you're able to multiply that the amount of money that is in the system by using the the backing of it. So the the amount of the the achieve the strength of the token. To create more dollars. So now you can have... Like, you can support a bigger ecosystem. Like, let's say there's only eighty billion or let's say, ten billion dollars worth of In Uni swap. And you divide it into five different tokens? That's two billion unique. You divide into a thousand tokens, you know, you get much much less. But when you have these different kinds of stable now, you... And they must be secure, They can be built with, like, shaky ground like Usd or others. You can now have, you know, fifty a hundred billion that is sort of connected, but not fully connected to Usd. And so it can provide a better grounds for for growth in terms of having a lot of money name flowing around between all these applications. So you don't have Usb stagnant on one Random token. Because, you know, someone decided that it's C, and then you only have this much to play within the entire system. So it really does help in terms of ", "start": 559.6751, "end": 716.00104}, {"speaker": "0", "podcast": "financial efficiency. Yeah. That makes that makes sense to me. And I also wanna kinda touch on something you mentioned earlier about how in the media, there seems to be only two types. Right? Fiat backed and algorithm. And I've seen that come up with some of my group of friends who are not as maybe crypto native or defy data as I am. And one of my friends ask me, you know, when is die gonna death spiral because it's algorithm just like terra, you know, Us t. And, yeah. I think it's just like a... It's just a point of education. Right? It's like, it it's... Because Us was not a hundred percent backed and die in my are like over a hundred percent backed by digital assets. And I think it it would also be helpful to explain for our users. Like, let's just go through an example. Like, let's say that I have, you know, ten Ether or, yeah, Let's say I have ten Ether, and I want to mint my, the Us dollar den stable coin of the cheat out protocol. What steps do I go through with that ten ether then I know you are launching v two as well. So this also kinda helps lay the the foundation for what happens with v one and then how the differences are in too. But let's just start with that example. You know, I've got ten ether. ", "start": 718.47266, "end": 798.6001}, {"speaker": "1", "podcast": "What are my steps? What do I do? Yeah. So I mean, if you have ten ether, we can, I guess, assume now it's okay? One dot one thousand. That's so ten thousand. We we we let you borrow, you know, up to seven k. Of that value. Now what's cool about c that, you know, we're in a bunch of chains. So whatever chain you have your e, your favorite chain, hopefully, it's Poly gun. You know, you can lock up your eat there and mint my and completely permission list. Right? So when you do this, you have to create a vault that's specific to you and specific to ethereum. So and this fault is represented in an N that only you can... Only you can access. Right? Like, it's not the team when they can decide to take your debt or or take your collateral it's completely owned by you and only you can access it unless there's an event of liquidation, which will go over. And, yeah, you just choose how much you want to mint. Usually people don't borrow up to the limit. They leave some sort of buffer because crypto is volatile. ", "start": 799.5571, "end": 865.0162}, {"speaker": "0", "podcast": "And you have to maintain more collateral than that in in your vault. Yeah. And it seems like it's a really good way for users to kinda, you know, like, if if I'm still bullish on Earth, I can still hold on to that earth, but just borrow against it, right? Mint that my. So my is almost like it's ", "start": 865.5086, "end": 883.16797}, {"speaker": "1", "podcast": "it's debt essentially is what it is. Right? It's it's access to liquidity for people that don't and sell their assets. Right? Because usually, people are very bullish on assets they hold and or or maybe they're not, but they've held them for a while and they'd like to not incur you know, a capital gains moment... Depending on what your jurisdiction you might be in, You know, this is just an added use case that you can use. To manage your accounting more wisely. ", "start": 883.6234, "end": 912.7991}, {"speaker": "0", "podcast": "Yeah. And so kinda like he said, So you have ten thousand dollars worth of Ether and you you put in the cheat out vault, you borrow seven thousand my against it. So it's like a seventy percent loan to value, ratio, but you're allowing on Ether. And so what happens if the price of Ether drops and ", "start": 913.43536, "end": 936.51685}, {"speaker": "1", "podcast": "how how the liquidation happen? Can we touch on that as well? Yeah. I mean, as we're seeing the price of the third can go down, It's not only up unfortunately. Yeah. But if if it goes down, you know, we have a decentralized and competitive liquidation system that allows people to come in and pay half of the loan or somebody whose fault has become risky, and in exchange take an equal dollar value of collateral plus a ten percent bonus. And that bonus is what serves to incentivize a liquid to go in and liquidate the all. So if you think about it in terms of net gains loss for the liquid numerator, you earn ten percent for the vault owner. You're losing about six to seven percent in terms of a penalties. It's not full liquidation. You don't lose everything. Now that's in Chi v one. In Chi v two, we've added an extra step. So let's say the price of Ether went down and nobody liquidate liquidity at you. And the price of Ether keeps going down, what what do we do, Right? So in in that case, we activate a second fall back mechanism that lowers the capital requirements to liquidate liquidity level. It essentially only you only requires you to repay the loan until the volt reaches a healthy ratio. ", "start": 937.6918, "end": 1022.0774}, {"speaker": "2", "podcast": "If effectively could lets you buy a a risky vault. So buy someone's bad debt. And this is only in very extreme scenarios, and we're talking when Say is under collateral, which could happen in out... I mean, many different verticals like Are maker her down if the the vault... Or maker now has auctions, but a vault could still be bought for, like, zero. I say it happened like a couple of years ago. Now these cases are not as extreme, but in protocols that give bonuses to liquid, If the vault or the loan is under a hundred percent liquidation reduces the amount of collateral, it doesn't increase it. So if you're at night in like, a hundred percent And there's a hundred and ten percent bonus, just gonna slowly eat into it and liquidate it and liquidate on stop, which can happen in different protocols, which leads to, you know, having no collateral or having Yeah, no collateral and a little bit of that, which is where, you know, safety modules come in. We want to reduce And so from our perspective, we wanna reduce the amount of work that the dow has to or interventions the dow has to do. And so this is where this other step can come in. So anybody, if there's a voltage that's you know, under collateral or just enough that the bonus won't help. They can basically assume the debt of that user. And now they have to maintain the the collateral to that ratio. But to assume the that they have to basically put in, like, thirty, twenty percent to bring it all the way up to the minimum collateral to debt ratio, which will be if in this case, it's like a hundred percent need to bring it up to a hundred and thirty a hundred and thirty five. So this is them purchasing the entire vault as opposed to or doing partial liquidation or my honors that So you understanding that Right? Because the lawsuit very similar still if you think about it. Because if you're a vault holder and you have a little bit more collateral than debt, I mean, your net value there is just that little collateral that's over. And so essentially the penalty is the same. Either in either a system. So for v two, is it the liquid have two options? They could do partial liquidation or the whole Vault? Is that true? Or they just have to purchase the whole vault? The they can't purchase the whole vault only under specific circumstances? Yeah. So In our cases, if a liquidation can't bring up the collateral to debt ratio, then bi is enabled. And that happens, let's say usually at one one ten percent. So... And this is much lower than, like, either because you know, our Cdr r's usually you are one thirty, one fifty. So if there's no liquidation and it keeps dropping. All the way to one ten, The moment it hits one zero nine, then somebody can pay twenty the twenty one percent ", "start": 1023.1285, "end": 1217.3933}, {"speaker": "0", "podcast": "and bring it all the way up. Okay. That makes sense. And when these liquid conditioners are liquid locating or purchasing these vault, they're using my to purchase that that debt essentially. Right? Or they're using my, which is then being burned by the protocol, which which is one of the ways that it helps maintain the peg. Correct? Right. Yeah. It's just repay loan essentially. Yeah. That makes that makes sense. And so what other mechanisms are in place to maintain mis peg, one to one with the Us dollar. I know there's a few of them. Yeah. I mean, we have we have a few systems all ", "start": 1217.7676, "end": 1253.3423}, {"speaker": "1", "podcast": "designed to keep the agency at the user level. As opposed to having, you know, a centralized actor like the Dow. So one one of them that we kind of pioneered was interest using interest bearing die to kind of stabilize the pay. So let's say that the value of My is increasing above a dollar. What we can do is we can increase the debt ceiling for interest bearing die. And obviously, people are kind of lever interest bearing die, because we don't charge interest. And it's like very profitable to lever interest bearing stable coins. We've not a lot of risk, right? Because ideally die doesn't peg a lot compared to, like, ethereum or compared to Btc that are much more volatile. So that brings it back down. Now if the pet goes too low, like below a dollar, then people can buy my the discount and then repay their loan and we will assume that the each mine is a dollar, when you repay your loan. And so there's a nice little arbitrage there. Where you can repay your loan at a discount. Yeah. That makes sense. And do do y'all have... I know you had the the anchor ", "start": 1253.8735, "end": 1323.3745}, {"speaker": "0", "podcast": "as well. Right? Like, you could I guess convert your mighty to Usd dc at any time? Yeah. Initially, that was one of our first implementations. ", "start": 1323.9897, "end": 1332.4229}, {"speaker": "2", "podcast": "This is prior working with kurt where we created a a Ps like basically a pe stability module similar to maker dials, where users could buy my from a contract and it it would only be done via stable coins. And basically just solve it back and forth. With a one percent fee. Now I... The contract is still there. Users. There's probably like a few thousand dollars in there. It is usable. But at the end of the day, we found more efficient mechanisms, particularly having strong stable swap on every chain that we're on, allows us to create better incentives for our users. Then if it's all controlled by the the protocol and then, you know, the the risks ", "start": 1333.948, "end": 1388.7728}, {"speaker": "0", "podcast": "that come from that And, yeah. While you're talking about like, having my on other chains, like, I I can only imagine, like, the type of logistics and developer coordinate that has to happen to bridge my to other chains or get my another change. Because, like, if you think about it, like, in my mind, my on Poly, and then you've got my on like, I know you're on solo. I like, the... To me, those are, like, two completely different assets because you have to take into account like the base layer protocol as well. So, like, what what kind of logistics and hurdles have y'all had to go through to bridge my to all these different chains? Do deploy your protocol natively? Or do you just mince the my on Poly and then bridge it to those other chains. Or a combination of both probably. At the beginning, ", "start": 1389.3912, "end": 1442.6174}, {"speaker": "2", "podcast": "yeah, there was a little bit of mint known Poly on and in bridging. Which is our, like, you'll you see some remnants of that in the phantom deployment. But in general, with we deploy our own contract on every chain. So if you think... Yeah, we deploy the entirety of two dollar at some point, but it's more of a stage process. So stage one will be deploying the stable coins, deploying the governance token. Then from there, we we provide liquidity on one side of a bridge. And so the idea of us controlling the canonical token on every chain. Gives us more control over... Okay. Tomorrow, we wanna to play vault, and we don't have to ask I don't know, ce bridge. Or Sea bridge to, you know, give us control over it because otherwise, they will be the ones mint thing into the vault, which it's a huge risk depending on why what could happen, you know, because it could be the official bridge here or there or All bridge or sea bridge or any swap. There there's a lot of bridges. And there's some that I probably haven't mentioned it. And so with that in mind, controlling the the canonical token allows us to then create swapping systems or I think we... We'll call it the the hub. And the hub allows you to swap your relay my or your Any my or whatever my. Into the economical mine... Up to a certain amount. So then we can control the the different bridges that we're on, and give them kind of like a specific amount a limit that they can swap into any chain. Which lets us ", "start": 1443.3314, "end": 1564.8092}, {"speaker": "0", "podcast": "build a more robust and multi chain system because now there's multiple bridges that you can use not just one. And how many chains are y'all on right now? Like, how many different chains do you have my deployed on? Twenty chains? That is a lot. ", "start": 1566.2268, "end": 1578.6937}, {"speaker": "1", "podcast": "Yeah. Were the most christian table? At least the centralized stable coin. So a lot a lot of deploying, a lot of ", "start": 1579.4115, "end": 1586.5181}, {"speaker": "0", "podcast": "bd, a lot of managing, but Yeah. Yeah. I mean, I think that's just kind of a testament to... Like you said, your team and the need for this asset in the crypto market in general. And so you, you know, y'all have scaled very quickly in terms of, like, daily active users, total value locked, total chains deployed, I guess, is another metric you could look at? Like, what do you attribute all that growth to? I think ", "start": 1587.1277, "end": 1612.9681}, {"speaker": "1", "podcast": "something that's very unique to cheat out versus other projects are focused on partnerships. Right? A lot of projects might try to build everything in house or, you know, by themselves. But I think, you know, we've done a lot to, you know, work with others and put interoperability first, like, we couldn't make our own interest bearing tokens or we could partner with Beef. Right, and use their interest bearing Tokens. We could make our Own bridge or we could partner with multi chain. Right? So with these different, like steps, we we create a system that benefits everybody for helping My. Right? So in Spooky swap or in Quick swap, you know, if you can commit My against quick, Right? Then quick stuff's is not gonna... It's gonna have an incentive to, you know, help promote my. Right? Because that means more people are locking up quick. And so if you do these different kinds of games in different chains, right? It's everybody's stable coin. It's not just like some ", "start": 1613.6797, "end": 1672.2744}, {"speaker": "0", "podcast": "closed system that you create. Yeah. Something that I meant to touch on, but I I forgot to when we were just kinda talking about general the protocol in general is that, you know, I think with die there's an interest rate that is charged. And when y'all, It's it's like a mint and redeeming fee. And so you don't charge interest on the my that is mint. Right? Just a redeeming fee. But yeah. Oh, just a redeeming fee. Okay. I thought there was a mint fee as well. So... I mean, you can pay me fee if you want. ", "start": 1674.0967, "end": 1704.47}, {"speaker": "1", "podcast": "I'll send me my dress out to. Yeah. ", "start": 1705.75, "end": 1707.6765}, {"speaker": "0", "podcast": "What why did I'll choose that model? ", "start": 1708.3905, "end": 1709.6597}, {"speaker": "2", "podcast": "Initially, I think it was more around looking at what can help build? A, I mean, the the most the best way to do it quickly. And we figured users as soon as they they take out like a a loan against their own values of against themselves. They're not gonna wanna pay back because the longer they hold it, the a cheaper becomes. If you hold it for a year, that's, you know, half five percent. You hold it for six months, that's one percent. If you hold it for three months, you know, that's four percent. So or two percent. So the shorter the loan, the more you're... And the more you're end up paying, So it drives for more long term usage of the protocol. And looking... I mean, with the math and it was like, around seven percent turn, which was providing enough fees to maintain the protocol anyway. So we didn't necessarily, need to go off the gate with the interest. Now, this slowly changes with the v two where we do add the optional of interest rates. And that's not something that we wanna do, like, all the time. But it allows us to sunset volts in a more efficient way. Initially, with the doubt, we we talked about maybe increasing Cdr r's to you know, turn off of a vault, but that can lead to front running and liquidation because, you know, you might have a vault at one thirty one. And like, it's one hundred thirty, So the moment it goes to one hundred and thirty one and it slowly moves up. You get liquidate. That might not be a... That wouldn't be a nice user experience and it would congestion of the network. So another aspect of C v two is we can turn on interest rates if we have a one that's turned off a volt, for example. Okay. And ", "start": 1710.5322, "end": 1830.344}, {"speaker": "0", "podcast": "so you can turn on it like, through governance, you can turn on interest rates. And is that, you know, does it... Basically, the user has the option to take the interest rate or choose the redeeming fee? No. So for example, let's say a collateral is no longer desired by the dow. Or maybe a certain vault specifically on a chain it's not desired by the dow. ", "start": 1830.723, "end": 1851.5396}, {"speaker": "1", "podcast": "How can you, you know, kind of push people to repay their loan will you start increasing their loan value. So they we have to pay both. Right? Like, your loan will keep increasing until you repay it. And when you repay, you pay your point five percent fee. Now, of course, like, sun setting volts is completely up to the dow. And so, you know, there may be different things that they dow votes on. They could vote to take out the repayment fee. I don't think they would because we charged so little. But, I mean, it could. Right? So it's all up to the dal how sun setting will work. We're just trying to give more tools to the dial. What other revenue drivers do you have to the protocol ", "start": 1852.6584, "end": 1890.2098}, {"speaker": "0", "podcast": "outside of the redeeming fee? And, I guess the potential interest fee if people... If governance wants to implement it. What like, what... Yeah, What other revenue drivers do you have? I mean, we provide liquidity to ", "start": 1890.8899, "end": 1902.2849}, {"speaker": "1", "podcast": "some lending markets and that produces interest revenue for the protocol. And then another one is deposit. So when you farm on our farms, the farms that give q, we give a point five percent re point five percent deposit. And through ag it's like Beef, right? We have that constant auto compounding, which gives us some revenue. ", "start": 1902.6649, "end": 1927.026}, {"speaker": "0", "podcast": "Okay. Interesting. And I remember, like, I I was hearing all in the discord Ama that y'all did last week. Was that last week? Cat was that y'all were positive, like y'all were net positive last year from a protocol revenue to expenses standpoint. Can you touch on that? Because I think that's... I don't think there's a lot of protocols who are doing that. ", "start": 1927.6775, "end": 1947.1082}, {"speaker": "1", "podcast": "Our first year. So right now we're, like, a year and a month, if you will. And our first year we made more money than we spent on incentives, which, you know, it's a pretty big feat, like, you don't you don't see that in a lot of protocols. And, yeah, I mean, even today our after, like, the whole, like, Us Fiasco, our price to earnings is to, like, under one. So I mean, it's pretty it's pretty remarkable. You don't see that even in traditional companies to have a p lower than one. Yeah. That's that is interesting. And so does the Dow benefit from this, ", "start": 1947.9056, "end": 1984.5201}, {"speaker": "0", "podcast": "I guess, net positive revenue? I don't I don't know if I wanna call it net income because it's a protocol and that's just... I don't know if that term necessarily fits. ", "start": 1985.4761, "end": 1992.3507}, {"speaker": "1", "podcast": "I mean, there are ways for the protocol to benefit from the influx of tokens, right? So if you're locking chi between a week and four years, you can get part of these this influx of tokens. And then, you know, at that's like thirty percent. Seventy percent is then kept in the Dow. For several reasons. What I mean, for pain payroll, for doing grants, incentives. And then, of course, in case anything happens, you know, the dow has a treasury to do things with if the dow votes to do things with that. ", "start": 1993.0696, "end": 2029.5101}, {"speaker": "0", "podcast": "Okay. So in this two token system, right, You've got my which is the stable coin and then you've got chi, which is the governance token. And you can, I guess that's similar to curve in the sense that you can lock up your chief for up to four years and but you also get the benefit of protocol revenue when you lock up your chi? And so how... I don't know, what what other benefits are there to locking up your cheek and who determines how, you know, are those I I'm assuming those are paid in chi tokens? And and who who determines the amount of of distribution. Is it the dow? So the dow has voted on you know, how much percentage to distribute ", "start": 2030.1093, "end": 2073.6824}, {"speaker": "1", "podcast": "to people that stake their g. I mean, one one thing that I would say is it's different for our governance compared to maybe curve is that, you know, whereas like in curve, most of what happens for the revenue generation is kind of automated, right? Or it's up to like, the protocol itself not really the doubt. She does very like hands on. So like, it's not like you just buy and stick it and then get part of the revenue. It's really like she holders are very active in making sure that we're successful we're making sure that we're bringing in a business. So that's kind of like a little bit different. Like, for example, we have ", "start": 2074.5334, "end": 2112.0576}, {"speaker": "2", "podcast": "a lot of community members who took it upon themselves to build out the alliances within some chains. Which the alliances is part of the partnerships are kind of a step further where community members are coming into say optimism. And they're rallying the troops so to speak to push for more incentives in optimism and to have more collateral and more debt ceilings in optimism to build a to build out that network. So it's kind of like different cells or tribes going in different chains and kind of pushing them up, which I'll gives more value to the overall system. And it creates a to community in different chains where now, you know, my can be more of a default asset asset for people. ", "start": 2112.3687, "end": 2159.9563}, {"speaker": "0", "podcast": "Interesting. And so on the voting power, like if I I guess it like, in similar models, like I lock up my g, for four years, I then get four times the voting power. Cannot can I also delegate that voting power to anybody or is that not an option in this ", "start": 2160.6077, "end": 2180.1953}, {"speaker": "1", "podcast": "instance? No. Yeah. You can you can delegate your voting power and you can revoke that delegation. You can also vote very recently now you can vote from any chain that she's on, which is pretty crazy. So I I think there's no other doubt that can do that. Like, vote from so many chains. ", "start": 2181.1255, "end": 2200.6704}, {"speaker": "0", "podcast": "Yeah. That's something I haven't really looked into is, like, how does that how does that message relay system work from chain to chain, do you? We're doing a lot of experimentation. I think ", "start": 2201.3103, "end": 2211.3105}, {"speaker": "1", "podcast": "we're learning together with Snapshot ", "start": 2212.02, "end": 2214.0383}, {"speaker": "2", "podcast": "on that because it's... Nobody has really tried that. They Snapshot has a limit for, like, eight strategies. Which effectively caps at, like, eight change. Well, you can hold t on, like fifteen. I think we put eleven on our strategy. And, yeah. We constantly get this these random errors of, like, could not calculate your score. But I think this allows us to kind of build at the forefront. In terms of delegation, just to be clear, I think we only do phantom and Poly for now because it requires a delegation contract, which hasn't been deployed everywhere as well as a sub graph, which the graph isn't everywhere yet. So random things. At the end of the day there, so there's a lot of aggregation for the signatures in the voting. That is done through least Oracle effectively Snapshot. ", "start": 2214.4172, "end": 2275.6357}, {"speaker": "0", "podcast": "In the future where wanna to execute through like No and safe app. But until then it's through Delegates who sign. Okay. Yeah. That was kinda leads into one of my next questions was, you know, is this governance on chain? Or is there a multi sig and how do you determine who the multi six centers are? And where I guess where in the protocol stack are those multi six? ", "start": 2276.8442, "end": 2298.1125}, {"speaker": "1", "podcast": "Right now, most decisions are made by people that have the government token and they vote on snapshot. And then those decisions are then executed by am. Made of all docs to people. Now the plan is to eventually roll out chain specific multi six, Right? With stakeholders from that particular chain. But it's a process. Right? This involves a lot of trust and in our organization. But like Paul said, the the the goal eventually eventually is to have everything through Safe snap. And completely like on chain, But that's that's a lot of ", "start": 2298.7476, "end": 2337.962}, {"speaker": "2", "podcast": "infrastructure that's yet to be built and a lot of these chains. The the way we walk towards that by right now, you you'll see a lot in our discord how we're creating processes. Because at the end of the the day, if a chain wants to grow. They might just, you know, mint the bunch of chi and provide incentives and put one collateral because they have a bunch of that one collateral. And that may not be conducive for a healthy system. So having steps and checks and balances for these chain specific multi six to grow, allows the system to grow healthy and create a very secure network of Cd networks. So by... That's what we're working on right now with the process you can call them like, standard operating procedures. And then we move towards more decentralized execution, with the backstop being a multi sig. But as we see with the bigger protocols that occurred on Avid, I'm multi sig the most efficient way, to relay messages across different chains. Yeah. Like that's that's just the way it is today, maybe in the future, it isn't. In the future, we can maybe run a cosmos chain that sends messages to multiple chains. Or snapshot builds a, you know, a system that can use, like reality dot io o oracle to execute on no is safe. But considering that it's Tb we move slowly by creating these operating procedures so that we can get people because if you can get twenty people to agree on something, that's a little bit like a consensus algorithm. Now more manual, but it can work for the time being. And create enough security to be able to build what we need to build today so that we can get to where we wanna be tomorrow Yeah. That makes that makes perfect sense to me. ", "start": 2338.7366, "end": 2462.0051}, {"speaker": "0", "podcast": "Well, this... Yeah. This is fascinating. And I think, yeah it's just something people don't really realize. Right? It's like, yeah, you can deploy your protocol another change, but like, there's so many logistical issues and hurdles that you can run into, like, you know, do you allow governance on those other chains. You probably should. Right? And but the structure is not quite there yet. I mean, we're definitely moving towards that multi chain world, and it feels like... To me, it feels like chi dow was probably the best positioned stable coin for the future of the multi chain world Is that something that's like An map or or Philosophy that you'll focus on is just preparing for the multi chain world? And, like, I don't know. What does that look like free y'all. ", "start": 2462.8005, "end": 2509.4172}, {"speaker": "1", "podcast": "I think it's a matter of not not like holding on to anything, you know, being really open. Maybe multi chain is the way. Maybe it's not Right? So so people when they go on Poly gun, right? They have the choice to go Poly, then if they put assets there, you know, that's kind of what they're banking on. And I I think, yeah, we are very well positioned as a multi chain protocol, long term. But, yeah, maybe the maybe it's the future maybe it's not, but we should prepare so that users have the option, right to to be on these different chains. ", "start": 2510.0698, "end": 2545.979}, {"speaker": "2", "podcast": "The optional, liquidity. So that's what we focus on. Like, there was a point when Phantom was doing these rewards and incentives and people started moving their money into phantom for the Tv stuff. And there was just no way to bridge from Say Paul... From Poly on two phantom unless it was with mine because it was the only one that provisioned liquidity on all the different chains. So you can just quickly mint in and out. But you it Usc die everything was dry because people were it using the network too much. And so that type of optional enables the users to work better. And it just happens that aligns very well with a multi chain strategy, which is Tb as we've seen because maybe a standalone layer one isn't as the best value proposition, but maybe it's a layer one connected to a company that's on ramping, like crypto dot com or finance or maybe a coinbase based chain. That could be the multi chain world. And so we we don't necessarily have the answers to that and that's where we focus more on the optional and the liquidity for you or to be able to freely transact between these different chains. I'm just kinda thinking of, like, recent things in the news ", "start": 2546.63, "end": 2630.1477}, {"speaker": "0", "podcast": "like what are y'all thoughts on algorithm stable coins? I would assume... I mean, I would just say that y'all experts in the stable coin space, definitely professionals in the stable coin space. But I don't know Like, do you feel like, you know, it's just like time and time again, these algorithm stable coin have failed. Right? You look at like, Iron Finance, like, Iron Titan was one. Was it beans stock one? Too. I I... That was like a flash in the pan for me. I barely remember that one. But what else what are your y'all thoughts on those in general? Like, do you think that there's a way that you could ever work? I I think it's something great ", "start": 2630.5266, "end": 2668.2566}, {"speaker": "2", "podcast": "idea in in theory, because creating a bunch of tokens out of thin air, and having systems in in place to maintain its value without having to have too much collateral. That's the whole idea behind what we talk about with these over collateral stable coins, where you wanna be able to have an value transfer. That's quick. And you don't want to be confined to the the fiat or like, pass it backed. So for purpose, it's a cool idea and in if it works if it worked well, it would be amazing. But unfortunately, we haven't seen sustainable systems that can grow at very large scale. Specifically because a lot of these algorithm stable coins take one kind of endogenous collateral. Which can... I mean, at the end of the day, it sort of works, but it's also a danger you're for those protocols. Because, you know, like, at the end of the day it's a little bank run, and it's very difficult for them to come back from that. At least with a Cd stable. If they're say bank, it it will just get bought up, you know, who doesn't wanna pay their debts at seven percent discount. So there there's always a point where people will buy my... To bring it back up to a dollar because they wanna pay back their debts and unlock their token. Because at the end of the day, that's what these... The my that's backing my out there for it. Somebody else's ", "start": 2669.2717, "end": 2773.6565}, {"speaker": "0", "podcast": "that decision. That makes sense to me. So, you know, we've got about eight minutes? I don't know, we could probably go over time a little bit if you all have time. But is there anything that I haven't touched on yet or haven't asked they all y'all all wanna touch on specifically? ", "start": 2774.285, "end": 2787.749}, {"speaker": "1", "podcast": "I guess, I I mean I I would talk a little bit about, like, we've talked about Dc. We talked about centralized stable coins. We're not trying to replace Usd dc and we're not trying to replace t, right? They they're very good stable. I mean, if you think about it, volatility is very low. So if If I'm holding like the stable coin use is not a bad idea. Where where the use case is different, is like mice not just to hold. It's not just a table coin within itself. It's also kind of like a lending platform. Right? Because you're having that leverage aspect. And so that's something that I would say that's different about my than the centralized table coins aside from its backing. ", "start": 2788.4656, "end": 2832.25}, {"speaker": "2", "podcast": "I think you're here. We can probably drop a call to action for any protocols I would like to work with us. We do work with a variety of protocols either directly or through our partners such as link generalized lending protocols or, like, isolated ones like Manhattan finance. So we... Yeah. We're always looking for new tokens, companies that may be building new economics or Game fire others that want to have a stable coin that can be meant through their governance token. Now barring, you know, liquidity constraints and risk we can collaborate with all to create more access for liquidity by with my. In your chain or in your protocol, we'll be pretty excited to work on that. ", "start": 2833.2197, "end": 2887.4856}, {"speaker": "0", "podcast": "Cool. Yeah. Absolutely. And that's... You know, I think when I kinda look around the ecosystem, I think, you know, the protocols and teams that do a really good job of differentiating themselves are the ones who differentiate themselves by the partnerships. That they're forming, which is something that y'all are doing. So I... Yeah. I... I've always been a big fan of that. Index coupe did a really good job of that and feel like Poly gon does a good job of that as well. So obviously, big fans of all... Those two protocols in Chi as well. And another question that I had, you know, you also have this other anonymous pseudo anonymous founder called la z, And I was just kinda curious like, why did that individual choose the name la z? And also like, the name chi? Q? Like, where does that name come from? Yeah. I mean, not not everybody in crypto ", "start": 2888.4546, "end": 2945.2456}, {"speaker": "1", "podcast": "likes to give out their identity, and so people choose pseudo names. Like, in Chi, we have a lot of references to da. That's where you get the name Chi da. Right? Because cheese like energy and dow is like the way of. Right? So that's kind of how C gets it's like, references and Lau is the most famous Da philosopher, and so it kind of fits the whole vibe. ", "start": 2945.6992, "end": 2972.1624}, {"speaker": "0", "podcast": "Yeah. That makes sense too. So what else on the map Are you y'all excited for from the cheat out perspective? ", "start": 2973.1338, "end": 2979.0999}, {"speaker": "1", "podcast": "Something I'm really excited about is having multiple interfaces for borrowing my. And, you know, through Chi v two, this is something that... And our partnership with Manhattan and finance. This is something that we're kind of opening up to more people. And so basically, today, you could come to us and say, you know, I wanna run a front end for these vault on this chain. And what we do is like, okay, you can vent it through our contracts and we'll give you some sort of fee, some sort of, like revenue sharing. And so that that helps out the the protocol doing the front because they get revenue, to get added of functionality on their website, more foot traffic. And us it helps because, you know, we're getting mine different places. What about you, Pablo? But I'm really excited for this. ", "start": 2980.0686, "end": 3025.1184}, {"speaker": "2", "podcast": "These decentralized front end. But also the the more automation we're introducing to a system. And I say automation but in a way that everyone can be the executor of these activities. And we'd be rewarded as such. So those two things are really exciting because then there's no front end to take down because there's so many and everyone since is incentivized to run it. And there's very little management to be done other than, you know, tracking. Once we're fully automated, and users are incentivized device to call the function, then it's a matter of keeping track of, you know, activity and putting time locks in. So it's gonna be... It's pretty exciting the next six months, what it... What's gonna happen with the two us, we continue to deploy more collateral and ", "start": 3025.8376, "end": 3084.8374}, {"speaker": "0", "podcast": "create these front ends Yep. And I've got two more questions for you guys. The next one is... I mean, I think it's safe to say that we're in a bear market right now. It feels like we're in a bear market. What what's it like to build in a bear? Because I feel like y'all were born in the bull market? And now we're in the bear and we're building, like, just kind of like the differences ", "start": 3085.5273, "end": 3107.2722}, {"speaker": "2", "podcast": "between those two. Our careers in crypto, This is not a first bear in terms of our careers in crypto. Now the best time to deploy is a bull market because you're able to sidestep step a lot of the the growth pains at the very beginning, you know, getting your first step of users, be able to iterate and be able to get partners quickly, you know, In a bear market, no one really wants to partner unless you're like well known because of who who are you, you know, especially if you're slightly nylon, it could be complicated. So pretty happy with having started when we did. With this stir market, it's gonna be... Well, as Benjamin mentioned earlier, we're doing okay in terms of revenue. And so we... In the foreseeable future, I think we're we're doing pretty pretty well. And so now we wanna share that one with what we previously with the front ends because now other users, other people can build up with what we created so far and make a living by my painting front ends. ", "start": 3107.6511, "end": 3187.492}, {"speaker": "1", "podcast": "Yeah. And and bears come in Be go, I think it's important to maintain your, you know, your ideology, right, around crypto and its place in the world. Right? Like Paul said. I mean, most of the time I've been in crypto and building crypto has been there. So I'm very I'm very familiar to building in a bear market. And, yeah, Like Paul said, amazing that we started building the the time that we did. It really helped give us some sort of credibility. So now that there's, like, the bear market, we can go to other projects and keep doing the partnerships that have caused us to succeed so far. Regarding them being, like, who who are you? You know, and why why are you reaching out? Yeah. Happy to keep building. Because I I know it's gonna ", "start": 3188.305, "end": 3231.2544}, {"speaker": "0", "podcast": "continue having adoption. The bears were the new financial primitives get borne from a def device point and y'all are doing just an incredible job over there. Love the protocol. So, yeah, Last question for you all is, you know, where can people go to find out more about the two of you and C. ", "start": 3231.6294, "end": 3247.2627}, {"speaker": "1", "podcast": "Yeah. I mean, if you wanna learn more about C, my thought finance they said great place to start. We have very comprehensive docs, and we also have a community guide that's made by the community in, like, nine different languages. If you don't find your answers there, we have a discord, which is linked on our Tutor, it has cheat out q da a o protocol. So Yeah. And then for us, you know, you can find us on the discord and the telegram on on Twitter, lurking about ", "start": 3247.9011, "end": 3278.501}, {"speaker": "0", "podcast": "Awesome. Yeah, everyone who's watching on Youtube. Thank you for watching. If you're listening on spot or Apple podcast podcasts, Thanks for listening as well. This has been a great time. Thanks, Ben, Pablo, and I'll catch you y'all all next next time. ", "start": 3280.9294, "end": 3294.3296}, {"speaker": "1", "podcast": "You. ", "start": 3295.5247, "end": 3295.684}], "summaries": [{"title": "1. The Importance and Challenges of Stable Coins in the Crypto Market", "summary": "This text is a summary of a podcast episode where the host interviews two core team members of the C stable coin protocol. They discuss their backgrounds and how they got into crypto. The author shares their experience with Bitcoin and their realization of its potential in the financial system. They discuss their journey in the crypto space, their collaboration with companies like ConsenSys, and the importance of stable coins in cross-chain applications. The author also discusses the different types of stable coins, the importance of collateral, and the security of stable coins backed by digital assets. They emphasize the need for transparency and highlight the benefits of stable coins in facilitating transactions and promoting growth in the crypto market."}, {"title": "2. Understanding Borrowing, Collateral, and Stablecoin Systems in Ethereum", "summary": "This text provides information on various aspects of borrowing and minting cryptocurrency on the Ethereum blockchain. It explains the process of locking up Ethereum in a vault and minting a specific amount of cryptocurrency. It also discusses the role of debt and liquidity in asset management, as well as the risks and mechanisms involved in borrowing against cryptocurrency assets. Additionally, it mentions the mechanisms in place to maintain the peg of a cryptocurrency to the US dollar and a decentralized stablecoin system that uses interest bearing die. The text concludes by mentioning the initial implementation of converting digital currency to USD."}, {"title": "3. Building Efficient and Incentivized Stablecoin Modules for Cross-Chain Swapping", "summary": "The text discusses the creation of a stablecoin module similar to MakerDAO, but suggests that more efficient mechanisms, such as strong stable swaps, are available. The author emphasizes the importance of controlling the canonical token on every chain to have more control over cross-chain swapping. They discuss the logistical challenges of bridging assets to different chains and suggest a combination of deploying the protocol natively and minting on one chain and bridging to others. The text also highlights the growing popularity of stablecoins and the need for a more robust and multi-chain system. The author emphasizes the significance of partnerships in project development for interoperability and mutual benefits."}, {"title": "4. Loan Repayment, Revenue Drivers, and Governance in Financial Protocols", "summary": "This text explores the concept of loan repayment and the potential for increasing loan values to incentivize borrowers. It also discusses the possibility of a repayment fee and the decision-making power of the governing body. The text emphasizes that loan sunset and repayment fees are determined by the governing body. Additionally, it mentions the goal of providing more tools to another entity and asks about other revenue drivers for the protocol."}, {"title": "5. Financial Success, Revenue Models, and Stakeholder Involvement in Protocols", "summary": "A company in the protocol industry achieved a net positive revenue to expenses ratio, a rare accomplishment. The company's price to earnings ratio remains below one, which is remarkable. The text discusses the benefits of locking chi tokens in the protocol, with 30% of tokens distributed to those who lock chi for a certain period. The protocol utilizes these funds for various purposes. The text also discusses the two-token system and the active involvement of stakeholders in the protocol's success. Community members are working to strengthen alliances and partnerships within blockchain networks, enhancing the overall value of the system."}, {"title": "6. Voting Power, Decision-Making, and Challenges in Multi-Chain Governance", "summary": "The text explores the concept of voting power in similar models and the possibility of delegating that power. It discusses the challenges and limitations of using Snapshot for delegation and voting strategies. The text also raises questions about the governance structure and decision-making process in blockchain governance. It highlights the need for processes and checks and balances for chain-specific multi-sigs to ensure a healthy system. The text discusses the logistical issues and lack of proper governance structure in a multi-chain world. It suggests that being open and adaptable to different chains may be advantageous for users. The importance of optional liquidity in a multi-chain strategy is also discussed."}, {"title": "7. Exploring Algorithm Stable Coins and Collaboration Opportunities", "summary": "This text discusses the challenges and failures of algorithm stable coins, questioning their potential for success. It also explores the concept of over collateral stable coins and their difficulties in maintaining value and scalability. The use of endogenous collateral in algorithm stable coins poses risks similar to a bank run. In contrast, Cd stable coins have the advantage of being bought up at a discount, incentivizing debt repayment and stability. The text also introduces a stable coin called \"My\" that serves as both a stable coin and a lending platform, offering leverage to users. The author's company is open to collaboration with different protocols to expand liquidity access, as long as there are no liquidity constraints or excessive risks."}, {"title": "8. Navigating Crypto Markets, Learning Resources, and Building in a Bear Market", "summary": "The speaker in this text discusses the challenges and opportunities of starting a career in crypto during a bear market. Despite the current market conditions, they remain optimistic about their revenue and future prospects. They express their determination to continue building and forming partnerships in the crypto world. The text also discusses the importance of adoption in the financial primitives market and the significance of partnerships in differentiating protocols and teams. Additionally, it mentions the use of pseudo names in Chi culture and the excitement of offering multiple interfaces for borrowing through partnerships. The introduction of decentralized front-end automation is also highlighted as a way to increase user participation and rewards. The author seeks insights on building during a bear market."}]}