{"podcast": {"title": "Polygon Alpha Podcast", "host": "Justin Havens", "image": ""}, "episode": {"title": "Building with the ERC-4626 Standard | mStable | Dimitri Goleko", "number": "7", "date": "JUL 20, 2022", "description": "", "url": "https://www.youtube.com/watch?v=15xrqqAnGMY", "speakers": {"0": "Justin Havens", "1": "Dimitri Goleko"}, "file": "july20.mp3"}, "transcripts": [{"speaker": "0", "podcast": "Hello one. Welcome to the Poly Alpha Podcast. This is where the Poly gun community gathers insights from today's leaders into centralized finance and Crypto. I'm your host, Justin Havens, aka Crypto. Let's get started. On today's episode Poly on Alpha, we are joined by Dm dmitry, who is the product manager at M stable. Meet you, thanks for being here with us today. How's everything going? ", "start": 0, "end": 30.092047}, {"speaker": "1", "podcast": "Thanks for inviting me. Yeah. It's going very well. Well. Thanks. Yeah. Staying busy in the bear market. I'd imagine. Yeah. Yeah. We're we're building quite a lot right now. The bear market allows us also to time to focus a little bit more on our core product. Yes, the weeks are just really busy. A lot of meetings, a lot of discussions, a lot of brainstorming ideas just flying by that need to be discussed to be validated. And yeah, it's super interesting right now to be actually in crypto ", "start": 31.04659, "end": 58.685143}, {"speaker": "0", "podcast": "despite the price being down. Yeah. It's always interesting that to stick around during bear markets. I mean, I I got into the space in twenty seventeen, had a bear and I was, like, kinda of paying attention, but, you know, not really, just really just trying to keep up with everything. And then, you know, by summer hit, and then I was I was right back into it and then obviously, the the top blue off with Ether going to over four thousand and Bitcoin going to sixty nine, which is a hilarious meme number. And then here we are back again. So Yeah. But, like, what's your story? Dimitri, like, how did you get into the Crypto space? ", "start": 59.312683, "end": 96.59889}, {"speaker": "1", "podcast": "Yeah. I think my story is actually kinda similar to yours, to be honest. I also got into Crypto two thousand seventeen when the big bubble was around and that's the first time I ever bought Crypto. But it always was an exchange or something like. So I didn't really invest it because I thought it's something cool to be on Right? It's just how the price goes up. I want to invest something. And at that time, I did make some money, but I didn't sell anything, so it went down all the way back and I was left with, let's say, couple of thousand dollars. Right? So it's like not much not much. But I never forgot about crypto and I think the key moment was when Actually joined crypto again in a more broader fashion just before d defy summer. So I went to crypto conference. I was, like, really small gathering, like, in the city that I I couldn't stay in. And I was, like, one to he just showed me die, and I already knew die, but it was like, okay, Why would I use a stable coin. Right? What's the point? It's like, I can mint it, but then it stays in the ethereum and what do I do with it? Right? But I didn't know components existed. So I They gave me five dollars worth for Fu ethereum. I swapped it for for die, deposited in compound, and I was watching my balance on my phone increasing in real time. And that was the moment I was actually like Wow. You can actually do stuff in crypto on the ethereum, there's so many things that you can do. And that account that I used to swap also got layer at the uni swap air drop. Right? So that was like a really good experience. And from then, I was getting more and more curious about what what else I can do. And that's when I also divide summer hits with a lot of different tokens with a lot of different products. And yeah, I was just really exploring in the beginning. And then later, I was really wanting to be also involved in some kind of capacity with crypto, because the more you do it, the more you feel you want to be part of it. I felt Crypto is really a nice community to be actually not just observer, not just user, but actually something to be more involved in. And that's when I got also in touch ends into this cohort a few ones and one was one was m unstable. Right? So I got really engaged in M stable this discord helps people around, put some governance proposals up and that pretty much gave me my first two hours per day during the weekday kind of small position. Right? So I was helping off with governance. So small thing. Right? But that transition then to part time. That transition then to full time and that full time rule then transition to me being what I'm doing right now being a product manager for Stable. ", "start": 97.55758, "end": 259.7311}, {"speaker": "0", "podcast": "So I never sent any Cps for any job complications in that sense. Wow. That's amazing Yeah. Just really just based on merit in the work that you've put in? That's that's really exciting. When did you go full time at him staple officially. I think was last year ", "start": 260.62436, "end": 276.32068}, {"speaker": "1", "podcast": "April. I think it's now over a year that I'm actually full time crypto. And what's what's the history of m stable? ", "start": 276.95343, "end": 283.0152}, {"speaker": "0", "podcast": "When did in stable get started? Was it in twenty seventeen? I think that it was. Yeah. I think Said it was one of the earlier protocols. ", "start": 284.05206, "end": 292.305}, {"speaker": "1", "podcast": "Definitely something before def device summer before even that whole field farming thing was a big deal. But of course, I can know much different capacity to the value proposition was a different one than what we are doing right now as well. The team was also slightly different. Of course, second crypto, people get to a point where they need to rotate and they need to switch positions or you know, it's it's a it's difficult to stay in in encrypt for a long time, sometimes, Right? So, yeah, the Fc sleep was quite old. And Fc launched as a a protocol that's created meta assets. Right? So Saver was just there to abstract away the complexity of having multiple stable coins into one unified stable coins that can be then used for other things. Right. The first iteration of m stable was also slightly different than what we have right now with the M assets with our Mu. And yes, since then it expanded to not just m mu but then also Mb became a thing as well at a later stage And the idea was to abstract more and more assets away for the user to make it simple. Right? So the use don't have to worry whether to hold die or Uc, they could just hold Mu or use m mu because underlying, it's exactly that. Same thing that they can just use. ", "start": 293.81433, "end": 381.44058}, {"speaker": "0", "podcast": "So initially, it was, I guess, creating a a stable coin that is collateral by a basket of stable coins to kinda hedge your risk against one of those stable coins going belly up. Is that is that pretty accurate? Yeah. Yeah. Exactly. So that was the initial idea. ", "start": 382.15842, "end": 402.53384}, {"speaker": "1", "podcast": "Abstract complexity away, but also it was supposed to be a risk minimized stable coin. That got later also a little bit different perspective from a different light. Because with the underlying Am structure, it would also mean that once somebody swaps, they could actually swap and swapped the asset that is trading at the discount into the basket. So there are two components to to Mu. Right? Is the Am. That is the the the stable swap Am from curve. With a slight difference. So instead of just allowing free swap, free swap, there is a min weight and there is a max weight. Right? So as soon as one asset is above, let's say, at this point, it's fifty percent. So as soon as it's is in a basket it's above fifty percent. It won't allow to swap anymore of that asset, right? So in a sense, it will protect you against the deepak of one of those assets because the basket would never hold more than fifty percent of that asset. Right? But at the same time, you're exposed to four different stable points and it would also mean that the you expose yourself to the risk of multiple assets at once. So that's why this whole concept of M assets was initially a very interesting one. And then we later thought that this was probably not the best use cases for those assets. Because it ended up to be something else at what we anticipated actually. Right? So Mu later that was like last year or when we launched actually also like, the safe product. And the safe product was like another part of the whole and and use the portfolio, right, of of the whole product. So anybody that admits Usd can put it also in this... Into the safe contract, and they would earn yield on it. So that yield comes from other end compounds and some swap fees as well. So whenever somebody swaps using the the Am, they would generate some fees and that would go to the savers. So this allowed us actually to create, like a really compelling savings product. And that's actually what Mu was then useful for. Right? So Mu was like did ", "start": 403.49097, "end": 553.69226}, {"speaker": "0", "podcast": "used the gain traction in a sense that it became the asset to earn yield. I guess you kinda you kinda slightly pivoted a little bit. Right? I guess the... I guess you were originally trying to take away the complexity of this... I guess, choosing which staple coin to utilize. And then instead, you then became more like an interest bearing protocol. Right? Not that you were doing any you weren't upgrading any contracts necessarily, but you did create, like, I guess, like, a separate module for users to save. Correct? ", "start": 554.7061, "end": 588.92236}, {"speaker": "1", "podcast": "Safe was actually part in the very beginning as well, but it was never the dominant part. It was never supposed to be actually that important piece that it is today. Today, it's like crucial to end Usd that we have actually a safe contract because that's what we feel got actually market traction. So the beginning say for something that was alongside there to allow to earn interest on that asset. Right? But in the beginning, it was pretty much the risk minimized, stable coin and the easy to swap in and out from that asset. That was the way may focus. ", "start": 589.7314, "end": 625.47504}, {"speaker": "0", "podcast": "Okay. I know and I know y'all are pivoting away from the m assets a little bit, but I still wanna, like, touch on in usd a little bit because I still feel like that's gonna be an important part in. So, like, how would, like, what are all the different ways that a user can I guess, get m Usd? So there are different ways. ", "start": 626.19507, "end": 647.315}, {"speaker": "1", "podcast": "Probably the easiest way would be just to go to the M unstable app And then there's literally like a swap tab. And whenever somebody swaps into Mu, let's say they want to deposit Ut, Use t, die or s into mu. They would literally just mint mu. Right? So they would send that asset into the basket and get and unused the issued. So that's one way with directly through the native app. The other way is you could also swap it in on curve. So there's a pool, and an Mu pool that is paired with the free curve cool. ", "start": 648.195, "end": 686.66797}, {"speaker": "0", "podcast": "Okay. And so you were also recently unstable recently got Usd listed on coinbase base. Which is a great achievement. Congratulations. Yeah. That's that's good news. What is what does that mean for m stable the protocol? Like, how how important is that to you ", "start": 687.6212, "end": 705.6104}, {"speaker": "1", "podcast": "in unstable in the community. So I I think it's more important to have it like, to to have a listing on Coinbase is from a narrative, I think, very important. But from the asset itself, it's it's important in a sense that when M mu is Outside of the safe contract, it actually generates a yield that is more than the users would just generate themselves. Right? So let's say, I deposits, I I made one Mu, but I don't deposit that I'm used in into save. What happens is that the underlying that I used to create the Mr is still generating a yield, but that yield goes to save. To the safe contract deposit. Right? So when there is M used the anywhere outside of the safe contract, it generates a yield still for for the savers. So if it's traded on coinbase base, then the Mu deposit on coinbase base means then the Mu is not in a safe contract, so it actually earns yield for the safe users. So they benefit. Similar thing happens also with curved, like, if Mu these deposited into the curve pool, that underlying still earns for the safe users. So it allows us to have a slightly above average yield. Coming to any savers at the deposit them used into the contract. The other side is from other perspective, What does actually mean that Mu listed or coinbase base. So that would mean that people can just swap, let's say, Us for Mu on coinbase base. And by itself, it actually doesn't add much value. Right? Because in order for Mu to have value, people need to actually to withdraw back to the voltage and deposited to save because then they can only healed. So To be honest, I don't think it actually added so much benefit for us having mu listed on coinbase base. Because in the end, it did generate like, let's say, a better heel just because Mu was outside the bus outside of the safe contract. But the use cases for just trading Mu on coin base, they quite limited because Mu is only powerful in d fire. Actually in the d ecosystem. So that's when mu is actually useful. So I think and you can already create mu ", "start": 706.07855, "end": 850.61035}, {"speaker": "0", "podcast": "just by having those two options that I outlined earlier. Yeah. I think you brought up a really good point it's something I thought a lot about as well. And it's that it's so interesting for me to see assets that are listed on coinbase that I don't know, really have, like, no business being on a centralized exchange because the value that those assets have, those tokens are really from the on chain utility that they have. And Mu being one of those. And I think, like, even something like curve, right? I mean, curve is that the Cr token is purchased to be stake, so you can get those rewards. And I I don't know. It's just it's just so interesting to me. But I think, you know, if someone is like, new to the space and they're trying to get exposure in certain assets. I guess that can be interesting. But yeah, I kind of agree with you there. Very big from a narrative perspective and it maybe even gets your name out there a little bit from a protocol standpoint. I used to be able to say that you know, if coinbase lists you then I think people can start taking you a lot more seriously, but then I think you kinda look at some of the assets that Coinbase has been listing lately and that's probably just not necessarily the case anymore. ", "start": 851.30396, "end": 924.2543}, {"speaker": "1", "podcast": "Yeah. Yeah. Totally. I think the more interesting use case would be if Mta was actually listed on coinbase base because that's the asset that you would probably trade like that would generate at least some kind of price discovery on the centralized exchange, which is quite important to have a chain link Oracle as well, right? ", "start": 925.52936, "end": 943.69495}, {"speaker": "0", "podcast": "That would be interesting use case? Yeah. I mean, do you feel like there's any benefit in being able to exchange Usd for Usd dc on coinbase base, it from, like an ability to maintain the the bag the peg better or have just more liquidity in general? Like, is there a benefit there? Yeah. That there's definitely benefits like liquidity is obviously one. Right. ", "start": 944.5836, "end": 966.3716}, {"speaker": "1", "podcast": "Also, whenever whenever there's an asset listed on a centralized exchange it generates volume, and that volume is also beneficial when you want to have changing Oracle for a particular asset because then the price is less. Right? But the thing is with Mu the... It it holds it pack really, really easily. Right? Because when there is, let's say, when and uc trades anywhere above the pack, you could just mint more Mu and swap it out for that asset that you used to mint it with. Right? The other way around if it trades below the pack, and anybody can just use the a byte that Mu and get the asset the underlying assets out. Right? So there's no, like there's no mechanism that relies Mu to be packed, like the architecture of Mu already itself is self correcting. ", "start": 967.90466, "end": 1019.7145}, {"speaker": "0", "podcast": "Okay. Yeah. And with Usd, yeah. Right? It's a basket of stable coins. And let's say you've got just... I forget what the breakdown is currently. How many assets are are underlying the stable coin? I guess it's my first question. ", "start": 1020.5245, "end": 1035.9403}, {"speaker": "1", "podcast": "Right. So on May net it's four, and on poly it's free. So on main, it's die, Uc Uc and s uc. And on Poly, it's the same but no Usd in the basket, So there's only three on Poly. So what happens if ", "start": 1036.8972, "end": 1052.5566}, {"speaker": "0", "podcast": "one of those four underlying stable coins on magnet net goes to zero. Does... I don't know. Does the m mu usd stable coin lose twenty five percent of its value, what what happens there? ", "start": 1052.9342, "end": 1067.9326}, {"speaker": "1", "podcast": "Okay. So because it's an Am am, it will likely be used to swap assets as well. And when one asset trades below the pack, it will be very likely that's that basket like the M used And will be actually used to arbitrage starter away as well. So what ends up happening is that the Am or the Mu basket will be over overexposed to the asset that trades below the pack. And that can happen up until to the max weight. And the max weight is set to fifty percent at this stage, but it's changeable. Governance can change it. And so that means that fifty percent will be exposed to that asset that pot that chicken can fail. The other will be still collateral. But, yeah, that's why I said that this the system that you can just swap an asset out, and you just leave the basket with the asset that trades below pack. That makes it slightly less risk minimized. Because in that sense, the basket itself would accumulate the risk. But that generates a lot of swap volume as well. So when there's a lot of volatility that generates a lot of swap volume and that's what volume is really nice for the safe rate. Okay. Yeah. That just kinda goes back to the, you know, hedging hedging your bets on on stable coins as well. ", "start": 1068.8229, "end": 1148.567}, {"speaker": "0", "podcast": "So almost having, like, m being like a safer alternative to all the the four underlying stable coins that are I guess, under... That are supporting the m Usd asset. So that makes sense. But, yeah, But y'all are also transitioning away from m assets. So but let's talk about that a little bit. Like, it is are m Usd and m, are they going away? What's going on? You know, what's new with m stable these days? ", "start": 1149.22, "end": 1182.3262}, {"speaker": "1", "podcast": "Alright. So those assets that don't go anywhere. Right? Because the contract is already on maintenance net. They are deployed. They work as intended, and they will continue to work. But what we realized actually and that's what I was telling you in the beginning as well. That Mu is very useful for earning a yield. Right? So the majority of users would actually use Mu usd in order to then deposit in into save. So they can earn yield or into curve, so they can earn yield as well. Right? So that's kinda like what we thought about our V two as well. So when there is no particular good reason to have this additional step of creating an m asset. Just so you can deposit it and then somewhere else to earn a yield? Then why would you then make your users create that as the first place have this complexity of the smart contracts there to go that actual step, while Defy and the majority of users they want to do something with their assets. They want to have their assets to work for them. Right? So in the end, they want to deposit it somewhere and into earn yield on those assets. While there are other assets that function really well as a he as money. Right? Uc is, like really good example that works really well. And when when there's, like a lot of these kind of stable coins and we had like a lot of stable coins during the last markets peak, there were like tons of there. And it became really, really clear that stable coin is like really crowded place. And stable also something that requires a lot of capital to keep the stable coin having value in the market. Just example, f spends a lot of money or they spend a lot of money to just continue continuously bright. So they would actually increase Tb and they would actually increase also the the the the market usage in yeah, in Defy. So once you hit the threshold where I think f it hit like, a really interesting threshold once they hit that, that they become so dominant in the market that they don't have to spend that much anymore to keep themselves valuable to the market, then that's something that they achieved and then they can seek out to have other use cases for the stable coin. But during the big markets when there was, like, a lot of these stable coins, a lot of them didn't have any use cases and that's why we don't have that many anymore. So I find it's very interesting how the market creates a lot of assets. And then once the market collapse, a lot of those assets ", "start": 1183.4574, "end": 1342.1891}, {"speaker": "0", "podcast": "disappear. Yeah. It can be very, very crowded in the stable coin space? And, like, how do you feel like m Usd and m btc for that matter? Like, how do you feel like those assets, differentiate themselves from, you know, W, ren Btc, f, Usd dc, my... Like, how how do y'all differentiate yourselves? Like, what is the true benefit compared to other stable coins in your opinion? It comes really down to where and how much is the asset actually used somewhere. ", "start": 1343.2988, "end": 1378.8038}, {"speaker": "1", "podcast": "So when you say die, I think that is like such an asset that is so ingrained into so many products that it's actually has a lot of use cases. Same with Uc. Like those assets, they just generated like an ecosystem around them. So I think for any stable coin, it's important to create that ecosystem. And until there's that ecosystem, that's where the kinda incentive game come come in. That's where they need to incentivize in order to get to a stage where a lot of protocols will actually use that asset to integrate something or to create products around it. So that's why I think it's like, very difficult to played that same game. Right? And that's why we decided also to shift to our better intervals. On the subject of... ", "start": 1379.9199, "end": 1424.897}, {"speaker": "0", "podcast": "Meta vault. You will be leveraging the four six two six standard four token vault. Can you provide our audience a little bit of background on the four six two six standard and how does stable plan to implement that? I think four six two six is a ", "start": 1425.95, "end": 1442.2767}, {"speaker": "1", "podcast": "super interesting standard, to be honest. There like four six zero six by itself, it's a standard for a yield bearing token. Okay? So by itself it's like, okay, what what is it your barry token? So a here token is any token that you could use to accumulate another token? Let me go back to standards and just explain why standards are general important. I think that's like a really interesting conversation by itself. D defy and comp comp is so key to what we're are building. And the very important standard that we everybody knows is probably Es c twenty. Like, without that standard, there wouldn't be many of the products that we use yeah, today, defy because there was no one standard that all tokens would function the same way. Right? So Es twenty is just a token standard. And without the Twenty, there wouldn't be probably a uni swap because every token, everybody who creates a contract can pretty much create the contract, however they want to. And so they could actually create functions that that that would... Yeah, that that would have a different name, for example. In the twenty, you have a function called balance of. Right? And you can literally input the the address, and it would return you the balance of the the address that you provided. If you will change that if you would save balance of user, that brings comp comp. That means that every contract that once the integrate that one token needs to be aware that this function, this particular one function needs to be called differently. Right? So that's why Es twenty once it came around, Uni swap was created just because every token had the same interface every token function. In a similar way and could be called with the same functions. So that's Es twenty. Ns as Es seven twenty one, I think that's also a really important one because that pretty much standardized how N entities work. And the interfaces and and the functions how n entities can be called. So that also created like a really huge space that all the N nfc suddenly could be incorporated into one marketplace. So that's the, I think the important standards. And then E c four six two six is also a very important standard because that actually allows a standardized way of interacting with yield bearing tokens. So when you deposit right now, when you use Abe, you deposit on the other interface, you deposit a token and you could back an a token. Right? On compound, if you deposits another token. You get back a seat token, but both work differently. Right? They have different functions. They like every time you want to integrate them, you need to integrate Abe and separately because you need to call different functions, you need to calculate things differently, Right? Because there's is no standards. So E c four six two six exactly creates that one standard. So that Every time you interact with something that is yield bearing that is four six two six, you can be sure that these are the functions you need to call to deposit these are the functions that you need to call you want to withdraw something. So it d how smart contracts were together. So it's extend... It's actually an extension of Es twenty. So it still has all the Es twenty functions, plus it has all the deposit, the withdraws, the converter shares, the convert to assets function. So you can be sure that those function the same way. And I think one one example is also that Mu itself is actually using Abe and at the same time. So some assets like Usd, when you meant m mu. Uc is deposited into compound, while the others like die and Uc is deposited in Abe. And because they function differently, there are two different contracts that needs that handle that exact communication with those with compounded and Abe. With four six to six, ideally, down wouldn't be necessary. If fifty four six six to six, there will be one contract that ", "start": 1442.6683, "end": 1688.03}, {"speaker": "0", "podcast": "has an a defined interface, and that would then be used to integrate any that can be compatible before six to six. I did. Yeah. Thanks for that overview. Yeah. I think it's important for people to understand too, and I don't I don't know if a lot of people know. Maybe the people who are still here in the bear market understand this concept. But when it comes down to it, like, your... The tokens that we have on Ethereum, they're just smart contracts. Right? And when you have a E twenty compliant token. That's just really a smart contract that adhere to certain token standards that help with comp comp. Right? Is essentially what you're saying. And, yeah, this four six two six standard is incredibly important because just like you said, Has its interest bearing token, compound has its... Interest bearing tokens, and it can make things a little bit difficult for developers when they're building products that want to leverage these assets in this comp comp. But I feel like the... I mean, obviously, this is better for the long term benefit. Absolutely. But are we gonna see, like, and you might not know this. I'm just kinda thinking out loud like, how do you think compound and Ave would implement that four six two six standard. I know Ave just came out with v three. Do they have to change their... I mean, do they had now have to come out with v four? To catch up with four six two six and and, like, what about compound? Do you have any ideas or thoughts on that? ", "start": 1688.65, "end": 1785.7198}, {"speaker": "1", "podcast": "Good question. I I don't know about their plans when it comes to four six to six. But at end, I think compounded Abe kinda created their own little small standards. Because compound was for a couple times, compound, yeah, Ra fork compounds iron the Iron bank or like cream for compounds. So they kinda created its own kind of small universe of the c standard as well. Which never is actually standard. But that's that's how comp was also achieved there, But I don't think they have to integrate it. Like, they could, of course, and that would definitely help with comp and defy in general, but they don't have to. That's that's the beauty of smart contracts. Those contracts that they have that can be wrapped in contracts that are for six to six compatible. So it's like a in between contract that would sit in the middle that would still allow the functions to be called Y four six zero six, But then map them exactly to what that would mean in compound or in Abe. Right? And there only needs to be one of those contracts. Because once there's one rep contract, then that would allow any other contract to be also using that in a standardized way. Right? Exactly. Just like the ", "start": 1786.9894, "end": 1865.4236}, {"speaker": "0", "podcast": "version one of Crypto punk, you know, if you want those... Yeah. They did not add adhere to the E seven twenty one standard. So you sent that ask asset to a wrapper and now you've got the wrapped v one crypto punk that add adhere to the seven twenty one. Standard. ", "start": 1866.6757, "end": 1883.204}, {"speaker": "1", "podcast": "Exactly. And then you... And then you can trade it on open suddenly. Right? Which you couldn't do before. When I hear the word vault ", "start": 1883.8391, "end": 1890.055}, {"speaker": "0", "podcast": "in a d five sense. I immediately think of, like maker and C a from from the sense that, you know, you create a vault you put your assets in the vault and then you can die or my against that vault. So kind of like a collateral mechanism. But that's not how the meta work in unstable necessarily. Is it like like, what are the meta that y'all are like, yeah. How is this being implemented? ", "start": 1891.0024, "end": 1920.3533}, {"speaker": "1", "podcast": "If you think of volts like in that way, then yes, it's probably a little bit difference. Because with four six to six, you just supply one asset, and then you get back a share of the vault. Right? And while it sits in that contract, it does other things, of course, to generate yield. So your shares at later stage will be worth more. So you can withdraw more of that underlying back that you initially supplied. That's the whole idea. So let me quickly go back to our V one again and our key learnings there and why we actually decided to do A two. So with M stable one, as I said in the beginning like and the m asset, was probably not as useful as we thought. Right? And I was like, we created so early and when I was really really new, probably D default was not even the word. I think there was also open finance like at at one stage that was debate whether that should be the the word to describe the space. And so that's when m use was created. And currently, what we realized is that actually Mu is useful in one particular instance only, it's for generating yield. So the majority of users would mint mu just to deposit it into our safe contract. So what we realized is yield is actually the proper use case. Yield actually that what got us traction. And our smart contracts that generate like a nice better yields than probably just abe and come up by itself. So that's why we decided to pivot to the concept of meta vault where we take these learnings that we still want to provide a good yield for users. It's diversified, but we take away the complexity of having that this one asset sitting in the middle that's the user has to go through. So that's pretty much what our meta volt does. So a meta metabolic is a four six to six compatible smart contract. Right? So it's is possible with anything that can handle four six to six. So which is already opening up probably use cases that we don't even know about. There will be probably like a lot of them in the future. I assume once there is the comp in the ecosystem. And what methods allows you to do is to to take one asset in, like the one asset that you want to deposits and to generate the yield on it. Right? But we're not delay that actually generates the yield. We are delay that abstracts away the complexity of having it diversified yield sources of yield. Right? So rather than going just to one yield source and it's just sitting heavy assets there and then the yield was potentially no not yielding as much as you thought or the yield is probably gone. Are adaptable and can actually adjust also where and what they allocate towards. Right? So it's a diversified set of yield sources that the user can get exposure towards with one contract. This is reminding me of urine a little bit. Are are there similarities there? I think that comparison makes sense. Yeah. But I think there's like also slightly differences. But what we do with the underlying is that the the heal source itself are all four six to six compatible. So what we have is not just one contractor that the user can direct with, like every contract in the stack is four six to six compatible, which means that you can combine them and you can create products from them and you can then put two of those meta together in a new meta vault. So it's all the way down for six to six and compatibility. That's kind of what it comes down towards, but also it's a little bit... How you say, it's a little bit like more flexible when it comes to what strategies we pursue as well. So it's not so much that we have one strategy that we can use. It's a diversified set of strategies. ", "start": 1920.8296, "end": 2165.0452}, {"speaker": "0", "podcast": "Yeah. So another question that I'm thinking of is, you know, you said that the investment asked or the the investment strategies can change within the Vault? How is that decision of the investment change made? Is that governance based is that multi stick based? Or is it just hard coated into the vault? How does that work? So ideally, it won't change. Ideally, we have a ", "start": 2165.5393, "end": 2189.8545}, {"speaker": "1", "podcast": "met metabolic launch, and there there is already a set of underlying goals that it uses, and that stays the same. Of course, this can be changed by governance. So it should be adaptable to governance, but what we can do change is actually to weights around it. So how much we allocate bots. So we can also rebalance and allocate towards one strategy if it yields more, also more of the assets actually towards. ", "start": 2190.4824, "end": 2214.8052}, {"speaker": "0", "podcast": "Okay. I don't know, what else have we not addressed do you wanna make sure that we touch on related to in stable version two four six two six, ", "start": 2215.3765, "end": 2225.5554}, {"speaker": "1", "podcast": "etcetera. Right. I think those are the most important things. So what we are doing right now is we've built actually offers Meta vault. So that will be a strategy for sa coins. So the User can actually continue to earn a yield on their stable coins, but from a diversified set of like similar strategies. But it will allow them to diversify in the kind of strategy that is uses as well. So the idea of that is we want to really create products that the users can gain value from and that the users can earn yield on. Right? So that will be the first meta vault. There will be more meta. And as we go, we want to create more and more meta in order to saturate the ecosystem with more and more four, six to six. Contracts that anyone can need to create or anyone can use as well as a standing strategy or as a piece of it And as we do that, we hope also the ecosystem around four six to six will become such that we need to wrap less and less contracts to be compatible four six to six. Because that means then we can really start creating strategies really quick because then Projects will be four sixty six compatible, We can use our meta vault in order to compose them and to create unique interesting strategies and we can deploy them. ", "start": 2226.5122, "end": 2311.3909}, {"speaker": "0", "podcast": "So that's the idea of meta vault and why do you think it's so powerful. Yeah. I I totally agree this is really exciting. I've I've always been a fan of in stable. I have a in insta shirt. I have an in insta hoodie. I should wore the shirt today, actually, for the interview. I should. It's great. It's a black on black m stable shirt, So it's like you can barely see it, but you know it's there. It's it's great. Yeah. I'm really excited about these, like, updated, like these this new innovation with token standards and, you know, just building in the bear in general. And, yeah, what's it like to you? You know, just like the differences between all the hype in the bull market versus kinda, you know, just like all the less noise in the bear market that we're seeing right now. Like, can you, like, compare and contrast the the two on what it's like to build under these conditions. Yeah. Yeah. That's that's a good question because ", "start": 2312.1206, "end": 2371.14}, {"speaker": "1", "podcast": "Yeah. It's it's a huge difference. During the bull market, there's is just so much noise. There's like so many different products and there are so many things that you need to pay attention towards. There so many also like, interesting things happening that kind of forces you to reevaluate constantly what you're doing and also new opportunities popping up, so we Also, you also feel the need to pivot sometimes to address those. So there's like, a lot of things going on that makes you Mh rethink all the time things and question like, the things that you do. And one example is, like, there was, like, this whole yield in general doing the bull market is, like, really plentiful. So that's when you start to actually compete on the yield level and think how can you optimize your yield as well? Right? And that's when discussions start to pop up about why don't we integrate like this source or that source so this source. Right? So there's a lot of ideas that it gets really noisy. So that's the bull market. The bear market on the other hand yields get compromised to like, less sources. So what what we actually see is that there are many protocols that try to converge to a similar way. So they kinda start to do similar things just because yield is not as plentiful anymore. Right? So they go back to the heal sources that are still existent and try to create products on top of them. So the opportunities they kinda compress. And that's when protocols actually start to compete on a much more substantial level on, let's say, the actual use case, the actual utility, the actual, how differently they do it as well, also how good is to user experience and that regard. So I think it kind consolidate the market to back to the core values to build something that is actually good to use. ", "start": 2371.9778, "end": 2489.52}, {"speaker": "0", "podcast": "And how important you know, just looking at all the news, you know, with Celsius and you know, all these other protocols, not sorry. Not protocols. Companies. They kind of branded themselves as D defy, and we're very obviously not because, you know, you're literally giving your assets to someone to hold on. For you, How important is it for stable? Just to be decentralized? Like, what does the centralization mean to stable and how ", "start": 2491.8508, "end": 2527.4543}, {"speaker": "1", "podcast": "important is that to the community. I think that was a really good example when there were a lot of these centralized players that gave you, like, a really nice yield. That that was really an artifact of, like, this bull market. And that was also something that a lot of new money converted words because this was just easier to use as well. So after the collapse of everything after the collapse of all these kind of centralized players, not all of them, but, you know, the the biggest chunk of them, I think this really strengthen our our vision and why we actually building something that is on ethereum and really decentralized base layer. And why we build a protocol rather than like why rather protocol than let's say some something more centralized. So I think this really helped us to regain focus and understand that this is what we are building. It's maybe more difficult because it has all these components because it's smart contracts, but there's a reason why we built it. So I think it was really important to have this moment to realize that D is still something that despite all the market craziness it survived. And even keep stronger from it. And that's exactly what we also experienced with m, unstable function just fine during the whole crazy markets ", "start": 2527.7544, "end": 2613.4487}, {"speaker": "0", "podcast": "anomaly. Yeah. And that's what I've told people is focus and pay attention to the D defy protocols that functioned just as they were supposed to during huge draw downs and didn't lose user funds and just continues running on the blockchain. Those are the ones that pay attention to. And Ins stable is is obviously one of those. And it's inter it's interesting to think too. I there was this narrative in the bull market that I think it was just like users don't care about the centralization. And I think my response to that now is they they should have. And it's... I think it kinda falls on like, the shoulders of the influencers in the space too who also kinda hopped on that train. And I think it's easy to like, in the bull market to kinda second guess yourself. Right? In the bull market, you can definitely second guess the principles that you have, you know, like, do users care about the central does the centralization matter. And I think we're seeing now that it does. And it it it does kinda like what you said, like back to basics and back to core principles. We can kinda take a step back and say, Yeah, those initial beliefs that we had of decent centralization, comp, self custody, transparency, like, those are the core fundamentals of d defy, and that is what makes D defy so resilient during bear markets and just so I mean, I mean, those are just the most important aspects of decentralized finance in my mind. I don't know if you have any opinions on that. Yeah. That... I think that's a really good point. ", "start": 2614.1401, "end": 2715.934}, {"speaker": "1", "podcast": "But I also want to say that decent digitization by itself is also kinda like a spectrum. There are different protocols that have a different degree of decent centralization. And it also depends on a protocol to protocol basis of how decentralized is the protocol and how decent decentralized once you took... The protocol to be. I think there's like some protocols that can really work well to be one hundred percent decentralized like a Uni swap. I think it's a really good example because they just released the smart contracts, if they work as attended and don't they don't need to tweak it because they found the exact product that they need and that's exactly how it's supposed to work. While other protocols they are still searching for product market fit, so that's why they need to tweak and adjust a few things with the smart contracts. And also decent digitization also, like, on the other hand, has also like a big governance aspect. Like token token economics, token voting is a very contentious topic as well. I I'm not sure token voting. Like, there there were some many this discussions around whether this is actually something that is like really a beneficial part for the ecosystem or not. And there has been also like, really interesting experiments with moving away from token voting to, like, other concepts. And I really like to see those those come to fruition and see what actually will become the dominant design because I... Because there's parts of decent centralization that make also building products difficult or building products slow, like every time you want to do a smart contract change or you want to upgrade a smart contract, there needs to be some governance process, which is good because it will give accountability of why you do certain things. It will also prevent from doing anything malicious. But on the other hand, it means also you react way slower to new opportunities or you have less freedom to do certain things. So I think it's kinda like a spectrum and the more successful you, the protocol is probably the more decentralized they want to be. Because that means they have to tweak less and that's where the actual the actual ownership of the protocol can go back to the users once it's actually reached a certain threshold. So I think yeah, I I think decent centralization is an interesting topic, but not everything ", "start": 2716.669, "end": 2863.824}, {"speaker": "0", "podcast": "will or needs to be decentralized from day one as well. That's a good point. I've talked to Kane from synthetic. A little bit about that as well when I had him on the podcast. And he he shared similar sentiments. Right? And I think it's easy for people that kinda say, oh, you know, you've got a multi sig. So... And you have upgrade contracts, so you're not centralized. And that's I... That's true to an extent. Right? You're not asked as centralized as like a Uni swap, which does not have upgrade contracts. But know, if you're still looking for that product market fit, you kinda need some sort of up upgrade ability of those contracts. Right? As long as it like, doesn't put users funds at risk I I think that's I think that's okay. But it... Like you said also, you know, dis decent centralization is a spectrum. Like, you could be completely decentralized. I I guess Uni swap is like the best example that I can think of for that or you can also build completely centralized protocols on the blockchain as well, which you should probably stay away from. And I I think it... Yeah. You touched on another important thing too. And it's like, I think governance token allocation is another thing to pay attention to when it comes to is your protocol centralized or not. Right? If you know, you have one person that holds fifty percent of the governance tokens? Well, then you're not centralized. Right? Depending on what governance can change within the protocol or the contract. So I... You know, when I'm using D defy, I try to find, like, the most the centralized protocols that I can use with the the least amount of contract ability. But if I'm using other ones that or a little bit further on the other side of the centralization spectrum. I'm just not gonna put as much assets in there. None of this is financial advice but this is just kind of like my my mental process, my thinking of of everything. I I guess another question I have, D dimitri is like, What about, like Poly gone specifically? Like, what learnings have y'all had specifically deploying on Poly gone? And what has that experience been like for you as a product manager and just the in stable community in general. ", "start": 2864.6838, "end": 3005.8738}, {"speaker": "1", "podcast": "Yeah. Poly is a very interesting use case actually, because mh although like, the majority of Tv ls is actually on main net, I think Poly gained another way of traction. So because on main net it's quite expensive to do transactions, the majority of smaller users or new users wouldn't want to use Main net. So that's where we actually see a lot more activity on Poly. But not just that, we also see a lot more integrations from applications that are kinda of like the new fintech. So we see a lot of applications that try to take take away the launch from Fintech, but do it in a decentralized manner. So try to get the yield from D defy and then exposed to user only to their beautiful nice and easy application that is still non custodial deal. So we also saw that on Poly, we got a lot more integrations from those kind of partners and from those players. And we also have like, a really interesting grant or we had like, a grant collaboration with Poly as well where we also incentivize these kind of integration. So I think Poly itself is like a nice ecosystem to experiment and try these things out and allow for these did these if front front facing users, like they the the the users that are not particular in crypto, try to get them exposure. Towards crypto or towards crypto values and see how Crypto can actually work for them in a very easy manner as well. So I think that that way, ", "start": 3008.1963, "end": 3103.682}, {"speaker": "0", "podcast": "it was quite interesting to also experience that from that side. You know, personally, I think it'd be really interesting to see stable deploy on a Z k E, maybe sometime in the future, which Poly again will be announcing soon. Maybe on the same day that this podcast is released. So, yeah, Dmitry, this has been great. Thanks for sharing all of your insights and helping everybody learn about in stable a little bit more and just just general talking about, you know, what it's like to build in the bear market. I think this was this has been really informative for me. For everyone who's watching on Youtube. Thank you for watching. If you're listening on Spotify or Apple, thanks for tuning in and Dmitry, it was it was great. Before we sign off where and people go to find out more about you and stable. So we have m dot org. ", "start": 3104.333, "end": 3158.0518}, {"speaker": "1", "podcast": "The website, just to learn everything about M unstable to use m stable. There's it with our account, m stable underscore important. To just follow and unstable and what's happening with us. If you will want to follow me, it's just at tim sum dim onto there as well. I post sometimes information about them, Steven, but also just general ", "start": 3158.7832, "end": 3180.034}, {"speaker": "0", "podcast": "things that I like. And you're a great follow on Twitter as well. I follow you. Good content. Thank you very much. Well, thanks again, Dmitry, And, yeah, I'll see you I'll see you out there. Thanks for coming. Right. Thanks for having me. Was a pleasure. ", "start": 3180.334, "end": 3194.5212}], "summaries": [{"title": "1. The Journey of a Crypto Investor: Exploring the history and experiences of a crypto investor.", "summary": "In this episode of the Poly Alpha Podcast, host Justin Havens interviews Dmitry, the product manager at M Stable. They discuss centralized finance and cryptocurrency, and how the bear market in the industry is providing opportunities for companies to focus on their core products and engage in productive discussions. The author reflects on their own experience in the crypto space, mentioning the ups and downs of the market. Dmitry shares their journey into the crypto community, from initial curiosity to becoming a full-time product manager for Stable. They discuss their discovery of stable coins and decentralized finance, which sparked their curiosity and led them to explore different tokens and products."}, {"title": "2. Evolution of the M Stable Protocol: Understanding the development and changes in the M Stable protocol.", "summary": "The M Stable Protocol has evolved from a platform for holding multiple stable coins into an interest-bearing platform with a savings module. The Mu stablecoin, backed by a basket of stable coins, allows for asset swapping within the basket with weight limits to protect against depreciation. The protocol now offers a safe product that allows users to earn yield on their USD deposits through compound interest and swap fees. While originally designed to simplify the selection of stable coins, the protocol has gained traction as an asset to earn yield and highlights the growing importance of safe contracts in the cryptocurrency industry."}, {"title": "3. The Importance of Listing Mu on Coinbase: Exploring the significance of Mu listing on Coinbase and its impact on price discovery.", "summary": "This text discusses various topics related to mUSD, Mu, and stablecoins. It covers the methods of acquiring mUSD, the listing of mStable's stablecoin on Coinbase, the value of listing Mu on Coinbase, the benefits of listing Mta on Coinbase, the concept of stablecoins and their underlying assets, and the use of asset swapping in Am and Mu baskets. Overall, the text emphasizes the importance of these developments for the future of mUSD and the decentralized finance ecosystem."}, {"title": "4. The Importance of Token Standards in DeFi: Understanding the significance of adhering to token standards in the DeFi space.", "summary": "The text discusses the importance of adhering to token standards in the decentralized finance (DeFi) space, specifically focusing on the ERC-721 and ERC-4626 standards. It highlights the benefits of standardization in creating platforms and marketplaces, as well as simplifying integration and compatibility. The text also discusses the challenges and importance of creating a strong ecosystem for stable coins, emphasizing the need for usage and adoption. It mentions the plans of Stable to implement the 4626 standard in their Meta vault, but does not provide specific details. Overall, the text emphasizes the significance of token standards in the DeFi ecosystem."}, {"title": "5. Understanding Meta Vaults and Generating Yield: Exploring the implementation and benefits of Meta Vaults for generating yield.", "summary": "This text discusses the benefits of open trading and vaults for easier and more accessible trading and secure storage of assets. It explains the concept of meta vaults and how they generate yield through diversified yield sources. The text also discusses the decision-making process behind changing investment strategies within the vault and the concept of adaptable governance and asset allocation. The company is building meta vaults for stable coins to provide value and enable users to earn yield. The text concludes with a discussion on the potential of meta vaults and the excitement surrounding it, as well as the differences between building in a bear market compared to a bull market."}, {"title": "6. The Impact of Bull and Bear Markets on Crypto Protocols: Analyzing the effects of market conditions on crypto protocols and the importance of decentralization.", "summary": "This text emphasizes the significance of decentralization in the world of decentralized finance (DeFi) and stablecoins. It discusses the challenges and benefits of decentralization in protocols and highlights the need for true decentralization to ensure stability and user trust. The text also mentions the growing popularity of Polygon as a more affordable alternative for transactions and its role in introducing non-crypto users to the world of cryptocurrencies. The author expresses interest in the potential deployment of Stable on a Z k E and thanks Dmitry for sharing insights."}]}