{"podcast": {"title": "Polygon Alpha Podcast", "host": "Justin Havens", "image": ""}, "episode": {"title": "Governance, Multi-sigs, & Scaling in DeFi | Synthetix | Kain Warwick", "number": "2", "date": "JUN 15, 2022", "description": "", "url": "https://www.youtube.com/watch?v=15xrqqAnGMY", "speakers": {"0": "Justin Havens", "1": "Kain Warwick"}, "file": "june15.mp3"}, "transcripts": [{"speaker": "0", "podcast": "Welcome to the Poly Alpha podcast. This is where the Poly community gathers insights from today's leaders and decentralized finance and Crypto. I'm your host, justin Hammond, a aka Crypto. Let's get started. On today's episode, a Poly alpha were joined by Kane Warwick, who was the founder of this Fedex protocol. It's Kane? Thanks for being here with us today. How are things going? Yeah. Thanks for having me. Yeah. It's good. ", "start": 0, "end": 32.35938}, {"speaker": "1", "podcast": "Good times at the moment. I just finished to our session on ", "start": 33.327923, "end": 38.525658}, {"speaker": "0", "podcast": "Synthetic B three. So we're starting to make some good progress. Oh, that's exciting. Yeah. We're gonna have to dive into that a little bit here in a second. But before we get into v three, let's get like, let's go before v one. And It came what's your background and how did you get into the D defy and crypto space? I came from a online retail background. ", "start": 38.90151, "end": 58.14845}, {"speaker": "1", "podcast": "So I I was kind of interested in payments. You know, particularly things like, you know, charge backs and fraud and that sort of thing. So I think, you know, the idea of a bitcoin is like a payment method was something that I found really interesting. Obviously, you know, hasn't really worked out that way. Now we have stable points, but, you know, that was that was kind of ", "start": 58.78643, "end": 86.16889}, {"speaker": "0", "podcast": "the initial thing that got me interested in in Crypto. Yeah. And then I guess you you transition to synthetic assets, which is quite a bit different from payments, I guess in Bitcoin even. So I guess why synthetic assets and what and it was the driver to ", "start": 86.54701, "end": 104.620384}, {"speaker": "1", "podcast": "get you to found the synthetic protocol. Stable coins are kind of a synthetic asset. Right? Like it's you know, you take something and you know, you lock it up and then you create a derivative of it and, you know, that's stable coin. Right? You know, stable coins are are kind of you know, there's multiple different variations on them. But essentially, you're just trying to create something that maintains, like price stability by, you know, importing some other thing, collateral or whatever. Right? Obviously, you know, the kind of simplest version is just put some dollars in a bank and then create a token representation of those dollars in the bank in allowed redemption. And you know, but it's still you know, it's still kind of a derivative asset. Right? You know, value being derived from some other thing, some other form of money that's sitting in some other place. You know, and being custody. What we did with synthetic, I think is say, okay. You know, take that, like, very straightforward model of creating, like a synthetic dollar, right? And then create like a synthetic bitcoin, Right? That tracks the price of of a single unit of Btc or single unit of v or a single ounce of gold or whatever. But the principle remains the same. You put collateral in pot and then you applied some rules to it, and then you get this derivative asset that tracks, you know, the price using oracle ", "start": 105.39355, "end": 188.14877}, {"speaker": "0", "podcast": "and it's over collateral. Yeah. And I I remember a time back last year when the Uni swap front end started to, I guess dis some of the synthetic assets that the synthetic protocol creates. But one of the ones that it did allowed to stay on the front end, right, for, I guess, regulatory reasons. Well we suspect maybe not actually confirmed. Was this s usd synthetic Usd from the synthetic protocol. And the more I thought about it, I I just kinda thought, you know, what what is the big difference between Usd and die or Usd dc? Can you go into that a little bit? Look, you know, on some level, I guess, ", "start": 189.32086, "end": 233.92499}, {"speaker": "1", "podcast": "as a synthetic stakeholder, I'm happy that they didn't disable As well. I think it's very arbitrary to say that, like, Usd can stay at S eat Cons stay. For example, But, you know, they Needed to draw some line. The problem is If you Say Usd can't stay then you know, is dia on as well. Right? Like, you know, Usd. Like, ultimately, this is, I guess, come back to that initial point. Right? All of these stable coins are like, synthetic assets, right? They're they're like, a derivative of some other thing. Right? And, you know, dies a is a, you know, each derivative, Right? It attracts the price of dollar. You know, again, using this like redemption mechanism and over collateral rationalization and all of this stuff. Right? So if you say, you know, you can't have any kind of stable coin on uni salon. And that's not a great place to be. Right? So I feel like they were trying to do something that was like you know, threading the needle between, like ge in the direction of regulatory compliance, right, without putting themselves in a situation where they had to disable all assets. Right? But I mean, you know, the the broader point about this, I guess is that, like, the Uni swap contracts don't care. Right? The Uni front end is not the uni swap contracts. And, you know, these are two separate things. There are many different permission list interfaces and different token lists that don't, you know, remove synthetic assets or any assets at all. You know so I think the fundamental thing is that, like the Uni contracts are immutable contracts, permission contracts that are running you know, the the B three contracts that are running on Ethereum. Anyone can access anyone could great, you know, an Am pool. And then anyone can create their own interface to connect those contracts. Right? But the, like, official uni swap front end know, is run by Uni swap labs and and therefore, probably is under a bit more scrutiny than you know, the cane version of being the Cane fork of the swap front end. Right? I can probably do a little bit more crazy stuff than than you swap labs. ", "start": 234.80498, "end": 371.02582}, {"speaker": "0", "podcast": "Well, I mean, synthetic, the protocol is crazy enough as it is. I think for some people, like, it's it's such a complicated protocol. Like, how what's your elevator pitch to people who maybe just have, like some sort of knowledge of D defy? Like, how do you explain Synthetic? In a very simple way. ", "start": 371.59998, "end": 391.3175}, {"speaker": "1", "podcast": "I think there's two dimensions. Right? One is, like, do you want price exposure within ethereum two different assets. Right? If you do, then we've got a pretty compelling pitch, right, which is that you can hold a token that represents Bitcoin and we'll track the price of bitcoin without relying on a custodian. That's it. Right? So instead of rapid Bd, which used this custodial process of, you know, btc locked in on on the Bitcoin blockchain and then an Ios you issued as a token, whatever like, this, you know convoluted. Trusted process instead you have like a more trust process, right? More algorithm process that allows you to have a bitcoin token that tracks price bitcoin and works pretty well. So for for the person who just wants price exposure who wants to hold a synthetic asset, you know, have exposure to synthetic bitcoin or synthetic gold or whatever on Ethereum. It's a pretty simple pitch. For the person who wants to participate in the creation of those assets and and the maintenance of the network and staking and all that stuff, It's a more complex. System. There's no question. Right? And so we try to like, make it a distinction between those two things. If you just want price exposure, go by a token, go open up a a per position, if you want leverage, no problem. If you want stake, then, you know, you gotta kinda go down the rabbit hole. And I guess, I guess if you want stake, like, you're you're much more defy you're much more defy gen than just like just generally define native. Right. Is that what you're trying to say? Yeah. Yeah. One hundred percent. Yeah. That makes. It's a lot more effort. It's a lot more effort to be a stake in synthetic than... To just hold And have some bitcoin price exposure. Does the you need to understand a lot more, you need to understand you know, the risk of staking, you need to understand you know, how the game is played, all the mechanism design. There isn't, you know, in the current iteration of synthetic and synthetic V two x. There is no easy mode taking. In v three, there will be easier staking. You'll be able to to stake and you know, there'll be there'll be some things that make the process a lot easier. But for now, you really have to be pretty to stake. S max and and synthetic. ", "start": 394.1775, "end": 537.8655}, {"speaker": "0", "podcast": "So outside of just, you know, Sb, s e, s usd, There's also... Isn't there like s gold and s oil and I don't know, like, what are some of the more, like, really unique we're just kind of out there synthetic assets that have been mint. And I guess, like, there has to be market demand for these two. Right? So we can't get it can't get too exotic, I guess. Yeah. So the the reliance on articles means you need a liquid ", "start": 538.6619, "end": 568.481}, {"speaker": "1", "podcast": "market. Right? Some off chain liquid market in order to facilitate price discovery and in order to ensure that, you know, the arp are are not and, you know, are are secure and safe. So you know, obviously, gold is is fine. You know, there's a very liquid marker for just maybe multiple different liquid markets for gold. You know, same thing with silver and other commodities they tend to have liquid chain markets. Bitcoin obviously has you know, a lot of centralized exchanges for for chain liquidity. As you get into more exotic assets. It becomes a little bit hotter. But again, this is one of the things that will change in B three versus V two is that in b three, you'll have permission less asset creation. So you'll be able to create a market Now, there's an interesting question. I guess you know, that you kind of alluded to which is okay, great. You know, we've had a lot of different ways to create, like, permission less synthetic assets, You may is is probably the best example. And historically, you know, they haven't really got much traction. There's a whole bunch of reasons I think. But ultimately, you know, one of one of the reasons arguably, I guess is that if there isn't a liquid off chain market, there probably isn't much demand for that asset. Right? And the intersection of assets that don't have liquid chain markets, but do have demand for trading. Is probably pretty small. But the flip side of that argument is that bootstrapping liquidity for a new market is very hard. Right? And so it's hard to create novel instruments and bootstrap liquidity. So we think that the combination of synthetic and and this like very deep liquid pool of collateral that we have, plus permission less asset creation. Might allow for that intersection to be expanded a little bit in b three. That's the hope. Yeah. And that's good. You're actually kinda leading the end into one of my next questions. So ", "start": 569.0952, "end": 697.7136}, {"speaker": "0", "podcast": "I think there there has been just like a huge difference in philosophy at time in the d default ecosystem about having up upgrade contracts in a protocol you know, versus something like Uni swap where, you know, you have to provide a new iteration, you know, v two, you've gotta create b three, and then you've got merge the liquidity from v two to v three, And so that's probably something that's gonna have to happen with synthetic. Right? With synthetic b three is the the merging or the bridging of that liquidity from v two to v three. I just kinda wanted to get your thoughts just like on on having a multi sig for, I guess, unforeseen circumstances with the new smart contract versus just building it. And letting it run and seeing what happens? Like, just the differences in philosophy there and where do you feel like synthetic fits? Yeah. I mean, back in the day, immutable ", "start": 698.73895, "end": 754.6585}, {"speaker": "1", "podcast": "contracts were kind of the expectation, right? When we launched in twenty eighteen, the idea of using proxy contracts to allow, you, iterative upgrades of of of your contracts suite was not really acceptable thing. And you can go back and see some of the old reddit threads or people were, you know, kind of attacking us over that and and, you know, very unhappy about this. The problem with building immutable contracts in Deep by is that you know, we live in in an environment where we have been perfect information. And so it's very hard to design a set of contracts that are immutable that you know, you then deploy and you start to gather feedback from the market and, you know, you don't need to make changes to. Uni swap is one of the few examples of really nailing this. Right? And, you know, on some level, like, the simplicity of uni B one and even V two kind of speaks to you know, why this is okay, Right? There's many examples of immutable contracts like Au you know and things like that that have really failed to gain any traction because you're designing in a vacuum. You have this huge long waterfall process that goes for like a year or two years or whatever. And then you deploy it. And if the market doesn't respond well, you know, you go back into two more years of of building to try and, you know, make a change to those contracts. Right? As opposed to, you know, two weeks later you go, oh, okay. We got this thing wrong, Right? Let's tweak it. Now the problem with that when you when you do this is as you say, you're relying on multi six. And the reliance on multi sig and D defy is a huge huge issue. I I think it's something that we need to move away from. Because the problem with the multi sig that's kind of just dislike unspoken issue that that people don't like to to raise, is that multi six are bi necessity discretionary, right? A there's a level of discretion that the multi six signer have and a level of trust that you need to have in the multi sig son because you can't run them. Right? Or it's very hard to rug them. Right? We don't we don't have good tools to bug multi six sinus. So I'll give you an example. Right? Like, if we, you know, let's say you me and I don't know. I'll pick random person. Let's say let's say Crisp. Okay. Let's throw it. Right. You mean Chris black, decide that we're gonna we're gonna start some thing. Right? And we saw a project and we have a multi sig, and it's a two of three. Right? And, you know, we've got community, and there's maybe, you know, hundreds of thousands people in the community. Right? And there's three people that have arbitrary control over this project because even if the token holders, the community members, right, want to express some voting preference, they they ultimately need to trust us to actually execute it. Now there are ways to get around this There, you know, things like compound governance module or whatever, which allow for, you know, like on chain execution of of changes and things like that. But even still oftentimes, there's a backup multi sig that sits there that, you know, monitors parameters or, you know, other things and and, you know, can they change this to like, the Meta governance process. And the issue with that is that if all the target holders say actually, we don't like Kane and Chris. Wanna get rid of them, we want to replace them, right? The multi sig is the owner of the contracts. Right? And the signer are the owners of the multi sig. And so they say, sorry, Chris and cain, like, get out of here. And we say no. Like, we don't wanna go. Right? We think that we're actually doing a really good job and we don't want to really control over this. Right? Now, this doesn't happen out in the open that often. Right? But it is a fundamental issue that we have with multi six. Right? And now there there are ways of getting around it where, you know, ideally have, like, five of seven or like, six of nine or, you know, some M scheme where you have, you know, a lot of signer. But like, if there is a genuine disagreement between the community of token holders and the multi six signer, there is no mechanism by which you can remove these saunders. Right? And this is something that we have been concerned about synthetic for a long time. Right? So we have the Smart council, which is an elected body. But the Foreign council votes for things and then has to rely on the the protocol dow to go and execute it, which is just fundamentally wrong. Right? Like it just adds this element of discretion. And so what we're actually doing in Synthetic V three gm, which is our new governance module is the token holders in electing the Spa Council, distribute N entities that represent seats. On this council, and the N t's are effectively a multi sig. Right? And the difference between N t's acting as as a multi sig, right? This group of eight signer, right? That have an N nxt that represents their voting power, right? To execute a change on chain is that if we decide that all of them collectively are bad or they're doing a bad job or they're not being responsive enough the token holders can remove those entities because the the contract has the power to revoke and reel elect. So you can dissolve the council, You can remove a member. You can have all of these meta governance proposals that are controlled by token holders that allow for you to essentially revoke control. Right? Whereas a multi sig, the way that knows safe is designed and that's where know, ninety nine percent of multi sig they're using those safe, Right? Is that the signer themselves need to re control. Right? Which has been insane. Like, if the signer are doing a bad job, they're not gonna really push control. And so you have this, you know, stalemate that you get to. Right? So this is this is the thing that I think is going make a big difference as part of V three gm, where you can have the sub dials that are ultimately kind of responsible to token holders directly as opposed to having this discretionary power that's being handed to, in some cases, you know, random une elected community members and used hope that they're good actors. So that's almost like ", "start": 754.96826, "end": 1151.7848}, {"speaker": "0", "podcast": "a wafer token holder revolt against multi six designers? Absolutely. ", "start": 1153.031, "end": 1158.68}, {"speaker": "1", "podcast": "Yeah. Absolutely. And, you know, like, there's there's things, you know, M dow, has concepts around this, like, you know, rage quitting and and, you know, the ability to, like, eject people, etcetera. So so, you know, mu out is kind of like a multi. Right? Like, it's a more powerful version of a multi. In that the participants who are voting for proposals and changes have the ability to remove each other and you can like, reach consensus, etcetera. But no so safe does not have that capability. Literally, you cannot... If if you don't have enough signer, you can't remove someone. So if there's a disagreement you know, in, in a like three or five multi sig, right? If one person disappears and the other four people are two against two. You have a stalemate. There's no way to you can't remove them. Right? And so then you have to fork protocol and, you know, turns in chaos. Right? And so this stuff tends to not happen, but ultimately, you know, it's a huge issue that we need to remove. And we just don't have the tooling. Right? Like, Our goal was supposed to be tooling that did this stuff for you and a allowed to token holders is directly vote and, you know, and, like, the compound governance module kind of gestures in this direction of not having, like multi sig and control of protocol changes. But what it doesn't have is it has the the concept of delegation. Right? So you can delegate to to a single party, but you can't delegate, like a representative democracy in the sense of, like a a council, like a synthetic council type setup, where you have, you know, eight elected members who have discretion over changes. That are that are you know, implemented in the protocol. So anyway, so this is old to say, like, you know, we're slowly sorting our governance tooling, but at the moment, governance tooling is is just not adequate in my opinion for where we're adding in D defy, ", "start": 1159.0767, "end": 1284.6602}, {"speaker": "0", "podcast": "Yeah. I think a lot of people would agree with you there that, you know, I think even to Tally... Chris black that certainly would. Well, yeah. If he would. That's why I picked him for our multi sig because he is so critical lately of multi six. Yeah. But, you know. He he does he means well, I guess, most of the time. He means well. He best. Yeah. He. So I think that that kinda gets me thinking. Like, if you... I feel like three d defy summer kind of what you said, like, the idea of having a multi stick to make changes to your contract was a pretty taboo in the Deep defy space or just in the crypto space in general, And then I think d defy summer happened, and then there were a lot of trends in D defy summer, like liquidity mining, And, you know, when you're looking at other L ones or other chains, maybe sacrificing security for scalability and or cheap fast transactions, I guess. And multi six became just pretty commonplace in the D defy ecosystem over d by summer and then after d by summer as well. I kinda wanna... Like, looking forward for D defy, like, how do you feel like the philosophy has changed now that we're kind of back in a bear market and things are just kinda getting back to the basics. Like, do you see any other trends that might go the wayside as we continue to build in the bear market? ", "start": 1285.4742, "end": 1372.3186}, {"speaker": "1", "podcast": "Yeah. So I think, you know the last bull market was basically just Ico chaos. Right? You know, there wasn't really much stuff actually being deployed. Right? There was nothing usable. Like, the only, like, you know, kind of iterations and improvements were on like you know, Ico structures. Right? Like, the mechanism design of Ico, right? It's like the implementation like dutch auctions and like, weird, you know, polka dots like weird, like multi day discounting, you know, reverse dutch auction system like this convoluted. Schemes, but they were all like, optimizing in a very narrow domain of, like, how do you get as much eat into a contract in exchange for future tokens as possible Right? Like, that was, like, literally whatever I was trying to optimize for. That was the only chain stuff that was really happening realistically, right? The vast majority of twenty seventeen. They just weren't many contracts on on Main net, right? That we're doing things. And so I think deep by summer kind of blew that up. Right? Because by the time you got into this d five market in twenty twenty, in order to, you know, get attention, it wasn't sufficient to do like an Ico. Right? It wasn't just about, like, optimizing for a a capital raising contract. You had a whole range of different smart contract suites and different use cases and things like that. And when you are trying to iterate quickly, you know, and if you go back to twenty seventeen, the iteration was all like in this very narrow domain of how do you raise capital? What's what's the acceptable way to, like, you know, when do an Ico. Right? And there was like, very rapid innovation and iteration on those contracts and people would, like, reuse contracts to fork them and like, all of this stuff. Right? But you... There were kind of one time use contracts if that makes sense. Right? Like, you got one shot. Right? There were one shot contracts, you deploy the contracts, you put up a website, you do the sale and then you're done. Right? And then maybe disappear and and now whenever he was from you get. Right? Whereas with Deep by summer, you were deploying contracts that were like going to be used. Right? And so when you're optimizing, like iteration in that kind of environment. It's really interesting because you can't get away with just like deploying a contract and then, you know, doing a sale and then, you know, never having to touch those contracts again. Right? You need to be able to update contracts. You need to be able to make changes. And so I think people in optimizing for speed, just threw away every other thing. Every other consideration. Right? Like, in a in a bull market when you're trying, like, get to market as quickly as possible. It's all about just, you know, deploying the contracts and being able to iterate and update them and everything. And so we we we really the pendulum swung way too far to the direction of just, you know, doing whatever the fuck you wanted basically to try and try and maximize your your speed to domain net. Right? Which is, you know, we're and we're still dealing with the hangover. From that. Right? Like, once once that became acceptable, you know, it just... It it kind of continues from there. And so, you know, there's a whole bunch of things that then, you know, rug and everything that kinda led from that because people just got used to the idea of using a contract that, you know, had, like an E way. It's the opener of the contract which just insane. Right? Yeah. And I like what you said there, you know, just your... People were basically taking shortcuts to expedite, ", "start": 1374.0839, "end": 1586.2659}, {"speaker": "0", "podcast": "you know, their may net deployment essentially. Is kinda of what you had to do in a bull market. Right? If you wanted to take advantage of, like the... That Vc money or the retail money, you had to deploy quickly and you were gonna deploy a smart contracts probably that you thought might possibly have some bugs that needs to be fixed, then the the quickest way to do that is just to put it on a multi sig. Right. Yeah. ", "start": 1586.6448, "end": 1610.3054}, {"speaker": "1", "podcast": "Exactly. Exactly. And so, yeah, you you knew. You just optimized for speed, right? In a bull market. And I think in a bear market, the nice thing is everyone can stop, take a breath. You know, I was at permission less and talking to some old d defy friends of mine. You know, people like Brock Elmo and, you know, some of the people launch some of the crazy food farms and things like that. And it was so interesting to me because we're all independently talking about some stuff that it's kind of to us over the last, like three, six months. And literally not one of us. Were like, five of us in a group just chatting. And every single thing that each person brought up, none of the other people had heard of. So it it's like this weird thing where, like, there's just so much stuff going on and like just everything is so chaotic that, like, you know, they're like, oh, if you heard about like, this thing where you can like, you know, some like Dc style, like, you know, dollar across averaging thing where you can, like, you know, treasury management or something I'm like never heard about. And then someone else is like oh, what about this thing? So, like, I think in a bear market, everyone kinda stop you slow down a little bit, and you can be like, alright, let's catch up with what's going on. Let's work out where the problems are. And, like, on some level, you know, we had Summer in twenty twenty, Right? That's two years ago, Right? But we rolled in from Defy summer you know kind of like this kind of counter cyclical deep eye bull market, even while macro crypto was in a bear market still, Right? We had this little, you know blip of e the bull market. Then we rolled straight into a macro bull market. Like a macro, you, crypto market. Right? And so you had like tons of deep noise followed by tons of macro crypto noise, And now we're just kinda coming out the back backside of that and I think everyone's like, whoa, okay. Why are the problem? And one of the fundamental problems, I think it's like governance. There's been very little reason for people to optimize for better governance because if no one's paying attention to what's happening and everyone's just running around screaming, you know, like this... The house is on fire, governance is something that kind falls by the waist wayside. Right Like... And so so I think now though, as people slow down there they're like, whoa whoa whoa. If I'm gonna put my money into this contract, what's actually underpinning it, Right? Like, what's going on here. Right? And they slow down and they start to really assess things and they go, that's insane. There's an E way that's the owner of this contract you're seeing all this stuff come out now. Where people like, did anyone realize that, like, this contract that is a hundred million dollars in it is literally owned by, like, you know, meta, like Private key, Like, what's going. Right? And so, like, you know, people are this subs being discovered and and people are realizing that this is chaotic and we need to fix it. And so I think that we will have this kind of reckoning as the market goes whoa or whoa. This is not okay. You know and there'll be a level of kind of diligence that will be applied and maybe a little bit more skepticism and the higher levels of kind of security that are expected ", "start": 1611.3455, "end": 1802.2251}, {"speaker": "0", "podcast": "until we get into another bull market. Yeah. I absolutely agree with you there. I think most most people that are still around right now. Would also agree with you. And I think another, you know, obviously, another thing that's being built right now during the bear market is ethereum scaling in general. But also, I feel like Synthetic has been scaling itself in in a unique way as well. Because if you take a look at just like synthetic smart contract comp. Right? You've got Qui, which is a leverage trading protocol. You've got L, which is up options and you've got t, which is binary options, but I think I... When I doing some research. I I think they changed their binary options to pair mutual options. I'm not sure if the same thing just a rebranding. So... And and I think all of these received grants from the synthetic, I guess, foundation or synthetic grant dow. However, that's structured in your ecosystem. And this almost feels like a modular way of scaling synthetic as opposed to like a monolithic way. Was this always the vision And would would you agree with that assessment. I think it was a very organic process. ", "start": 1803.3251, "end": 1873.6107}, {"speaker": "1", "podcast": "And, you know, Qui is maybe the best example of this. Is a good example as well. Right? So I think what what we found is that we built binary options, mechanism within synthetic. Right? We deployed it and, you know, like most things that you deploy. It was really dumb and, you know, there were a whole bunch of issues with it and it needed to be fixed. But by the time we had realized what the issues were and what needed to be improved. We'd moved on to something else. Right? We're working on futures and we're working on, you know, V two and and a bunch of other things. And people like, whoa, like, you've got these contracts here that are not great and we really wanna use them, but, you know, there's this problem and this problem this problem And we're like, oh, yeah, sorry, but we can't help you. Or doing this other stuff over here. Right? And res sourcing was really problematic. And so we kinda said, well, okay, like, how do we deal with this Right? Like, you could, you know, in a normal corporation, you would say, okay, Do we wanna keep this product line alive? Do we wanna spin it out and do a separate company or, you know, you'd kinda have to make some decision about it. Right? In a protocol, it's a little bit harder. There's... It's not as obvious what the what the approach is. But we got to a point where we said, okay, Why don't we do something similar to spinning it out? Right? Where we put up an offer and say, if a team wants to form around these binary options contracts, Right? And take them on and own the maintenance and improvement. And, you know, we have a whole lit of things that need to be fixed had at, you know, the community of provided. So you've got a road map already, Right? That you can go in and work on. And the Dow will provide funding. So the Dow will will give you an investment. You go launch the project, you own it, take it outside of the synthetic governance process, Right? So it can be a bit more early stage doesn't have the same level of overheads in terms of, like, you know, governance processes and and what have you. And that's what happened. And so these two founders turned up and said, hey, we wanna take this on. And, you know, they have now extended those initial options contracts. Right? You know, by, like, you know, a factor twenty or thirty or something like that. By, like, you know, they've built better interfaces, and they've got a game and they've got educational material and it's a own an independent project within the synthetic eco. System. Now. Right? Because it uses And, you know, it's still connected. This still uses similar governance processes. They have a council. So it's like this ecosystem of sub projects almost or independent projects that maybe were ideas that the genesis. So the idea came out of synthetic, but has kind of emerged Lara is similar where, like you know, an engineer from synthetic said, hey, you know, we think that like Vanilla style options or a really good idea, and we have an idea of how to do this in a way that kind of leverages synthetic, but is you know improvement on it, etcetera and, you know, same thing. Right? Like, help funding, you know, they spun out of you know, out of our engineering team and you know, then one hired some people and so like, oh, basically, you know, you've got this kind of weird like pseudo incubator, accelerator, thing that, you know, keeps like just growing and getting bigger and bigger or bigger. And obviously, all of that's happening on optimism. As well. Right? So you know, you've created this situation where like, I don't know. Like, half of the major projects on optimism are within the synthetic ecosystem, which is an interesting dynamic. Yeah. That is a really interesting dynamic. And ", "start": 1874.7261, "end": 2089.1567}, {"speaker": "0", "podcast": "I wanna talk about layer two scaling. Well, yeah. I'll just go and ask right now. So when you look at Synthetic from a layer two scaling perspective, I think that, you know, from, like the true deep blue chip protocols, y'all are probably second only to compound and how selective you have been. About which Layer two's solutions you utilize for the scaling. I mean, like, yeah. When you look at Avi or Sushi or Uni swap. You know, they're they're on multiple layer two's. So why do you think the s synthetic community has been so selective about the scaling solutions? And if they are being so selective about these scaling solutions, I I think a lot of people do, like see zero knowledge roll ups as like the holy grail of ethereum scaling. Why not wait for a zero knowledge solution as opposed to deploying on an optimistic solution? ", "start": 2090.2644, "end": 2143.661}, {"speaker": "1", "podcast": "Get your thoughts on that. So look, I think, you know, path dependency in startups is is just a thing. Right? This idea that, like, you know, some decision that you made ages ages ago kind of led you down this, you know, path that now, you know, in hindsight, you look back and you go, oh, okay. Like, you know, we didn't realize how impactful that decision would be. Right? And so, you know, as you kind of go down these different pods, you end up in in a place that maybe is very different to the place that you're expecting to be without kind of realizing the, you know, the implications of independent decisions that were made along that path. Right? And, you know, some of them are, you know, totally distinct spaces that you end up in that, you know, can copy bridge back to, you know, some other plates. Right? And I think one of the things that that happened in Synthetic is we were so gas inefficient and so complex. You know, like, back in twenty eighteen, we had, like, a hundred contracts something like that May that was insane. The cost of claiming and everything even when, you know, gas prices were low was still super high. We're like ten x every other project. Right? People will be doing a transaction. They're, like, cost me twenty dollars to claim and it's two dollars to do it, you yourself transaction. Like, what are you guys doing? You know? And we're like, yeah, look, you know, it's a complex set of contracts, don't know what to tell you. Right? But then as gas prices went up, and it went for twenty dollars fifty dollars to a hundred dollars. We're like, whoa. This is not gonna work. Right? Like, we can't be, you know, like, it's just not viable, right? To be charging, you know, for people to be paying a hundred dollars for for a claim. Right? So that put us in this situation where we had to make a decision early. Right? And we... And, you know, the community kinda of looked around and the engineers looked around and we said, okay, wanna do something similar to what we did with Chain link, where we found a team that we were confident in that we could, you know, kind of work closely with collaborate with to, like, develop something that was gonna be really ideal for our use case. And that's what happened with chain Right You know, we spent a year with chain link, like, really getting to a point where we, you know, kind of... Like, there were a lot of changes that Chain link made specifically for synthetic that, you know ultimately they would have had to make for any db protocol, but we were kind of the cattle strike for for driving those changes. Because Chain link, We're Building An Oracle infrastructure. And then all of a sudden, someone turned up and said, wait a second like you guys are optimizing in this dimension, but we actually need you to optimize a little bit more in this dimension. And the same thing happened with optimism. Right? We said, hey, you guys are building a scaling solution and you've got this like very, you know, ivory tower, theoretical approach scaling and stuff and, like, we're here on the ground, like, digging ditch. Right? Like, we need you guys to, like, optimize for, like, you know, this thing and this thing and this thing, They're like, oh, okay. Like, that's in thing Right? It's a different perspective. When you're out there, you know, in the field digging away. Right? And they're like, you know, contemplating the cosmos or whatever. And we're like, hey, guys, like, you know, we really better shovel. Right? Like, or, you know, we need like, you know, a better kind of plow or something like that. Right? And so we kind of we were a forcing function for them to like, really think about, like the practical of what scaling look like. In the same way that we're this forcing function for a chain. Right? So we made a decision early, collaborate really closely with a team that we trusted, and that put us on this path of we're now all in on optimism and we need to, like, go and take this to, you know, it's logical conclusion. In a hindsight, if I could go back and do it again, knowing what I know now. Right? I would probably push harder to get the community to deploy to something like Poly gong, I think we're a little too, like, e maxi about about this, which it sounds weird now. Right? Because you're like, wait, like, Poly is like, very obviously within the Ecosystem. But there were debates back then about side chains and you know, all of that like very nuanced stuff that like you know, after the All one thing blew up. Right? Like, looks really dumb. Right? And, like, Poly gong obviously looks like a much, much better approach And had we hedge out bats a little bit employed to Poly gong, we might be in a different place. Right? You know, we might we might have we might have gotten a little bit more traction or what who knows? Right? You never know. It's hard to to run the on that. But my sense is that that was mistake for us to not go to Poly. But it did force us to get action together and and, you know, get, like, scaling sorted out. Right? And we eventually got there. And now we've got this optimism you know, optimistic roll up solution. To then, I guess to answer the second part of your question of like why not Z k roll ups or some zero knowledge solution. The answer is in the same way that Op roll ups took way way longer than everyone expected and we probably should have just deployed it on the side chain, you know, and just sucked it up and and help in Maxi and and just, you know, accepted the trade offs a little bit and the lower security. We also, I think made you know, we made the wrong call by not doing that with side chains, right? We made the right call, I think in not waiting for z knowledge roll up. So a zero knowledge scaling solutions because I think they're much further away than people kind of hope that they might be. Right? That's my that's my intuition. I think it's gonna be much much harder. You know, this Z k sync has been ready to go for, you know, like eighteen months now. Right? You know, it was it was gonna launch around the same time as, you know, all the optimistic roll ups and I think we're still very far away from a production level, z Z k sync environment that can handle like, all of D defy. So I just think it's gonna to take a lot longer than people expect. And so in the interim, we now actually have, like, pretty robust optimistic roll up solutions. They're not perfect. They're definitely trade offs. You know, they're still controlled by multi sig. They still have, you know, lower security than than L one. But they're trending in the direction very quickly towards something that, you know, I think will be very robust and realistically post merge, you know, the the optimistic roll up scaling pathway for Ethereum is I think the optimal, you know, given everything that we know now. Right? It still feels like that's the optimal path for Ethereum. To compete with the All ones. And I think it will be the thing that that works for us. Like, in the longer term, like the terminal solution, I think is like some zero knowledge solution, something. Right? But in the interim, I think we need optimistic roll. Yeah. ", "start": 2144.3142, "end": 2554.07}, {"speaker": "0", "podcast": "So it's kinda like you were touching on earlier. It's like, you you just needed to deploy not to main that quickly, but that's... That was the mindset of, like the, I guess, the device summer in the bull market, but it's just with your case, it was our smart contracts are so Damn complicated that we've gotta get on some sort of scaling solution Asap to make it usable. Agreed. What what is it about the synthetic smart contracts that makes it so gas intensive. There's a whole bunch things. ", "start": 2554.8674, "end": 2583.5989}, {"speaker": "1", "podcast": "You know, it is just a complex system. You know, there are are a lot of different components to it. V three will definitely simplify it. But even still would be three, you know, there are probably like seven major sub components to synthetic. Because it it's a system that requires, you know, lots of different checks and balances, I guess. Right? So, you know, you've got like, a governance component, and then you've got the collateral component and then you've got all these mechanisms to ensure that the collateral maintains its value and then you got the debt component, and then you got the rewards components. So there's all these different sub components that are fairly complicated smart contracts in their own right. And then they all connect together to create this system that holistically is functional. So it's just kind of unavoidable on some level, the complexity, especially when you introduce other forms of collateral and ", "start": 2584.2375, "end": 2641.1147}, {"speaker": "0", "podcast": "futures and things like that. So... Yeah. And I mean, what kind of logistics have to go on within the synthetic ecosystem to deploy on a layer two. Like, is it just, you know, with optimism in in it's E... What's what's it called... It it could compliant. I forget what it's called. Equivalents. That's what it is Yeah. Is it is it just as simple as deploying on an E chain or, like, what kind of requirements do you need when you are deploying on a on a scaling solution. Like, are you looking for, like, guaranteed Tb to ensure the product is working smoothly. I guess, like, what are the the base requirements that you look for? I mean, from an engineering perspective, it's a different deployment. ", "start": 2641.664, "end": 2684.9084}, {"speaker": "1", "podcast": "And so, you know, it is a separate code base on some level. There is a distinction between what's deployed on our one and what's deployed on optimism. We also need governance to be respectful of this distinction as well. So, you know, when governance proposals are pass now, it's like there is you know a field in the governance header, which says, like, is this for optimism or is this for All one. Right? And so, you know, there is a level of complexity as you add new networks where, you know, you need to understand what are you governing? And who's governing and how does it work? So, you know, all of these things as you deploy multiple networks increased complexity. And so I think that, you, protocols like Abe and stuff that have even though you, the other thing the synthetic is you can't just deploy a fork an independent fork on each network of the protocol. So our they a lending protocol can have a distinct separate instance, right, on each network. Now, there's some overlap because you got the Abe token, there's governance etcetera. So I think, you know, most Deep protocols now with governance can't really get away with this. Right? Like, need he's need you know, there's some cross network communication required. But with Synthetic, the the debt pool is unified. Right? So you've got like a network that has a single debt pool and these single fungi assets that are moving across chain the level of complexity required as you scale up the number of networks to keep that running and keep that in sync. Is significantly higher. Than just deploying, you a separate set of abe ", "start": 2685.468, "end": 2785.2185}, {"speaker": "0", "podcast": "lending and borrowing pools. Yeah. That that makes sense. And it's... Yeah. Okay. And we've been kinda dancing around this subject the, like, this entire interview. But let's talk about version three. And, you know, you've sprinkled some tidbits here and there like, permission lists asset creation and changes in governance. But what are some of the major changes first for synthetic V three that you're most excited about? I think ", "start": 2787.269, "end": 2813.0525}, {"speaker": "1", "podcast": "what it's allowed us to do, you know, Synthetic was deployed in December of twenty eighteen, which is a long time ago that is a long time. You know. You know, And So there are contracts on main net that not many. There's is only, I think of the original one hundred contracts whatever that are deployed. I think almost all of them had d and and replaced by new contracts, but there are still a couple of contracts that that are floating around that, you know, are still connected to the system. And so, you know, what you end up with is situation where I think we've made something like a hundred and fifty or two hundred changes. Those contracts over the last four years. And that just introduces a lot of complexity. You've got things that are just duct tape together that you know, really just needs like a fresh kind of clean slate re. Rewrite? And there's a lot of things that we learned, right? You know, we deployed multiple different attempts at front running protection. Right? And each time you deploy front running protection, you then, you know, make some trade offs and then you go, oh, okay, that didn't work or this gap here or whatever they need deploy another version of it. And you just have layers on layers on layers of of complexity that that introduces. Because, you know, there's some component that was expecting this type of front running protection and now you replaced it with this other type and not aware of how that works. So the the level of complexity from an engineering perspective is is significantly higher. So V three just starts from a clean slate and says, what are the components that we need? We need to be able to state collateral. We need to be able to pay rewards. We need to be able to do exchanges need to be able to do liquidation. So it takes all of the things we know and it says, what is the optimal way of doing each of these components? Right? What's the optimal liquidation mechanism? What's the optimal reward mechanism. So synthetic still operates on this like weekly epoch based thing, which is just insane. Right? It was something that was deployed in twenty eighteen it seemed like a good idea. I mean, it goes back even to earlier versions. Right? Like no one operates on like a weekly snapshot epoch. It's like everyone worked out a long time ago, they're, like, continuous accrual of reward. This it's like the optimal strategy. But we're still stuck in this weekly system, Right? And so the new version of Synthetic says No more weekly soft. There's no more snapshots. It's a continuous accrual rewards. It makes it much, much simpler. Synthetic also does weird stuff with like not token patronizing positions. Right? So when you stake S and x, as you know, your rest next stays in the wall. Right? And people are like, but I state to my s x and it's still in my wallet what's happening. Right? There's not a single protocol that I can think of that still exists that does that uses that pattern. Right? Of, like, locking your token in your wallet when you stake it, Right? Or when when you do something with it. Like, it's insane. Like there's no one else Synthetic is the only thing it's like such an an ana approach to to taking. Right? So now what the new contracts do is they say, oh, you're gonna take your tokens. You send them to the second contract, and then they live in that steak contract. And if you want un steak, then you pull them out. Right? It's just obvious patterns that everyone has worked out, consensus has been reached, and we're still living in, like, you know, pretty start time. So that's basically the majority of it is just optimization and, you know, cleaning up of of, you know, mechanisms that the mechanism itself might be good, but the implementation of it is bad and so fixing up the implementation ", "start": 2813.8423, "end": 3035.0955}, {"speaker": "0", "podcast": "and you making it more efficient. Yeah. This makes sense. So really just no major sweeping changes just really optimizing for efficiencies that you wish you would have put in place previously. Right? Yeah. ", "start": 3035.6267, "end": 3048.0925}, {"speaker": "1", "podcast": "Exactly. You know, And I mean, there's, you know, there's there's some usability things that come out of that. That I think will be significant, you know, ten x improvements and usability. But in terms of, like, functionality. It's the same functionality. It does the same does it in a much more obvious clean, efficient way. Right? There's there are some new things that I think will this will enable us to do. So, you know, alternate forms of collateral have a much bigger part to play in synthetic b three. So you know, eth collateral, L, you know, things like Rye, or whatever, like you know, they they're going to have a bigger role as I kind of alluded to as well, like permission asset creation is the thing that can exist in V three that con in in V two x. So there are some incremental functionality additions. So we're we're going, ", "start": 3048.8877, "end": 3108.9116}, {"speaker": "0", "podcast": "be able to implement. But fundamentally it's about just making this entire system much more efficient. That's exciting. And another question that I wanted to that you... We kinda touched on a little bit, but I just wanna, like, drill in and ask this question specifically. Right? Because we are in a bear market. And I think build the dip has been the theme at Poly gong that we've been pushing well like... There's it's been pushing all over Twitter, but we're we're focusing on it that Poly gun quite a bit. And I just wanna know, you know, what does build the dip mean to you? So, you know, ", "start": 3109.7605, "end": 3140.641}, {"speaker": "1", "podcast": "the as I as Sort of said, Right? Like, in a bear market, you can actually stop and you can take stock of all of the things that happened in the bull. Right? You know, so like, there are so many things that I'm just, like maybe casually aware or like, totally unaware of that are really interesting mechanisms or interesting, you know, like you know, systems that people have built or protocols or whatever. And know, if deep is about comp. If you don't even know what you can be composing you know, as part of your vertical, then you're not in a good place. Right? And so I think that as things slow down, everyone's going to have a chance to to kind of look around and go, oh, wait. That's a really cool way of doing that thing. Right? Or that's a, you know, that's an interesting approach to this specific problem. Right? And we've seen a little bit of that. Balance are, you know, implementing V vowel similar to the curve and you know... So we're seeing... But I think that this will happen over the next six to twelve months, like you know, on a much, much larger scale. There's so many smaller projects that are doing cool things that, you know, people are not aware of that people you know, will eventually have time to catch up on and be like, oh, no. This is actually a really cool approach to this problem. And so I think as you kind of become aware of those things, you can incorporate them into your, like, worldview. Right? You can be like, oh, this is an interesting design approach. Right? To this particular problem. And so everything gets better because people you know, can kind of look and be like, oh, this is the right. You know, governance, Right? We're going to have multiple different governance frameworks that I think will come out of this pool market that the next layer of D defy. Right? This this next iteration of D defy will be built on much more solid governance foundations than our you know, multi six all the way down approach that we had for the last two years, Right? We need to get rid of that, we need to replace it. We need to build a new clean foundation that is accountable to token holders that, you know, is much more censorship resistant and robust. And so things like that, I think will come out of this bear market, you know, and it'll will give us time to catch up and just incorporate all the new knowledge that's been developed over the last two years. Yeah. And you've been in a couple bear markets. And so ", "start": 3141.4365, "end": 3286.6467}, {"speaker": "0", "podcast": "I wanna know what kind of advice would you give to D defy founders or just protocol founders in general, like, what lessons have you learned over this this long period that you've been in crypto? What wise wise words do you have ", "start": 3287.3455, "end": 3303.461}, {"speaker": "1", "podcast": "for the future builders? I think you need to take stock of your particular situation. Is really critical. Right? There's no one size fits all approach, right? So, you know, you need to work out kind of... I think there's certain categories of things, right? Like, you know, like, look at your runway. Right? If you have six months of runway right now, for whatever reason, then you need to be making some decisions to try and work out how you extend that. Right? You know, lower your burn or whatever. If you are maybe past that point where, like, your protocols been around for a little bit longer, you know, the treasuries in better shape, you know, accumulated some stable and hopefully, you weren't sitting all in eat or whatever. You probably need to look at, you know, the the shifting situation in terms of hiring. Right? Like, there's gonna be much, much more opportunity for you to, you know, onboard some amazing talent, which is what Synthetic has been doing. You know, we've been we've been pulling new people in that are either web two or existing web three people that we're looking for something else to do or whatever. So, you know, we've added a lot of contributors of last, like, six to twelve months. And, you know, you just need to work out, like what your particular situation is and then optimize around that. Right? You know, So if you're D dive blue chip, I think you probably know what to do. Right? You know, you gotta you gotta, you know, take advantage of more attention, take advantage of you know, being able to slow things down a little bit. Fix up some of the processes make, you know, protocol more efficient. If you're you know, that next year down, but you still are really well funded. Now now's is time to try and, you know, acquire some amazing talent and and you know, take advantage of the lower noise floor to to build up a bit more awareness. And if you're in that, you know really early stage situation where you maybe you just raise a c brand and you're expecting to race. You know, another round in six months or whatever, survival is is really the key, right? Making sure that you're as efficient as possible and that, you know, you're you're gonna do something going to allow you to survive. Oh, that was a lot of good advice king. Thanks for that. Is there anything else that I didn't ask that you want me to that you want to touch on or address? Yeah. I think, you know, the thing that I I say to people in a bear market that is probably, you know, I think everyone right now in front of mind. Right? Like, what what do I do? Right? Like, what what do I do in the situation. I think if you're still hearing and you're listening, to this podcast cost. You're probably... You're probably Gm. But realistically, you know, comes down to conviction. Right? You really need to to survive a bear market and, you know, things could get worse before they get better. You need to have conviction. So you need to ensure like whatever the thing is that you're focusing on that you have built a level of conviction around that you know, if you think scaling is important if you think Nxt are important. You need to have conviction that, like, this is actually going to be transformative and, you know, in five, ten years time, you know, look back and be like, wow, Like, this is so early. This is such a huge opportunity. And you can really believe that and kind of you, pack that into like the core of your approach to to the space. You'll be fine. You'll find a way through. You'll navigate through because, you know, that that belief will kind of, you know, keep you focused on on the long term. So I think that's the thing right now. And one of the nice things is, you know, you can go back and go and, like, read some stuff, Read some why papers, you know, go back and catch up on you know, the state of the world. Right? And that will help to build conviction because the more you read about what's happening crypto over the last two years, the more exciting, it becomes, right? Like, we don't even have a sense of, like, everything that's happened in the last two years, there's no holistic view of it yet. Maybe Anthony San is one of the few people that got a holistic view of ethereum d five. But I think outside of that, there's not many people that have, like, the totality of what's happened deep over the last two years, right? So the more you read the more conviction you'll build, the more confident you'll be to go out and just keep grinding. And and, you know, get through the bear market and sur survive. Yeah. I could see On having that holistic view. I mean, when you're creating concerts is the renaissance man. ", "start": 3303.9133, "end": 3560.5757}, {"speaker": "0", "podcast": "Yeah. He is. I mean, when you're making content every single day. I mean, you've... You're you're gonna be up to speed on things for sure. Well, that's that's pretty much all we have. Kain, I I really appreciate you coming on the show. Thanks for coming on the Poly alpha podcast. And I guess what was ended off with where can people go to find out more about you and synthetic. Yeah. So synthetic discord, it's the best place for synthetic ", "start": 3561.308, "end": 3586.3845}, {"speaker": "1", "podcast": "And one of the most fun places hang out during bear market as well, I would say. One of the the kind of main places that people were hanging out throughout twenty eighteen, twenty nineteen. And then for me, at Twitter pat king ", "start": 3587.2236, "end": 3602.6895}, {"speaker": "0", "podcast": "is is the best place to find me. So... Alright. Well, thanks again, King. Coming on. Enjoy your lunch. Thank you. I'll see you next time. Yeah. Appreciate it. Talk soon. See you. Bye. Bye. ", "start": 3603.8809, "end": 3615.3372}], "summaries": [{"title": "1. The Evolution of Bitcoin as a Payment Method", "summary": "This text explores various aspects of synthetic assets and their role in decentralized finance (DeFi). It discusses stable coins and their importance on platforms like UniSwap, as well as the complexity of synthetic protocols and the need for simpler explanations. The text also touches on the distinction between price exposure and stake in synthetic assets, the existence of unconventional synthetic assets, the significance of liquid markets, and the differences in philosophy regarding upgrade contracts. Overall, the text aims to provide insights into the world of synthetic assets and their place in the DeFi ecosystem."}, {"title": "2. Exploring the Transition to Synthetic Assets in Crypto", "summary": "This text discusses the increasing acceptance and adoption of multi-sig contracts in the DeFi space. It highlights the shift in mindset towards better governance and the need for improved tools to address limitations in decentralized finance. The text also raises concerns about the reliance on multi-sig wallets and the lack of mechanisms to remove signers, leading to potential misuse of control. The author suggests a new governance module that allows token holders to have more direct control and accountability. Overall, there is a call for increased diligence and security measures in the crypto market."}, {"title": "3. Understanding Stable Coins and Synthetic Assets", "summary": "This text discusses the scaling of Synthetic in the bear market and the unique approach taken by the project. It explores the development of ethereum scaling and the various components of Synthetic, such as leverage trading and options. The text also discusses the evolution of projects within the Synthetic ecosystem, particularly the spin-off of binary options contracts. It highlights the selectivity of the Synthetic community in choosing layer two scaling solutions and discusses the concept of path dependency in startups. The text also delves into the complexity of synthetic systems and the challenges of deploying on a layer two scaling solution. It concludes by discussing the major changes in Synthetic V3 and the improvements in usability and functionality expected in the new version."}, {"title": "4. Comparison of Synthetic USD and DAI", "summary": "The text emphasizes the importance of making the system more efficient in the current bear market. It discusses the concept of \"building the dip\" and the opportunities it presents for reflection and learning. The bear market allows for the exploration of new approaches and the adoption of smaller projects. The text also highlights the advice and lessons learned by experienced individuals in the crypto industry, emphasizing the need for founders to learn from their mistakes and focus on building a strong community. The speaker provides advice for individuals in different stages of building their projects, emphasizing the importance of assessing one's specific situation and making decisions accordingly."}]}