{"podcast": {"title": "Polygon Alpha Podcast", "host": "Justin Havens", "image": ""}, "episode": {"title": "Understanding Layer 2 Risks | L2BEAT | Bartek Kiepuszewski", "number": "3", "date": "JUN 22, 2022", "description": "", "url": "https://www.youtube.com/watch?v=15xrqqAnGMY", "speakers": {"0": "Justin Havens", "1": "Bartek Kiepuszewski"}, "file": "june22.mp3"}, "transcripts": [{"speaker": "1", "podcast": "Welcome to the Poly alpha Podcast with the Poly community, gathers insights from today's leaders in centralized finance and crypto. I'm your host, Justin Evans, A aka crypto. Let's get started. Today's episode of alfa, by Bart is the of L two And a blockchain architect for Maker dell. Bart. Thanks for being here with us today. How's everything going? Good. Good ", "start": 0, "end": 36.399998}, {"speaker": "0", "podcast": "you know, things are not going as well as we would have liked them to be with markets. So this is probably a very rough time for us to have this conversation. But other than that, you know, we keep building. Yeah. Absolutely. There's no shortage of builders. I ", "start": 36.86, "end": 55.10646}, {"speaker": "1", "podcast": "recently went to the permission list Conference in West Palm Beach and then the consensus conference in Austin. And I think if you were to look around and through the conversations we having, you know, you you would have no idea what the price action is doing right now. Yeah. And also it does help ", "start": 55.481876, "end": 72.83068}, {"speaker": "0", "podcast": "if you've been through that a number of times. I mean, for me personally, this is like the third major drawdown and third major crash after twenty seventeen and then the Covid March twenty twenty. And this is the third and every time the market bounces, but it also flashes this out bad projects. ", "start": 73.20568, "end": 95.55156}, {"speaker": "1", "podcast": "Yeah, let's talk a little bit more about that. Like, what is your background? I know you are involved with banker Dow before L two beats, can you just give us a little background on that? My ", "start": 96.04332, "end": 107.86}, {"speaker": "0", "podcast": "crypto journey started more than five years ago. So I almost feel like an Og in the space. And actually before I joined Pan, which was, like I said about five years ago, I spent some time in a startup that was trying to visualize using blockchain technology, how people actually trade the energy that they get from their personal Pv installed on their roof. So that didn't really work because of the regulations and that was driven based. I mean, regulations are very, very complex in Germany, but that did give me a lot of exposure to the whole space. And then I moved to work for Mcdowell and I've been doing that ever since essentially. ", "start": 108.96, "end": 160.61519}, {"speaker": "1", "podcast": "You're also one of the founders of L two beat as well. So what, you know, what brought you? What's the store behind L two beat? ", "start": 161.10999, "end": 168.70999}, {"speaker": "0", "podcast": "Actually, this is a come on theme for Meg, which is kind of pioneering a lot of things. And it all started with a set of tools like the assess and other command line tools to query and to work with the Ethereum blockchain that was created by the Da hub and collectively it's called back tools, but it was like created because needed that, Right? And we created a lot of other tools well and this is how you know, when make want something and that something is not available on the market, it just tends to sort of fund the development of the thing and that thing becomes if this is good and needed, it becomes independent. And this is pretty much the story about L beat it all started with the need for of Me to the launch die on different chains. But in a responsible way. And by the responsible way, we mean that ideally the die that you create another change should be fully fungi of die you should create on the a main net, right? So when you think about it this way, then you come to realize that he'll really need to understand the security assumptions of those different chains because the that die on the main net, which you on main essentially as secure as the main net ethereum, which means that it's very secure, right? If you meant die on something which is much less secure and you want that to be fungi with l one die, you're essentially lowering the security of l one die to to this less secure chain. If you like. So that became, you know, a bit of a problem for us, and we ended up evaluating all these different chains. And the result of this evaluation, which we call a risk profile ended up in a spreadsheet that I created, I sort of published the spreadsheet that I tried to make people aware of that spreadsheets and I think maybe I managed to get like maybe ten people looking at the spreadsheets. So then I figured that maybe I should publish it as a website. And this is more or less how well be started, right? We took all the research that I've done, I managed to convince some my colleagues to help me create this website. And It ended up you know, being one of the ", "start": 169.34999, "end": 334.78043}, {"speaker": "1", "podcast": "most well known resources. If you really wanna learn about the security assumptions of different alt altitude. Yeah. It's definitely one of my favorite resources that I use when I'm trying to get, you know, just a little bit more information on layer two solutions. And I think that's interesting what you said because you're right, when you mint die on Magnet net, it's it's it says secure as the their in blockchain, which is very secure. But then with if you were to bridge it to, like, ar room or optimism or the Poly stake chain. The security properties of that asset are have have fundamentally changed. Right. Die on ar is not the same as die on the Poly proof of stick chain. And so that was kind of the reasoning for putting all this together is to I guess say, like, how what are the security risks ", "start": 335.31564, "end": 386.49026}, {"speaker": "0", "podcast": "between each shame once we put dying on all those change? Is that fair to say? Yeah. This is fair to say and I think the best analogy that I can come up with is when you take I don't know a mortgage in once banks, then you withdraw money and you treat as fully fungi with the money that someone else's got from some other bank, right? And if your bank is very insecure and it just means S dollars out of Senior air, and obviously that has a very significant impact, on the whole dollar ecosystem if there was no limit to how much this bank could have print it, right? So we kind of assume that these banks, even though they can print dollars, they do it in a way, which is sound is secure and they have one of operational processes that they use to actually secure their accounts. On blockchain, with don't need, and we don't want to have a trust third party to kind of regulate us, but we do have technology that we can evaluate, right? And we can see more or less what are the security assumptions. So so that's the best analogy I can come up with. And and it's not just about bridging the chains. We're thinking ultimately also about augmenting that not the change, which you will be able to bridge back to ethereum. Right? And that die that you say mint it on, let's say, optimism, if you bring it back to Ethereum, it will be the same die. Stiff. ", "start": 386.86337, "end": 489.06448}, {"speaker": "1", "podcast": "It's also interesting that, you know, when I think of Maker dow, I also think of compound in a way in the sense that you're not available on any other side chains or L once. Right? You haven't deployed out there. Why do you feel like do you feel like that there's similarities between Micro dial and compound in that sense from a security standpoint or why do you feel like both of you together have chosen this strategy. I cannot say ", "start": 490.4825, "end": 518.87775}, {"speaker": "0", "podcast": "why compound did not go to chains. The closest protocol compound Isa cassava and it does. And these markets are fairly isolated you sa on on Ethereum, this is... You can say a different other than other on, let's say, Poly, right? Or other an optimism. And the reason why you can do the or you can easily move, let's say uni swap or any other Am am To other change is that you're essentially copy pasting smart contracts and these systems are fairly isolated. And as I said before, for maker is a little bit different because the primary function of maker is the mint die. Right? So if you just copy paste that maker on, let's say, Poly today, that's like super easy that would take us probably a few days to do it. However, the diamond it would not be the same as time on one, right? It would be essentially a different token with different security properties and and It and it's just not just about security. It's also about the peg. So you may have d that the ethereum version of like keeping the pack, right? Whilst the die on another chain may lose the pack and you don't want that. Right? So I mean, like I said, I mean, the ideal world that we wanna sort of try to move towards to is that for end users. It doesn't really matter where you keep your die, It's die. Right? This is this permission currency that should not be censored by anyone and should be always backed up by the plate of either collateral or the plate. ", "start": 520.0524, "end": 631.45996}, {"speaker": "1", "podcast": "To essentially pay off the loan. So let's move over to later two's. What is L two beats definition of a a layer two? And then I think there can be some confusion in the space some time, maybe not with the people who are still around in this bear of the Poly proof of steak chain. And why that's not considered layer two necessarily by L two beat, I understand why we would also be interesting to hear it in your own words as well. So what are layer two solutions? And then how would you compare those to the Poly on proof of steak chain as well? So so fast, we kind of follow the definition from material foundation in that ", "start": 633.31085, "end": 678.5792}, {"speaker": "0", "podcast": "layer two solution should somehow leverage the security of the main ethereum. Otherwise, it's just here, the side chain that lives independently and by whatever bridging technology you use, know, it might allow you to bridge us is back and forth. Right? But the security of these assets are essentially up to whatever the security mechanisms is deployed on the side chains. With flyer 2s, ideally, we'd like to have... And I say ideally because we still have some ground to cover to actually get to that point, but ideally you'd like to to leverage the security theorem. And for us, this is really about two things. It's about the state validity. So we want to make sure that the state of L two chain is somehow validated it on L one ethereum, right? So that there is no like I don't know additional validates or there is no additional consensus mechanism needed and we want to make sure that it is indeed one validates are one miners who are responsible for making sure that the state of L o2 is valid. And this is important because if you think about why do you want to make sure that the L two state should be valid, right? This is all about the potential power to either mint tokens out of the Thin air or to steal tokens from your account. In other words, to to transfer tokens from your account without your signature. Right? So these are the two major examples, how you could potentially steal tokens. If there was no validation of the L two state. So that's like one thing and the other one which is like somewhat related. But independent is that data availability. You really want to make sure that if L two block is produced and that block campaigns and transactions an independent observer should have access to the content of these transactions. And this is important to then try to figure out if the state transition is correct, right? So these two things are related somehow, but they are fairly independent in the sense that we see constructions that use see through L one for state validation. However, for data availability if they might use some other mechanisms. But pure roll ups and constructions that we call pure roll ups, which we consider to be the more secure scaling technologies. They would use l one insurance for both state validation and for data availability. ", "start": 679.27563, "end": 851.1412}, {"speaker": "1", "podcast": "Okay. Yeah. And, things you for that definition. And L also goes through the risks associated with those later two scaling solutions. Right? So can you also just kinda give us the category of them, I guess, just the main types of scanning solutions? And then can you also lay out just some of the potential risks that you identify ", "start": 851.6765, "end": 875.38153}, {"speaker": "0", "podcast": "on the website. So like I said, I mean, given these two components, state validity and data availability. We can create almost like a two by two metrics. And this is probably the easiest way to think about these systems. So when you get the new construction, the first questions that we ask is, you know, how the L two state is validated, Right? Var two known techniques on one to validate to state and one is valid proofs. And this is sort of the realm of the Z roll, the zero knowledge, that the moon math and whatnot right. And the other technique is fraud proofs or fault proofs. This is the new terms that people are using for whatever reason the fraud. Has a bad connotation. So the first question, you know, the new project comes to us, we ask this question how the state is value that's right. Is it a fraud proof or is it the validity proof? Because if it's neither then that means essentially your state is validated by an external consensus, which by the way is the case of poly proof of stake. And for us, that just means that, you know, you're essentially not leveraging ethereum security. Right? And it doesn't really matter what you used for availability at that point. So this is the first course. And the second question is how to do you ensure that availability And here versus like a broad range of options? Ideally, the data will be posted to L one ethereum and this gives you like one hundred percent guarantee the data will be available to end anyone that needs the data. If you use some external systems then obviously you are introducing some external current assumptions, right? So these are the main questions. And then you sort of go a little bit deeper and you have to kind of go into the details of the architecture of the whole solution, right? And probably the right question, the right next question to us could be what are the permissions entities? And what they can do And what is the risk associated with them mis behaving. So the typical permission factor would be the sequence. That essentially sequences transactions and create blocks on L two, but you might have also a permission set of validate. You might have also permission set of admin accounts that can upgrade the system, they can change system parameters and whatnot right. So This list of permission accounts and favor is something that you really really need to understand because you can have like super secure construction. However, if there's an admin key that is allowed to upgrades the whole system, it can upgrade to something which is completely secure. Right? And unfortunately, this upgrade power can potentially be used to to create a backdoor the system that wise would be secure. Right? So these are the main kind of things that we look at. And then I guess we sort of drill deep into the details of each of these areas if you like, right? And we always take this users and I think scientific view, like we ask ourselves the question, okay, what are the ways that you can potentially lose your assets. Can you be censored by a centralized actor, right? Can your us is bit potentially frozen? What happens when the sequence goes down? If versus centralized sequence, right? What happens if you're trying to bridge your assets to this chain and then enough nothing happens. So you know A user, you would experience this as, I don't know. A transaction does not get processed. Right? What do you do? Is there any anti sense mechanism can potentially use? In other words, what are the worst possible scenarios that can happen? So we're not that much interested in a happy case. We are interested in those scenarios when things can go really, really wrong, either because there's a bug or because you know ver some malicious actor actually trying to do something really bad. ", "start": 875.83606, "end": 1158.9519}, {"speaker": "1", "podcast": "Yeah. And throw all that research, well, it sounds like y'all are doing a a lot of work, which is a huge asset in the space. Absolutely. Where are you getting the information for... You know, I know you're probably talking developers and looking at their their get a repository and probably Ether scan. But, you know, like, the developers could have their biases and I guess that Ether scan is a centralized service as well. So are you doing your own audits on this or how how deep down, Are you digging into this data? So this is a very good question. ", "start": 1159.5245, "end": 1197.6235}, {"speaker": "0", "podcast": "And I certainly would not call the works we're doing and audit because all are meant to essentially check if the code complies would be whatever the specification the system has. Whereas while it's what we are doing, we're assessing the qualities if you like of the architecture, right? And normally, we do it by reading the source code of contracts that are deployed on the main net. We are mainly concerned with the contracts on L one because we have no easy access to the L infrastructure and also end users, they have zero access to the L infrastructure and and this is the whole point of the whole exercise, right? It's l one that should secure the whole system. So regardless of what's happening on l two, your funds should be secure. That's the whole idea, right? So we take the l one centric approach. And Ideally, we would read the source code of a contract that is actually deployed one, right? So the prerequisite it would be that the contract to be verified. And yes I do admit that we do depend on If a scan Ideally we should like rev verify that indeed the source code that's available on it scan is indeed the same. As the deployed byte code. This is a very easy check, right. It's much, much more difficult when the contract is not verified and we don't have an access to the Source code, then we simply review the list the roll. If that's the case. And frankly, in my personal opinion, you know, this is not too big of a ask to the team to actually make sure that know and users have access to the source code. And like I said, not through the github, but, you know, we want to make sure all there's whatever is deployed. We can read the source code of that system. Also, Github doesn't give you access to the important system parameters. Right? And with the deployed code, we can actually check the, whatever the parameters are there. ", "start": 1198.1821, "end": 1335.1552}, {"speaker": "1", "podcast": "Okay. And another thing I wanna touch on is data availability and why that's important. And also because Poly has Poly gun avail, which is a data availability solution, not an L two, but a a scaling solution, which is what we like to say. That's what we specialize in. So yeah, I just wanted your get your opinion on that, what is data availability? Why is it important? Is ", "start": 1335.9552, "end": 1362.2151}, {"speaker": "0", "podcast": "especially for layer two solutions. Yeah. This is a good question because, you know what I I already found that this is probably one of the most confusing terms to do a lot of people and in my opinion, the term itself it's kind of unfortunate a little bit. Because it's very broad. However, we actually use it in a very narrow sense. When we talk about data availability, What we actually mean is the that when a new block with new transactions is being announced to the outside world and is being published, we want to make sure that if anyone wanted to look inside that block and they wanted to look inside every any transaction inside that blog. They would be able to actually get, you know, the details of that transaction. Right? And for most people when they are using criteria ethereum, it, sounds almost like like an obvious thing. Right? I mean, you go to Ess scan, you click on the plug, you click on the transaction. And then when you click on the transaction, you'll see exactly. From to what are we call it a payload, right, which is essentially how much are you sending and? And then you also see the call data, which essentially is the content of the transaction, and this is almost like an instruction of what to do with this transaction. Right? And when you think about all these transactions when you combine all of them, they will move the serum state from state A to state b, right? All these transactions will change, balances will some of them might. Some, some of them might burn, some tokens, some of them might swap some tokens. But the end result will be to essentially start from state A, process all these transactions in the block and then announce that the new state is state b. Right? So imagine that, you know, some entity announces, hey. Here's the block that moves state A to state b. And your new balance is this, but that entity does not really show you the content of the block, right? It would be a safe. You logged into your bank and bank would tell you your balance is I don't know, fifteen hundred dollars. I mean like why? I mean, yesterday, I had thirty, Right? But there was no explanation because you will have no access to, you know, transactional history. Right? And he was a know really why your balance changed from fifteen hundreds to whatever. So most people take it for granted that you know, when you click on the transaction, you will get the content of of this transaction, but it's not actually the, you know, systems are creates. It's right. It's perfectly possible to create a system where you just announced the new state, but do not really re reveal the content of the block and you don't reveal the content of the transactions. So why it is important to reveal not just because you're curious, but you just want to make sure that this state transition from state to state b valid. And those only one way to do it and that is to actually, you know, look inside the block and try to re execute all these transaction. Right. So this is more or less the the strategy of all the optimistic ups and independent value data should be able to look inside the block they should be able to look at every single transactions, re execute them and they would be able to find out if indeed the State b Is correct. Z also are a little bit different, but they also need this property. They also need the data availability. They need independent users to independently recreate the most recent state of the whole product. ", "start": 1362.6538, "end": 1611.5165}, {"speaker": "1", "podcast": "That's that's helpful. And yeah, I think I think you're right. That's maybe data availability is maybe a little bit of a mis number. I mean, I don't know. It it makes sense, but it's like ", "start": 1612.406, "end": 1625.3235}, {"speaker": "0", "podcast": "cryptocurrency is more than just currency too. Right? So... Yeah. And my my opinion, you know, a lot of people are confusing this with, like like an archive of all the transactions. Which is a little bit different property. And this is something that a lot of you got don't realize and they keep asking questions such as why don't we use? I don't know Ip efs, right, for data availability? Why don't we like post the data? I mean, the content of all these transactions to some sort of vol system. It doesn't really matter if you said, like centralized decentralized, you know, this is a broad discussion, but they are confusing the need to look into the most recent block with the need to sort of browse the history. And these are two different needs, right? So when we talk about the data availability, we are mostly concerned with the most recent blocks because we need to make sure that the state which is announced is valid. And we want to be able to validate the state. Right? So this is what we are really very interested in. Whereas, if you're interested in in in, you know, like, finding out what happened on the theory a year ago. Then you do need some sort of archive knowledge or whatever or some sort of a, you, system that keeps all these all transactions, but you can definitely certain it can be definitely certain that if blockchain was essentially processed a year ago and no one was complaining, right? That probably means, I mean, that means hundred percent that all these transactions were available and the new states that was like announced a year ago. Was valid, Right? There's no need to rev reevaluate that state. ", "start": 1626.1008, "end": 1735.1077}, {"speaker": "1", "podcast": "Yeah. That yeah, that makes that makes sense to mean thanks for el collaborating on that. And so when I look through L two beat on the website, you know, I see I do see poly hermes on there. Which is great. That's one of our Z k roll ups. And then I I get a little excited because I'm thinking Poly Mi, Poly zero, Poly nightfall fall, will all eventually be on this list. And then I scroll... Keep scrolling all the way down to the bottom, and then I see fuel. Which has eight dollars in it. And you've got a pretty interesting story about fuel if you would wouldn't mind sharing it. Okay. So fuel, in a way, you a unique ", "start": 1735.7462, "end": 1774.6501}, {"speaker": "0", "podcast": "system. It's called V one. I'm not really sure why it's called V one, but fuel team insisted that it's product and grade system. The problem with fuel the main problems is that no one's is actually using it. Right? And I'm not really sure if that was actually intentional, but fuel view one is the first optimistic crop up deployed on ethereum and it's also fully and there is no permission actor at all. Right? So far no upgrade keys, there is no multi sig that connects change, that system there no centralized sequence, anyone can post L two blocks and anyone can challenge the new L two blocks, right? So you would think that this is almost like an ideal optimistic crawl ups. The main problem with it is that you can be all used for payments. So it's not extremely exciting. And this is probably one of the reasons why people just did not use it at all. And that eight dollars that's actually I think that I think that must have been put by the actual team about a year and a half ago, maybe two years ago because this is literally when the system was deployed, Right? So being an optimistic crawl up, anyone can try to post an invalid state and you would hope that someone will like challenge you, right? Someone will host a fraud proof, proof that the states invalid. And when someone does that, you as an entity that's posted value state you will be slashed. Right? This is more or less the assumption from optimistic crawl ups. So again, anyone can post a state and anyone observing the train can challenge you. And if you are lying, you will be punished. But this is how you still tokens from mystic, Right? You try to post invalid state. So we kind of figured that since no one's using this and this eight dollars is a very low value, no one would pay any attention and no one would like look into this chain. So you wanted to steal that eight dollars by essentially posting invalid state. Versus delay period that gives on its value time to sort of catch the thief if you like. Right? But you know, our assumption was that since Was using this strain, no one's watching this train. And we did post an invalid state and we waited. And we waited. I mean, normally, I think you have to wait two weeks, maybe this chain is set up big extremely conservative. But I think after fifteen seconds there was a transaction of something that essentially posted a approved that we committed a fraud, on this chain. So we literally lost house and ether because that was essentially the bonds that we had to pay to caused the your state, right. Essentially what was meant to be a story of how important is to have those waters, those independent entities washing chain and the chain can be abandoned. So maybe cost cure. Now it's not the secure. That was the whole intention, right? I mean, really thought that we would feel the same dollars, we would create a publicity around this and people will be like discussing how do you make sure that these independent and this are watching the chain? Well instead, we got slashed. We got cold red handed. We lost hal ether, which was essentially punishment for us. And as you can see, eight doubt is still sitting there, right? So made be it's almost like a bounty, for we good to try out. But to me, it's actually proof that optimistic roll. They are also very secure. And these are very, very valid constructions. ", "start": 1775.8848, "end": 2042.2452}, {"speaker": "1", "podcast": "Yeah. I I heard you tell that story on Chris X podcast. And I thought that was really fascinating because no one's gonna miss that eight dollars, but it's... It's an exciting experiment for y'all to test that out. And so you mentioned that, you know, I'm an optimistic roll up you need to you need to post a fraudulent state route to try to steal tokens. And so what what would be the equivalent on the Z k roll up? ", "start": 2042.7385, "end": 2068.9004}, {"speaker": "0", "podcast": "Z k roll up, actually, it would be quite hard to come up with an equivalent because the validity of S is actually short by the fact that you don't just post a new state. You have to post crypto prove does secret prove that your state is actually valid, right? And the smart contract on one does verification of that zero knowledge proof. So this type of attack would definitely be not possible on zika ops. He would have to rather try to find a bug either in in the verification logic on a one or in the whole construction like like the math behind the whole construction. I think this is actually much, much harder. And doing so would probably require you to well, I mean, to three understand the single line of code of both K and the ver verify and and also to find the flaw in math behind them and that probably would be much much harder. For sure. Right? I I I would certainly be not the person that would try that. That's not to say that it's impossible, but But I think, you know, the complexity of the it can roll is something of a, you know, of a problem for potential hackers. They would have to actually you know, put a lot of, yeah effort into into trying to find a bug with with very a little chance of actually doing. So right? So if you wanted to attack Zika roll up, probably or better option would be to try to see if the some other, you know, actors maybe admin factors that allow for upgrades, these types of things rather than just the math behind them. ", "start": 2069.6306, "end": 2204.421}, {"speaker": "1", "podcast": "Okay. That's that's interesting. Yeah. And this is such a a new technology in this space. Or I guess it's been enough for a long time. People been developing it, but it's... It's so hard to find education on L twos. And I feel like, well, the ethereum foundation has some great resources, but this is also great. Information too on L two Beat. And again, thanks to you and your team for putting all this together. And you're also looking at doing putting a section together for l two bridges. Is that true? And can you just elaborate on that a little bit? Why that's important. Yes. ", "start": 2205.231, "end": 2239.9785}, {"speaker": "0", "podcast": "So I mean, you can see... Well, first of all, you can see these constructs as bridges as well, weirdly enough because essentially what the bridges is. It allows you to move your assets from from one to some other blockchain. Now these roll ups, they all come with what we call a native bridge, right, which is essentially the infrastructure that allows users to move assets across. That's the whole point of having a roll instead of independent chain, right? Independent change can like run independently and and they are meant to be used by side in a way. Why these are meant to essentially take your assets from Ethereum, move these assets to to l two and and give you this boost in computational power in the are meant to cheaper and whatnot right. But essentially, the user experience should be more or less the same as. And so in a way, these are bridges as well. Everything single overall up comes with native bridge. And then you've got some other bridges and there are different types of bridges, different classes of bridges and what we found talking to a lot of people is that, well, first of all, it's very hard to build a roll up. It's much, much easier to build a bridge, right? So you have many more bridges than roll. And then these bridges also have different security properties and different security assumptions, people don't seem to be aware of them, and they do like how we describe the risks they do like our risk frameworks. And we've been approached by a number of bridge ag. Interested in linking to the risk frameworks that would be similar to what we've got follow ups, but it would be applied to bridges. So they would distinguish between the bridge that has some sort of multi in the middle versus the bridge that is doing some kind of an optimistic verification, somewhat similarly similarly to optimistic roll ups. Versus the bridge that would use as your knowledge technology or what we call a light client verification, right? The bridge that would essentially verify the consensus on other chains, which in the sense, these rollout do So we looked at the problem and we found that indeed this is a very somehow natural way to extend this framework. And we will be launching the bridge version of this in probably few weeks, I hope. And it will be a much longer list with more bridges, I guess. And people will be able to essentially learn, what are the security assumptions associated with these bridges? Mainly can they assets be stolen, can they are transactions can they be censored? And So that the idea is moved to essentially build something very very similar. Right? ", "start": 2240.616, "end": 2448.3738}, {"speaker": "1", "podcast": "But for bridges. Are these bridges just for Ethereum to layer two's? Or would it also be right, like, from Avalanche to Sol? Or what what's the focus there? Because I feel like you just like poly got proof stake, not being considered layer two, You've got draw the line somewhere. So where's the line drawn for y'all on that. Yes. So for us, the natural way of thinking about it is we would list bridges ", "start": 2449.331, "end": 2476.2202}, {"speaker": "0", "podcast": "that take our assets from ethereum to anything really. So the poly post bridge would be a perfect example of very good bridge with a lot of Tv or Tv locked in the bridge if you like. And people might be interested how this bridge actually work. One the security assumptions is multi with the upgrade power and whatnot right. There have been a lot of discussions about the multi six, almost every time we point out that like E account with the upgrades possibility, teams very quickly upgrade that to some sort of a multi So I mean, this is, I think important for people to know. It's also important what we to know if the smart contracts. That bridges use? Are they verified or not? And also what are the actual security assumptions, right? Who do I need to trust when I bridge my assets? So funny story, And I hope that no one takes it as a thought of anything, but I was trying to move my ease some of my eve from the main to optimism and have two different options on their Ui. You can use what they call bridge, which essentially is the native bridge here. And they also have what they call a warp, I think, bridge. Which allows you to move small amounts, but you know, it's supposed to be much cheaper and much, much faster. Right? Like standard bridge would probably take ten minutes. The war bridge is supposed to take one minute or less. Turns out that, you know, when I tried to use it, my transaction got stuck for I think hours. So the bridge that was supposed to be fast, right, took much, much longer than the standard bridge. So users I think should be word that everything comes with certain assumptions. Right? And the standard bridge will always process my messages. Because otherwise, it won't process anything Come mean the Whole plus stop. If my process whereas the War bridge, I'm entirely dependent on some sort of a intermediary and it just happened that this intermediary like crashed failed whatever was offline. I don't even know what happened because I have no way to to check. But but my deposit wasn't processed, right? Not just mine. I think thousands of other deposits were not processed, but But the value of this intermediary area essentially means that your funds will be stuck. And if this failure is permanent then your funds might be stuck forever. And that is a big contrast to you know, to the stand to bridge. Right? So I guess, you know, if you're like moving, let's say, one hundred dollars, you might be okay, will this potentially got the scenario that you're intermediary disappears, right? But if you're moving bigger funds, obviously, you should know that the success of your deposit is entirely dependent on the honesty of this intermediary. ", "start": 2476.5203, "end": 2686.4663}, {"speaker": "1", "podcast": "It's a fully trusted system. Oh that's that's really interesting. And yeah. Bridges is something that I've been looking to dig a little bit deeper into for a while now, but I think I'm gonna sit back and wait for y'all to deploy your your your bridge website or your your report on bridges. I think that be pretty helpful as well. For users and developers alike. Right? So it looks like we're we're starting to run up on time a little bit, Bart tech I really appreciate you coming on the show. Is there anything that we... I didn't ask or I didn't touch on that you want to address? I guess, ", "start": 2687.5178, "end": 2725.0063}, {"speaker": "0", "podcast": "with L b, which turned out to be much bigger than we expected. You know, we found that there's a huge niche for people that on the one hand, they understand very deeply the solidity and and the logic of all the smart contracts. Right? And they are able to translate that knowledge something that is sort of like digestible for end users. And I think this niche is very important and we call a lot of encouragement from a lot of people to continue this work ranging from it foundation. Teams, that the roll up teams, Poly as well, obviously and individual uses. And I mean, at that point, you know, I can say is that you know the team at This know, huge need of of like getting more people on board because like I said, I mean, it seems like we actually are doing work that that's needed, right? And if you're interested, if anyone interested in joining this team and help us to work on not just roll ups, but also bridges and maybe some other aspects of the decentralized finance and coming multi train ecosystem. Just please do reach out to us because like almost everyone else we are hiring and we'd love ", "start": 2726.1965, "end": 2822.266}, {"speaker": "1", "podcast": "to have more on boards that actually contribute this project. Absolutely. And on that know, where can people go to find out more about you l beats and we'll say maker down as well. We do try to respond to ", "start": 2823.3462, "end": 2836.872}, {"speaker": "0", "podcast": "to direct twitter messages. We do have our own discord. Mega is obviously a different story in inverse it's a proper dial with hundreds of people who actually contributing to the Dow and I lost count, but I think maybe thirty, forty independent what we call core units doing all sorts of things. So it don't have to be developed to contribute to Mcdowell a lot of work involved with growing the ecosystem with ranging from risk management Hr to actual technical work. So first place for everybody and almost everybody hired themselves into these organizations, right? And is very, very different experience than if you say wanted to work for some sort of a traditional commercial organizations. You would have to go through the traditional recruitment process here. Just join the forum. Make sure that you've heard on discord, just joined the live community calls. Just learned the ecosystem, get to know people, go to a conference. I think half of the make dial and hundred percent of the L it will be in Paris, that's very soon, right? And just talk to us. If you really interested in joining the working for either make hour or L. I think that's very easy. Just need to reach out and just out that to your passionate and yearly. ", "start": 2837.4858, "end": 2936.7717}, {"speaker": "1", "podcast": "Are interested in this space. Awesome. Well, thanks again, Bart for hopping on. The work are doing is an incredible asset to the space. And really appreciate it. And, yeah, thanks for coming on. I'll talk to you next time. ", "start": 2937.264, "end": 2950.387}, {"speaker": "0", "podcast": "Alright. Thank you. Bye. ", "start": 2951.104, "end": 2952.3936}], "summaries": [{"title": "1. Exploring the Journey of Bart, a Blockchain Architect, and the Impact of Conferences on Price Action Awareness", "summary": "The Poly Alpha Podcast features an interview with Bart, a blockchain architect, who discusses L2 and centralized finance in the crypto industry. Despite challenging market conditions, there is a strong commitment to growth and development. Attending conferences can provide valuable insights, but may not keep attendees informed about current price action. The author reflects on their experience with market crashes and highlights that they can filter out unsustainable projects. Bart shares their background in the crypto and blockchain space and discusses the inspiration behind L Two Beat, a music store."}, {"title": "2. Evaluating the Security Risks of Different Chains for Launching Die Tokens and the Importance of Secure Banking in Blockchain", "summary": "This text discusses the origins of Lido, a platform that evaluates the security of different blockchain networks for launching Die tokens. It emphasizes the importance of understanding the security assumptions of different chains and the need to assess the security risks associated with different altitudes. The text also discusses the importance of secure and trustworthy processes in blockchain transactions, similar to secure banking. It mentions the challenges of moving Compound to different chains and the importance of maintaining the peg of the token across different chains. The text also highlights the need for clarity and understanding of layer two solutions and the importance of leveraging the security of the main Ethereum network."}, {"title": "3. Understanding the Importance of Research, Audits, and Source Code Verification in Evaluating Developers and Blockchain Data", "summary": "This text discusses the importance of state validity and data availability in Ethereum systems. It explores different scaling solutions and the risks associated with them, emphasizing the need for thorough research and audits. The text also highlights the significance of verifying the source code of contracts deployed on the main net for system security. It discusses the role of data availability in ensuring valid state transitions and the potential misinterpretation of its importance. The text distinguishes between cryptocurrency as a form of currency and its role as an archive of transactions, emphasizing the need for both current state validation and historical transaction data storage."}, {"title": "4. Exploring the Availability of Poly Hermes and Fuel, and the Challenges of V One Fuel System on Ethereum", "summary": "The text discusses various aspects of blockchain technology, including the presence of Poly Hermes and Fuel on a website, the challenges faced by the V One Fuel system, the difficulty of attacking the Zika Roll Up, the lack of education on Layer 2 scaling solutions, the concept of bridges in blockchain networks, and the importance of understanding the security assumptions and risks associated with Ethereum bridges. The author emphasizes the need for independent entities monitoring the chain and highlights the risks of relying on intermediaries when using bridges."}, {"title": "5. Opportunities to Contribute to the Mega and L Ecosystems and the Importance of Bridges in Technology", "summary": "This text discusses the various ways individuals can contribute to decentralized organizations like the Mega and L ecosystems. It emphasizes that joining these ecosystems does not require a formal recruitment process and highlights opportunities for individuals to contribute in areas like risk management, HR, and technical work. The text also mentions the need for more people with specialized skills in smart contracts and decentralized finance, and encourages interested individuals to reach out for potential job opportunities."}]}