{"podcast": {"title": "Polygon Alpha Podcast", "host": "Justin Havens", "image": ""}, "episode": {"title": "Impermanent Loss Protection & Single-Sided Staking | Bancor | Mark Richardson", "number": "1", "date": "JUN 1, 2022", "description": "", "url": "https://www.youtube.com/watch?v=15xrqqAnGMY", "speakers": {"0": "Justin Havens", "1": "Mark Richardson"}, "file": "june1.mp3"}, "transcripts": [{"speaker": "0", "podcast": "Welcome to the Poly Alpha podcast. This is where the Poly community gathers insights from today's leaders into finance and crypto. I'm your host, Justin Evans, aka Crypto. Let's get started. On today's episode of Poly alpha, we are joined by Mark Richardson, who is the head of Research At Ban. ", "start": 0, "end": 29.622427}, {"speaker": "1", "podcast": "Mark, Thanks For being With us Today. How's Everything Going? It's A pleasure to be Speaking With you Justin. Thank you so much for Inviting Me On. ", "start": 30.420523, "end": 36.086998}, {"speaker": "0", "podcast": "Yeah. Absolutely happy to have you. So where are you right now? What are you doing? There's kind of a conference circuit that I'm completing right now? ", "start": 37.454998, "end": 43.71423}, {"speaker": "1", "podcast": "And so we just had commission lists recently in in Palm Beach in Florida. And I'm actually I've just arrived in London, just about an hour ago. I have a a Faint link meet up there. With the the community and with the community in London. And then I'm heading on to Switzerland for Crypto Valley. I've got two keen presentations there. And then I will be coming to back to Austin in Texas to participate consensus. So it's about about a month long trip of of different crypto conferences that just you know, happens to be pretty well timed with the launch of our Version three, which is which is a nice coincidence incident. ", "start": 45.002663, "end": 86.70729}, {"speaker": "0", "podcast": "Yeah, That is a pretty nice coincidence. So it's a coincidence that get you traveling all over the world, which I guess is nice, then probably suffering from a little bit of lack of sleep as well I can imagine. Let's get into your background mark. You know, how did you get into the the space and what led you to joining all of these conferences in the same month. ", "start": 88.32001, "end": 107.16132}, {"speaker": "1", "podcast": "My background actually isn't finance economics. I did a some... I did my batch in in advanced chemistry. I did a Phd in organic chemistry. I did my first post talk stint Uci in California, where I also was electro lecturer for the organic chemistry department for two years. I then came back to to Australia and was working for the Commonwealth Scientific and industrial Research organization. I had a three year contract there to which happened to coincide with the beginning of the twenty twenty pandemic. And I didn't really have I wasn't allowed to go into work a lot, the place where I was living broke the world record during Covid for the the longest contiguous lockdown. Right? So it was that twenty four months of people not being really being able to shop to work. And so, I was feeling kind of useless. I wasn't I wasn't feeling very good about you know what my you what my career would look like after Covid being that that it had this huge interruption. And so I started to spending a huge amount of time trying to find all the ways to be productive. One of the things that really caught my eye was the the cryptocurrency and blockchain industry. And I spent a lot of time hanging out on different discord in different telegram groups. And, you know, following different Twitter influencers. Ended up associating myself with a bunch of different da, including Ban orders when it launched its version two point one in October. Of twenty twenty. And so I after the product was out. I had a, you know, a few things to to say about it, I did some sort of analysis with it while I was just a community member. And by that Christmas, I was in like sort of regular meetings with the Ban founders. And the Ban foundation, which is the profit swiss organization offered being a full time research contract beginning January of twenty twenty one. And so since then, I've kind of become the head of research and the product architect. So most of the design principles behind Version three were my own. Obviously, it's a collaborative process you know, the the there's everyone had a little bit to put in. But sort of the overall, you know, design is is is essentially my responsibility. And and yeah. And so far so good. I think I'll just continue like this for for. As long as I possibly can, I'm still enjoying myself, It's very stressful, but also very rewarding. And, yeah, I... I haven't looked back on my science careers and studying. ", "start": 107.7974, "end": 279.24536}, {"speaker": "0", "podcast": "Yeah. That's interesting that twenty four months lockdown period. I'm assuming that was related to Australia. And I think if I look through just in my head, the crypto space in general. There's a lot of very... I don't know, very well to do Australians in the space, thinking of, like, Anthony Susan, Joe Flanagan, Sydney Pal, yourself, Mark, and then Kane and Kirin, both of those. Do you think the lockdown had something to do with that? Or why do you feel like... Or or why do you think there's so many Australians there so involved in the space and making a name for themselves. Yeah. It's really good question. It might have had something to do with the lockdown. ", "start": 279.89697, "end": 319.47165}, {"speaker": "1", "podcast": "The, you know, if the twenty four month lockdown was you know, and and that's a slight exaggeration It was probably... It wasn't quite twenty four months, but we'll say that it was. That was exclusive to the city of Melbourne which is where I was living. So it wasn't an Australia wide thing. But I think that there's a couple of reasons why australians want to gravitate towards it. For one, our government is pretty, you know, crypto a positive or crypto. You know, so they they aren't, you know, threatening sort of, you know, sweeping regulatory changes that, you know, would have the potential to ruin you know, people's lives that they're generally pretty pragmatic when it comes to, you know, taxing and crypto stuff. You know, they allow people to set up you know, things like consulting companies and things that can manage crypto assets under under that name and, you know, Pay tax the same way that any other, you, incorporated entity would within the Australian. Taxation legislation. So, yeah, I think it's it's at least partly because, you know, the the laws and tax regulations are so clear and so easy to navigate, which isn't the case everywhere in the world. But I also think that you there's also like a pretty know, a pretty robust reservoir of talent for for things like It and and programming in in Australia. I think that is well. Australia is like is, you know, it's a very big place. And if you are used to sort of the normal sort of nine to five jobs. And if you wanted to do something that, you know, applies your mind in a very focused way, you generally have, like are forced to live in a major city. So for example, you can imagine being a university researcher, something like that or maybe like, a, you know, a medical researcher, you basically have to be very close to those facilities. This is no way about it. Right? You can't do medical research remotely from, you, the, you know, you know, from a small town that's like a few hours drive out of a major city. But in blockchain, that's totally acceptable. Right? It doesn't really matter where you live. So you can do something that is like has a very high academic profile. And, you know, that applies a a very hard one faculties. But it doesn't require you to move into a major city and pay the the prohibitive higher rent that they that they're asking there. So that might have something to do with it, But I just a trend that I've noticed as well. I'm not entirely sure that I have a a compelling explanation for it. But, you know, maybe the things that I've mentioned are are getting closer or maybe they're not will maybe some future historian we'll will tell us what they think it is. ", "start": 320.26883, "end": 492.05545}, {"speaker": "0", "podcast": "Yeah. Maybe so. And you do have a very strong educational background, and I feel like a lot of people in the crypto and D defy space come from all walks of life. But I'm curious, you know, in your opinion, do you feel like that strong educational background that you have prepared you for this Web three space, and I'm just kinda curious, like, how do you feel like it has and maybe has not at the same time? Yeah. So I think ", "start": 493.10605, "end": 517.3219}, {"speaker": "1", "podcast": "that the short answer is yes, it has, that maybe not in the way that people think that it has. So, you know, one of the things that I used to tell my my students is that really university degree is only good for learning huddle to learn. You know, your your bachelor degree is kind of just like a proof of concept that you are even capable of sort of self guided. You know, learning utilities a meeting, you know, obligation and, you know, self study and that kind of thing. And then after that, your postgraduate, it's not really important what the material is that you're doing a press graduate with. Just that you've completed a postgraduate suggests that, you know, you're very, very good at working in extremely unfamiliar territory. Right So for for people that aren't aware. When you're doing a postgraduate degree in general, you are inventing something near. Right stuff that no one's ever, you know, no one's ever considered before you're supposed to be advancing your fields, not just mastering it. And so, in a way, you know, that level of familiarity I have, with unfamiliar territory, I think is something that my, you know, my education did propel me well for. I also think it's a reason... I also think it's the reason why so many of, you know, the the Five founders has actually come from, like, you know, physical chemistry or physics backgrounds. So like the the curve... You know, that the curve founders I think come from a strong physics or chemistry background. I know that Tok mac, for example, like a Tok mac actually is the name of a magnetic field containment system for, you know, plasma and nuclear reactions. You know, these all of these Deep pipe protocols they really are sort of being led by. I think people that have been like, you know, fleeing from science academia. And it's not... You know, I don't think that that's mysterious. I think that, you know, a lot of the academic institutions, especially those surrounding you know, universities have become, you know, very frustrating for for young scientists. That the bar to attaining something like an assistant professors apprenticeship or winning your first like major grant establishing a lab and that kind of thing is getting more and more difficult as the older generations sort of hold on to those positions for a longer and longer before that they retire. And so I think that with the blockchain industry sort of getting thought all of these people with postgraduate degrees doesn't even really matter what they're in. Like I said that chemistry and physics are are are notable. But I've seen, you know, applied mathematics. I've seen, you know, Lore, I've seen epi you know, people coming from what walks of left, but all tending to have the same sort of the same caliber of education sort of, you know, flock this space on non mass. So, yeah. It it has prepared me for it, but not because the material that I studied necessarily is very close to blockchain material. But because I have been trained to, you know, not be afraid of doing something that no one's ever done before. Yeah. And you said something really interesting there, where you said that you find familiarity ", "start": 517.71454, "end": 716.4051}, {"speaker": "0", "podcast": "or yeah. You find familiarity with unfamiliar. And that probably makes sense as to why you are the head of research at Ban. So, yeah, my next question for you is If you could just explain just very quickly for the listeners, what is Ban and What Do you Do As The Head of Research At Ban core. Ban Is An Automatic Market Maker. ", "start": 716.9387, "end": 742.6642}, {"speaker": "1", "podcast": "It Was The Actually you know, it was the project that gave Rise to the automatic market maker a paradigm. So the used to be a community currency project. And one of the things that we realized was going to be a big problem facing, you, this diversification of community currencies, which is something that Ban is still you know, interested in in supporting is that if you need to ever know the value of one of these currencies and something else, and there needs to be a medium of of exchange to learn that value. And if you are relying on private market makers, to to make, you know, to provide that exchange for you, then it puts like an unreasonable amount of responsibility and or and also, you know, power in their hands. And so you know, for anyone who's ever thought like what is the purpose of an Am. Obviously, it's a really great way to make markets with smart contract log. But if you've ever, you know, crossed an international borders, it's just as I have right now, for example, into the United Kingdom, I can see that there's a 4x desk just behind me that, takes international currencies and gives you an exchange rate into Great British pounds. And, you know, I I wonder how many people in the world have ever thought, you know, who determines that exchange rate? Right. Like, is this just an intrinsic property of you know, the Great British pound and the American dollar that they should be worth a certain amount of each other. Or do I need to wait for someone to quote me a price for this kind of thing and and how do those things play against each other? And so I in a lot of these you know, especially things like forex, because there's only a a very small number of of individuals who are allowed to make markets between these currencies. They are easily corrupted And so you would have seen, for example, over the years. You know, rumors is about China sort of like, deliberately depressing the value of the one. You might see Australian has been accused of this previously as well because it's a net exporter. It's actually beneficial for the Australian economy to have a a depressed valuation on its national currency because it means that our exports are cheaper for other for other nations to consume. The opposite is true for the United States. For example, they they generally prefer a high valuation for the Us. Dollar because they are a net importer, and they like to bring resources in. But what's interesting is that the it's the once of these economies that seem to be very good at determining the valuation of their currencies. It's net definitely not like it's suspicious that, you know, that these things tend to play out exactly how governments want them to. And so there is good reason to think that the market makers behind the scenes are sort of either being through the licensing through the inheritance of this responsibility from their government are being given guidelines as to how to make these markets, which means that the markets aren't truly free. And it also means that you know, if they wanted to c to extract value from the markets for themselves, that they can do that. And, of course, they do do that. And so Am really is the the answer that Ban has to how to fix these things sort of once and referral. And more and more people that I speak with from the traditional banking sector, I'm sort of agree that the, you, traditional markets have too many humans in it. Right? There's a way to to prominent a human presence in the way that markets are run. And having something that's algorithm and predictable and fair that gives everyone the same opportunity in the same answer is is probably a much more responsible way to run something like like, you know, like like a currency market. And so that was that was Ban us whole value proposition. For dealing with cryptocurrency, Right, Which is a largely unregulated asset class and that private market makers can get away with things that would be considered financial crimes in in traditional markets. So it is a big problem. Right? We are we are actively struggling against antagonists that mean to extract value from know from the Web three community. And I do think that Am are a really good way to fix that. And so my job at Ban is to figure out how to make this safe to years and one also you know, lucrative. For for liquidity providers to interact with. And also for traders, Right? What what do they want? But more than that, also like, what other sort of financial financial services, you know, what other kinds of financial products can be built on top of this architecture? That would allow for a of a fully decentralized economy to emerge that could support not just cryptocurrency markets, but any market. And so, you know, I spend most of my time trying to think of, like, designing new algorithms, the the most significant of which is the the new withdrawal algorithm on Ban version three, and I'll be releasing a something like a white paper in the coming weeks that we'll describe that in. But essentially, what we wanted to do was to create a an environment where liquidity providers don't feel like they're exposed to, you know, the the financial downside of of providing liquidity. Which is the, you, this thing that we call in common loss. And so with Bank call, we say that we've created an, you know, we created an insurance model that essentially protects users against that kind of financial downside. Now those kinds those kinds of models require a lot of work. We started out with a prototype, which was Version two point one. And then after a year of research investigating how this thing performs and how, you know, liability accumulates within the network and how that reflects on, you, own on B and t stakeholders, for example, means that we have to sort of iterate and tune them the model to make it more reproducible, more more long lived, more sustainable that kind of thing. So my research really is now that we have the Am paradigm I end, it you know, looking around the cryptocurrency economy, you can see that it certainly seems to have resonated with a large number of different groups, right, of uni swap Ky swab, Sushi swab, trader joe or all derivatives of Ban original technology. And so now that we've kind of got this, know, this technology settling in and I think forever. Now we need to deal with, you, some of the more complicated user facing, you know, risk and components, and this is why that the insurance model is built over the top of it. So now my job is essentially to make it as safe than as profitable for users to use and you know, continue to develop the kind of feature sets they that they want to use to make their experiences as good as possible. ", "start": 743.5392, "end": 1195.632}, {"speaker": "0", "podcast": "Yeah. You're almost talk about it like Ban has this philosophy to it? And do you think that this philosophy that Ban has differs a whole lot from other players in the space. Like let's just compare Am amen Am amen, like, Do you think baked doors philosophy differs ", "start": 1196.1246, "end": 1216.9663}, {"speaker": "1", "podcast": "a great amount from that of Uni swap or Sushi swap word, trader, Joe, for that matter? Or true even? Yeah. I to say, I'd I'd say that we're probably, like in terms of philosophy, we might even be well aligned with Projects Sushi want. You know, like, we do value decent centralization. It's been it's been a slightly more difficult process for us because we started as a, you know, A Completely Regulated Fully centralized Exchange, Right? Like The Deep Didn't Have a Name When We First Launched Our Product. And so, you know, to the swiss regulator said that we should treat, you know, an an online Am. Essentially the the same way that we would treat, you know, bin or coinbase or something like that. And so the the move to decent is something that we always really wanted to do. But, yeah, it's been it's been a bit of a process. I think that with regards to use safety, I I really don't think that anyone holds a candle to the type of work that we're doing. But I think more more than that, like, you know, coming back to sort of the philosophy component it. I think that if you read some of the some of the messaging that swap out. I think that they see their product is a bit more like a casino. Right? Like say they talk a lot about users having to basically be responsible for the the profits and loss that they make, They treat it is more like a trading strategy or something like that. And so rather than have it be... You know, that, you know, rather than have a product that feels a little bit more like an online, you know, high interest savings account I think that the the uni swap developers are really focusing on something that feels more like a a high frequency, you know, trading floor. And and that's fine. I I didn't think that either one of us is necessarily Correct. But I think that these these do appeal to Different demographics. So, yeah, I Ban is really looking to come after to the mass market. Right? The the the people that don't have the time or patience or knowledge or expertise to, you know, run a their own new delta neutral liquidity provisions. Strategy or, you know, don't have the the availability or time to constantly you un stake and rest stake there their liquidity at different price points as the market moves that around We want something that's a lot more a lot more hands off. Right? We we we tend to use the terms, set it and tri forget it, Right? Or shaken and bake style, you know, market making. And I do think that that is likely to find the greatest, you know, competitive advantage because the people that have very specialist financial knowledge represent a very thin sliver of all humans that may want to manage their money on Web three. Whereas the the people that you see like a, you know, some way to pocket their funds that are birth, you know, providing a, you know, providing a support to the rest of the the the industry right by keeping their favorite tokens liquid and taking some of that power away from the the private market makers that might have their own agenda. But also to earn an interest rate on on that money that they're depositing. I think that that simplicity, right? And that that comfort and familiarity is is in the long run, gonna prove itself to be a lot more valuable than something like you know, a highly a highly risky leveraged liquidity product like something like Uni Three, for example. ", "start": 1217.5795, "end": 1452.7775}, {"speaker": "0", "podcast": "Yeah. And I think to me, one of the most interesting things about Ban core is the economics of the B and Ent token and the utility that it has within the ban core ecosystem. Because you do allow for single sided staking, and I believe that the B t token plays a factor in Il protection related to that, But Then it is also used as insurance and you know, not only as a conduit for no get permanent loss on trades, but also as insurance. And I'm wondering if you could just kinda talk about the utility of the token and why that's so important to the ban or protocol. So, yeah, you've touched on a few important points there. ", "start": 1453.9758, "end": 1496.2496}, {"speaker": "1", "podcast": "So yeah, B and c has been you know, successfully defended as a as a non security because of its the utilization by the protocol. So it is, you know, classified by Fin, which is the the Swiss regulator. As is as a utility token. And it was, you know, ban was taken to court in New York by one of the... I think one of the Ico investors who, you know, it was a a career lit at of. So I think that they just saw the, you know, the opportunity to sort of take advantage. But then you caught through it out, which is terrific, Right? Because it actually does help to establish that there was no you know, there was no legal reason to suspect that B t should be treated as a security. And it was shortly after that that we were able to open our front end to American citizens again. You know, A lot Of Private banks Started carrying Being T, For Example, Sorry Regular like Regular Regularly Speaking. B ent is sort of a very well battle tested token, which is a nice thing to have. Now that that utilization comes from the fact that it is the universal numerator across the protocol. When a you're right to point out that single side it's staking is something that only Ban has. And this works by essentially when you provide whatever token you want, let's pretend its eth, for example, the protocol has a preset the B t funding limit up to which it's allowed to meet B in order to support my at making activities with the tokens that users are providing. So as long as we're underneath the threshold, the... Whatever the eat is is worth bucket it kind of uses the existing the existing pool as a price article to determine how many B and T should be provided to to maintain balance on the pool. You add a remit liquidity that way. Now what we do in Ban Version three is we issue you a pull token, do and this is a very unique pull token because it's completely single sided and it's blind to its imp loss. So when you go to withdraw from Ban, it will first like the way that the withdrawal algorithm works and behaves. Is that it will try to always give you the full value of your principal, plus all of the fees that you've accrued. In the token that you provided. So if you provided exclusively eth, then it's gonna try and give you exclusively If back when you withdraw from it. But if the, know, if price performed quite well or if your withdrawal is quite large in some cases, then, you know, if the if that position has accrued some employment loss, then you're basically entitled to an insurance payout. So do you get back the, you know, the eth that is left on your fungi position, and then you basically get a cache payout from the protocol in the form of B t. And so this is, you know, one of the ways that I explain this is that, you know, I imagine if you like, crash your car, for example, that's insured. When you approach the insurance company, generally, they just give your cash right, to buy a new car with, they don't buy a new car for you. So the... I think the that insurance behavior is very important to to note that it's possible that if you... Even though you provided single sided of liquidity, that when you withdraw, because of Il, it's possible that you receive a small amount of B and t that's kind of mixed in with the Ether that you provided as well. Now that in a sense is a type of underwriting token. You can think of Ielts as a type of shortfall event. Similar to, like lending on Abe. So the this insurance, you know, backstop, you know, utility that B T has. Is not the only token with this utility, things like compound and Abe and, you know, Nxt. Also have this type of backstop utility. So it's not unique to Ban. But what is unique is the fact that B and T is also the the the default pairing for all assets across the protocol. So while being used there as an underwriting token, it's also a new token or a balanced sheet token or however you wanna call it. And so this is very similar to the way the eth is used in Uni squad version through. And actually, you know, it was it's not mistake, right? That the Uni swap launch we leave. So after the the Ban Ico, We actually received a lot of praise from, you know, from members of the the ethereum foundation. But one of the things that they really were strongly encouraging us to do was to not have the the B t Token sale and instead use Eth as the the num asset. And it's easy. You know, you can go back and find these conversations, right? They're not they're not hidden in. But really a lot of the ethereum community was upset that such an interesting use case for for a cryptocurrency would be, you know, denied to the Layer one token on which these piece products are being built. And so, you know, Uni swap was created from a grant by the the theorem foundation to create a bank or like, right exchange that uses each instead of B and T as the new asset. So B and C has both the, you know, that shares that human property with eth as it does on Uni swap pizza, but also has things like underwriting properties like Ban m and R and compound do. So it's kind of a hybrid of different utilities. And then on top of all of that, B T is also something like a proof of state governance token. So when the users provide B and t to the network, you know, they they take their share of fifty percent of the fees, which is still one of the highest value captures in all of d defects. And you know, they're also issued V T voting tokens. And what's what makes our our dow so special is that because all of the voters have necessarily provided liquidity to the protocol before they are allowed to vote, They are actual like actually incentivized to make sure that the protocol health is managed well. Because if they make a mistake, right? If they do things like vote for you know, you know, frivolous liquidity mining rewards or, you know, they're white tokens that are intrinsically dangerous or associated with you know, criminal activity or have other security problems, then the damage that's done to the protocol will actually cause them financial damage. And sir, you know, it's very, very close to, like actual proof of state consensus mechanisms, things like beacon chain. Where, you know, you provide collateral against the system in order to govern it, and you don't make decisions for it. And if those decisions are bad you get slashed, It's not quite that dramatic on Ban, but it's just that, you know, the the weight of your financial decisions with regards to the protocol overall are still born out on the, you, the things like the price appreciation of the B t token and the overall utility of the network. So yeah, I would say that B t's economics structure, it is, you know, it it it covers a lot of ground Right. All all of the major use cases for for cryptocurrency are applied to the B and t token and Yeah, it's a it's something that I think is poorly understood. I'm really looking forward to having more of these kinds of discussions after this the V three deployment is out. But yeah. B t's economics in my opinion are are second to none anywhere in the industry. Yeah. Really it's fascinating. And when I was doing my research on the Economics, I just kept digging and digging. And I I feel like I can never find the end of the utility for this token. One of the things I need to work on is making it simpler. Right? Like, it's a it's like, well, it's all well good to have all of these kinds of things. But I think most people when they're approaching and you're talking for the first time, they kind of wanna understand it inside of, like, five minutes. Right? If you have to do all of this digging to get to the bottom of something, it's it's probably not very well articulated. And so this is this is one of the things that I'm gonna to be working on again after the the deployments are around. But, yeah, ", "start": 1497.3632, "end": 2027.4944}, {"speaker": "0", "podcast": "I'm looking forward to having more discussions about it. Well, yeah. And it's like, first of all, someone who's not familiar with Defy at all. Imagine first explaining them how D defy works, and then explaining the economics of V t shortly after. It seems like a nearly impossible feat. It definitely doesn't take five minutes. Much longer than that. One of the questions I had was how does ban or protect against governance attacks or long long tail assets to get white listed and and you touched on that already. So thanks for answering that. But another question that I had was related to So when you do receive, I guess, additional B and t tokens for I guess, to make up for the imp loss that you had received on the single sided staking, where are those B tokens coming from? Is that coming from people who have stake them or are these are these being mint? ", "start": 2028.3744, "end": 2083.8943}, {"speaker": "1", "podcast": "So the the government's attack when you, yeah, As I said before, we've got proof stake mechanism, but that's not all we have. The Ban Dell has accepted a really like, prohibitive high standard when it comes to things like participation and majority rules. So for example, most l's in the space are like a simple fifty one percent majority or, you know, a fifty plus Epsilon, you know, percent majority. And you no real core requirements. And this makes it very, very easy from as act to kind of take control of the governance when really like no one's paying attention. For the ban, we have a forty percent quorum requirement. So we need forty percent of all voters to be present on each proposal in order for them to be validated. And our super majority rules start at, like sixty six percent. So it started at two thirds majority in order to pass. And goes as high as an eighty percent majority in order to pass. And so these, you know, these factors kind of combined to make it very, very difficult for a single, you know, ultra motivated actor to sort of gain sufficient voting control, that they are able to pass policy on their own. They can do things like defeat policy. But that's generally not how governance attacks are performed. Right? It's usually about bringing something new in that is, you know, malicious advanced advantageous for just the one person that that's controlling the government. So there we have these safety mechanism mechanism built in. They're not perfect, obviously. But I'd say that they're pretty good. And you know, we've we've, you know, the bank is one of the most active in the space. Right? We've we've had hundreds of proposed is already. And so it's being managed pretty well and, you know, despite the, you know, the apparent profit motive that someone would have to try and attack the governance system. If anyone has attempted it before, they haven't been successful. So this system is working up quite well. Now with regards to the insurance payouts, that that there are two ways that you can think about it. So that there is system inside the inside the bank or network that is essentially con fees from both B and T and Tk k and liquidity providers. And at the moment, it's con those fees at a rate of fifteen percent and this is akin to your insurance premium. Right? So you don't get the Il protection for free. Right? Did that just wouldn't make sense. But the... Instead, you you pay for it by basically taking, you know, fifteen percent of the fees that you earn on trades And essentially kind of sending that into sort of a mutual fund. Right? I'm going to clarify that what I mean by it's in a minute because what I said is actually just object pulse, but it's a helpful way to think about it for now. So imagine that we take a system like su swaps. Right? Where all of these fees are being, you know, sent to ex steak. And instead of doing that, we instead put it in another place, that when when liquidity providers are withdrawing from the protocol, that if they've made a loss, we use that collection of fees to pay them out Right? And so you have this kind of, like neutral that, you know, has sufficient funds in it, Or You know, is Expected To have Sufficient Funds in It such That when People Are withdrawing. If They Have Permanent Loss we Can just Pay Them Out. Mark Is There Ever Any Risk Bid? ", "start": 2084.6118, "end": 2311.4016}, {"speaker": "0", "podcast": "There won't be enough in fees to ", "start": 2312.4524, "end": 2315.0261}, {"speaker": "1", "podcast": "reimburse somebody or a user a hundred percent for that aisle protection? Like, what what safeguards are in place. There is absolutely that risk. So before we before we tell into that, first, let me explain how we we don't actually have that big shared fund. Because it's actually a, you know, there there are legal problems to having us shared fund like that because it's start to look more like you know, like a group investment project or something like that. And so we would have to, you know, there there are licenses and things that that would make that sort of thing you know, difficult to justify to a regulator as we go increasingly mainstream. Instead, what happens is the protocol use of those funds to immediately buy and burn B. And that that burning of B T is supposed to offset the creation of New B t when Il insurance payouts are provided. And so the idea is to match those two rates together. If the overall, like if the rate of creation of new B t, in the form of Il protection is roughly equivalent to the amount of B and t that's being burned during the speech conversation events. Then you've kind of got this you know, imaginary insurance fund where the the value kind of is used to first remove B and T from secondary markets. And then When An Insurance Payout Is Made, that B T has Then Reintroduced into The Secondary markets. And So if the if the aisle payouts are exceeding the bone rate, then you're in in essentially in if in inflationary economy. And when the Burn rate Is exceeding Il payout You're In a deflation economy. And So It's Never the Case That these two Things Are Exactly equivalent. Right? There have been times where you know, the Io payout have been rather high. So things like when like I remember early on in the protocols history. When we had a pretty good liquidity pull from the Mat token and then the Mat token went, you know like one hundred and twenty five. You know, it's a that was a a big insurance liability. Now we managed it. Right? It did you know, the protocol in the cycle really none non west for where. But that was a time where you know, you you couldn't deny. Like absolutely, this was inflationary you know, an inflationary period. Where fee earnings just we're not catching up to, you know Il liability. But for a lot of last year since the since the downturn right since the April here, you know, the the B and t supply has actually been deflation. The the aisle costs across the protocol have actually been less than the, you know, the the fee earning that's happened. And so it's okay for the the protocols to sort of play Hops scotch with this line. Right? It's You know, No one Says That you know, A Small Amount Of inflation Over A Time Is is A dangerous thing Or a Small amount of You know, Deflation Of Over Long Periods Times A Dangerous Thing. But Certainly Like Sudden Changes In The In the Supply Can Be Dangerous. Right? Both inflationary and deflation. And so, you know, this is one of the reasons why you know, the The liquidity mining incentives, for example, on Ban or Version three are are becoming a lot more server. Our we enter sort of into the next phase with the protocols cycle. But, yeah, It's with the Raj of your question, yes, there are these risks. And it is the job of the bank or doubt to manage them. And I'm building out my research team is currently building out a an analysis suite. There's really trying to do a lot of the you know, a lot of the the hard yards with regards to building out these kinds of like actuarial tables and and things like that. So that that Bank doubt can make these decisions in a much more informed way. But because it is kind of a developing theory, And, you know there isn't a huge amount of economic precedent for how to how to govern one of these things. You know, it's something that we have to kind of take the challenges as we find them. But in general, what I keep an eye on is that the mint rate, the B mint rate due to Il and the b and burning rate due to fee accrual. And as long as those numbers are pretty close together, it doesn't really matter which one's higher which one's lower. As long as Data is mostly the same then to hold the protocol is very, very safe. And you can have a look at our June analytics page, and you can actually see, you know, the B and T burn and mint charts. And they basically parallel lines, which is what they should look at. If the the protocol is covering, it's its cost. So, yeah, It's mostly... It covers its cost. Sometimes it does more than that. Sometimes it does less. But in general, the trend is is neutral. Yeah. Thanks for clarifying that. And just to touch on something that's kinda happened recently in the news, I think when people ", "start": 2315.4036, "end": 2629.9595}, {"speaker": "0", "podcast": "I guess recently are associating the algorithm mint of tokens. I think the the thought of a death spiral comes to mind quite a bit more recently. And is that is is that what prevents B t is the the burning of the of the B t tokens? ", "start": 2631.5427, "end": 2648.9956}, {"speaker": "1", "podcast": "There was gonna be a changing narratives in Defy, I think. Because you know, one of the things that happened over the last twelve months was, you know, people like myself, have been trying to warn users that, you know, the the types of, like, a monetary policy that they are relying on and voting on in getting excited about with regards to, you know, massive inflation in order to drive like a you know, what they consider to be a Sexy Ap For example For Taking Stuff. Is Just Kind of Meaningless. You know, Like I've seen Protocols And You know, I don't want To Name Them But let's say, you know, the I I Know of a protocol that was reporting something like an eight thousand percent Apr. And it was meant to hold that forever. But like, what is it for eight thousand Apr worth if the token goes from, you know, over a thousand dollars to under thirteen dollars. You it's pretty clear that you the way that the the community inside Defy, you know, crunch their numbers is slightly broken. Like, for example, one of the things that I'm I'm gonna try and get people to understand is this analogy that I have for like a for pizza. Right? So imagine, for example, if you you pull a pizza out of the oven, you only have one pizza, you haven't cut it yet. Or you've got one slice of pizza. And so, you know, one of the things you might do is cut the pizza in half. And so now you've got true slices of pizza. And now you've got a hundred percent Apr. You know, you can cut the Pizza in off again And now you got a four hundred percent Apr. And we cut it again, I got eight hundred, you know, the point is is that the amount of Pizza isn't changing, just the number of slices. And this is kind of how inflation works. And you know, I think that partly because of The naive. But also for other reasons, right? Like there is value to things like, you know, more more fairly distributing a token around and getting more token holders you know, participating in something. Like inflation has a lot of really great aspects to it. But you know, eventually, if you keep pushing that button just to try and keep an arbitrarily high Apr, it just doesn't make any economic sense. And I think that, you know, this is one of the things that that we are, you know, that we're starting to go through. Now the reason I'm bringing that up is that the the Il costs on Ban with regards to, like B T printing, really not that you know, it's really not that high. More the much more concerning aspects are the Version two point one liquidity mining rewards schedule. And so, you know, this is something that Bank famous for the community obviously loved it. They everyone likes seeing that you know, that forty percent number or something on the front page. But it is the the it is the most worrying component of ban economics, not the Il protection. And so with Ban or version three, the, you know, I I have gone to some lengths right, to really map out what I think a a reasonable monetary policy is going to look like, you know, how the how the emissions can be managed and eventually tape it down to nothing. And so in a way, what I won't be to start em, is the the diminishing emissions rate of Bitcoin. And, you know, paradox, you know, Bitcoin, if you hold it in a five sense, has an roi zero percent. You know? And of course, like, you know, meaning that you don't actually get any more bitcoins for having them. But You know, This has been to its credit, Right? This is it's is one of its greatest strengths is that instead of, you know, balloon the supply of the token. You know, it appreciates in value. And this is something that is easily replicated my in my view. And so for the the B T Community And for Version three, And I think maybe for all of D five. We're gonna we are going to see this the emergence of this new narrative for like, you know, you know, responsible economic policy. And for for Ban, the most... The the number one thing that we can do to be more responsible in the short term is manage these you know, these liquidity incentives and just let the protocol, you know, give the protocol a chance to rise to the occasion. After that, you know, a second priority or, you know, Not Not a second maybe a secondary priority. Is the the il mint versus fee burning component. But because those numbers are small compared to the liquidity mining. ", "start": 2649.5686, "end": 2942.95}, {"speaker": "0", "podcast": "It's pretty clear which one needs to be dealt with frost. Yeah. So in in your mind, what are some of the The key features of version three that you're most excited about. And this can be as as technical as you want to or or as in general as you want to. So I think that the ", "start": 2943.83, "end": 2959.7922}, {"speaker": "1", "podcast": "there are a lot of features of of Ban version three that I'm excited for. One of the ones I said before is that, you know, There's A a a New Withdrawal Algorithm That Can Actually Compensate. Uses Il Without Having To Meet B, Which Is Interesting. So this is something that version two point one couldn't do. But essentially imagine a situation where we might have two different tokens. Maybe be Eth And Usd d. And The the Usd d t Balance of The Protocol Is in Surplus meaning that they beat you to price movements. The and the number of stable coins inside the protocol out numbers, the amount of stable coins, users are eligible to withdraw. And then, you know, it might be the opposite. Right? It's in deficit, meaning that it's got Il and the you, price appreciation of The East Token. There are fewer E Tokens Inside the protocol then users are eligible to withdraw. So on version two point one, basically, you can't do anything with the excess stable coins and the, you know, the the aisle on on the eats is essentially asymmetric. On version three, one of the things that we can actually do is force a a an arbitrage trade to occur between Usd the Usd and Eth, such that the the protocol is losing some of its surplus tokens in order to regain some of the tokens that it's missing. And this has done very, very slowly. Right? It's a it's not a dramatic change. But it's an important one because as you slowly let the algorithm play out over a very long periods of time, the impact that It Has On basically Letting The Protocol Keep Either chasing Its Obligations Without the t or only mint B t is a last resort means that we have a much more a much more resilient insurance model than what we've had previously. So I think that's something definitely to be excited about. But then the the things that I'm the most excited about are actually the industry facing features of Ban version through. So things like, you know, the auto compounding rewards that are, you know, offered as a service to third parties to Bootstrap and and motivate and and influence their, you know, their own projects and their own teams and their own, community members. This is something the bank had before and is something that people are really interested to use. But the way that we developed it was observing the types of death spirals that you've been talking about. And, you know, if anyone who is listening to this this podcast is interested that I actually delivered a a keynote presentation at permission list this year that was dealing with specifically this concept. Right? The problem of like liquidity mining incentives to bootstrap community liquidity and the the damage that it ultimately does to the project into the Token press. And So a Bank his has developed Is a really compelling alternative that doesn't require You know, a project to sort of sacrifice the value of Its Token in order to Create Liquidity with it. And This Has Been Extremely Well received. Right? Or everyone that We've Shown The System To Has Just been You know, server relieved that there is a a new alternative that doesn't, you know, that that doesn't require driving that's token price into the ground. And so I think that that's exciting because over the course of, you know, since D five summer. Right? Out until this day. Really, A lot of the A coin markets have been set up in a way that, you know, generate first it generates value and then drives that value to the Layer one token. It's why it's probably one of the reasons why Layer one tokens have perform so well. But I'm looking forward to seeing what Tokens can actually do when they're given some room to breathe. Right? And that we sort of, you know, cut cut the the chains of their ankles a little bit and and let them, you know, perform in a much like in in a much more natural Price Discovery Mode. And That's Exciting To Me. Brad, That Other Teams And Other Projects And other Communities will will no longer have to sort of fear that you know, that the the liquidity challenges that they're facing necessarily require their token price to be harmed. Ban call version three has a way around that. And I think that that's going to be ", "start": 2960.5618, "end": 3232.3096}, {"speaker": "0", "podcast": "better afford literally everyone. So Mark, thanks for coming on the show. This has been great. You might not know this for actually the first guess on the Poly alpha podcast. So thank you for being here. And my, I guess my next question is, where can people go to find out more about you and Ban and version three? Yeah. I think that, you, ", "start": 3233.1753, "end": 3256.56}, {"speaker": "1", "podcast": "I'll be happy to share with you my my my Twitter handle and my telegram handle and if you wanna put this in the description to the to the Podcast or something like that. Then I I would, you know, absolutely encourage people to to message me directly. Sometimes it takes me a little while, My my inbox Can Be overwhelmed very quickly. But in general, I Make An Effort To Answer ", "start": 3257.9277, "end": 3281.4639}, {"speaker": "0", "podcast": "Every single mass that someone sends me. Alright. Yeah. Thanks again, Mark, for coming on the podcast and safe wrap is out there. I'll see you next time. My pleasure, Josh and thank you so much for having me. Yeah. Thank you. Bye. ", "start": 3281.8396, "end": 3293.4954}, {"speaker": "1", "podcast": "Bye bye. ", "start": 3294.29, "end": 3294.608}], "summaries": [{"title": "1. Exploring Finance and Crypto with Industry Leaders: Poly Alpha Podcast", "summary": "In this episode of the Poly Alpha podcast, host Justin Evans interviews Mark Richardson, the head of Research at Ban. The podcast aims to provide insights from leaders in the Poly community into finance and cryptocurrency. The conversation revolves around Mark's upcoming month-long trip to various crypto conferences, coinciding with the launch of their Version three product. The text also discusses Mark's background and how they got involved in the space that led to their participation in these conferences."}, {"title": "2. The Influence of Lockdown on Australian Involvement in the Crypto Space", "summary": "This text describes the author's journey from a chemistry background to becoming a leader in the cryptocurrency and blockchain industry. They discuss their experience during the COVID-19 pandemic and how they became interested in cryptocurrencies. The author now leads the research and design of a cryptocurrency product and expresses satisfaction with their career transition. The text also explores the possibility that the lockdown in Australia contributed to the high number of Australians involved in the crypto space. It discusses Australia's favorable environment for blockchain professionals and the role of education in the industry, emphasizing the value of postgraduate degrees in preparing individuals for success."}, {"title": "3. The Rise of Automatic Market Makers and the Need for a Decentralized Economy", "summary": "This text introduces the concept of automatic market makers (AMMs) and their potential to revolutionize traditional currency markets. AMMs offer a decentralized and algorithmic approach to market making, reducing human intervention and corruption. The text discusses the importance of creating a safe and profitable environment for liquidity providers and traders, as well as the potential for building additional financial products on top of the AMM architecture. It also mentions the development of an insurance model to protect users against financial downsides. The text compares the philosophies and market focus of different AMMs, highlighting the author's platform, I Ban, which aligns more with the philosophy of SushiSwap. The author believes that simpler and more familiar platforms will be more valuable in the long run compared to risky leveraged liquidity products."}, {"title": "4. Understanding the Economics of the B and Ent Token in the Ban Core Ecosystem", "summary": "This text discusses the economics and utility of the B and Ent tokens in the Ban Core ecosystem. It explains their various functionalities and roles in the protocol. The text also discusses the challenges of explaining Defy and Vt tokens to newcomers and raises questions about governance attacks and the source of additional B tokens. It highlights the importance of governance mechanisms and insurance payouts in preventing malicious actors from gaining control. The text also addresses the impact of climate change on global food production and the need for urgent action. It discusses the challenges of managing risks in the protocol's insurance fund and the concept of token burning. The author emphasizes the need for a shift in narratives surrounding Defy and the importance of responsible economic policy."}, {"title": "5. Key Features of Version Three", "summary": "Ban version three introduces new features such as a withdrawal algorithm that allows for more flexibility in token withdrawals. The protocol can now handle situations where there is a surplus or deficit of stable coins compared to user eligibility. It also offers auto compounding rewards as an alternative to liquidity mining incentives. The aim is to promote natural price discovery and alleviate liquidity challenges for other teams and projects. The decline in traditional phone calls is attributed to the rise of digital communication platforms, driven by factors such as convenience and cost-effectiveness."}]}