{"podcast": {"title": "Polygon Alpha Podcast", "host": "Justin Havens", "image": ""}, "episode": {"title": "Democratizing Work with DAOs in Web3 | Opolis | John Paller | Polygon Alpha Podcast", "number": "22", "date": "NOV 15, 2022", "description": "", "url": "https://www.youtube.com/watch?v=15xrqqAnGMY", "speakers": {"0": "Justin Havens", "1": "John Paller"}, "file": "november15.mp3"}, "transcripts": [{"speaker": "0", "podcast": "Hello everyone. Welcome to the Poly gon Alpha podcast. Where the Poly community gathers insights from today's leaders decentralized finance, Web three in Crypto. I'm your host Justin Havens, a aka Crypto. Let's get started. On today's episode of poly alfa, we're joined by John Poll, the founder of East denver and Op. John, thanks for being here with us today. How's everything going? Going great. How are you, Justin? Or I should say crypto tax and Crypto on Twitter, but I was anonymous for a while working for a dow, the index Coop dow. And then So I I kinda maintained that brand on Twitter that I had there for a little bit. Yeah. I'm docs all over the place. So, like, I'm at Power john on Twitter. So, like... That's pretty that's a pretty easy one to remember. But yeah, let's let's kinda start with your background. Op is a really fascinating organization to me. But before we get into what Op is. Let's just get into, like, your background? And how did you get into the crypto space, John? ", "start": 0, "end": 68.28068}, {"speaker": "1", "podcast": "So my background is an Hr tech and employment Systems I've been in the space twenty years. I've been in... I've founded some startups ups and been tinkering around with various different marketplaces ideas. And the thesis has always been since two thousand five, to democrat employment. Now I didn't know what I didn't know back then, but all the experiments solve the fits and starts, all of the sort of pivot kind of led to one conclusion and then that is that we didn't have the tools or even the game design, and coordination mechanisms to, like, really create democrat employment because the game design as it exists today, meaning corporate top down employment, sub, sort of permission employment. There's too many facets to it that actually create roadblocks and problems. I mean, from distribution of value to just you know, policing things, smart contracts have a tendency to solve some of these things. So in any case, I was... I built the fifth largest staffing company in the state. I was, you know, doing some startups and, like, experimenting with the Uber of economy back in two thousand twelve, two thousand thirteen. One of my investors was big into bitcoin was talking to me about permission list peer to peer all this stuff and I'm just like, I don't have any idea what any of this means. And then I was randomly introduced to Dim Butt, metallic father. An executive for Charity in January of two thousand fourteen. So I became friends with him. We started we created a sort of casual friendship, and I was following... We were following each other on social media and he was posting all this stuff about Ethereum. And the stuff that metallic was working on. So I got my hands in the white paper, still didn't understand it, but was like, I was kind of intrigued by the idea of central centralization and I didn't really I didn't really understand like, what the impetus of these things were what the impact would be. I was still thinking about technology as like corporate efficiency. And then I had my Red pill moment. Where it's like... It it was early two thousand sixteen. And I just, like, the light went on. It's kinda like waking up out of the matrix and you're just, like, you know, you're kinda looking at your hands and you're going. Like... You know, you can't see it. And it was just a paradigm shift for me. So I started understanding that that these are now tools that could create better games essentially. So their economic coordination tools, their integrity tools, there Ben evidence management tools, you know, these are all kind of economic terms and things that we've kind of learned to appreciate in our. Does line of Op, but it just took time, you know, it took time to really understand it, and then, you know, it took me about eighteen months to pivot out of everything else. So actually after I had my Red pill moment, I just decided I was out, maybe you know, of the old stuff. But I had this startup and I had this business, and I had all this stuff that I just like, oh my god. Like, What am I gonna do to, like... You know. So we had just... We had to figured out. And it wasn't it was a it was an interesting thing. But anyway, the net end of it was August twenty seventeen, we pivoted out and Op was preceded. With this idea of democrat employment using Web three, but we didn't know how to product yet. And we had a little bit of runway and we spent time doing research on legal frameworks and economic models and, you know, all sorts of different. The token economics, all sorts of things that we were kinda looking at. Along the way, I met the let, you know, Joe Lu, who became an early supporter of the project. He didn't we didn't ever become a mesh project, but we were what we call Mesh friendly. And we made friends with bunch of people at the Maker Dow. You know, foundation and in the ecosystem there, and then we you just get building and building and building. That's how I got in. And then in the fall of twenty seventeen, I found in December. Well, the idea was to build Colorado as the destination of choice in the Us. For Web three in innovation development around Web three. And I'd say we've done a pretty good job so far on that. You know, it's now the world's largest Web three innovation festivals. So we have a lot of fun with that. We had thirteen thousand people from a hundred and ten countries show up. In Colorado this year. So it's by far the biggest build on event ever produced in Web three. So, like, we're expecting twenty five to thirty five thousand this coming year. So, like, ", "start": 69.72771, "end": 360.77628}, {"speaker": "0", "podcast": "yeah. Buckle your seatbelt belt. It's kinda fun. That sounds really exciting. Yeah. And I think when I think of, like, cities in the United States that are pretty web three centric. ", "start": 362.3808, "end": 371.92615}, {"speaker": "1", "podcast": "Denver is definitely one of them, Miami in Austin or probably the other two that come to mind first. Brooklyn, if you wanna count Yeah. As a subset of New York, but I wouldn't count New York generally, I'd say Brooklyn is the exception. No, I wouldn't either. And it feels like Sanford Cisco was just kinda of with away and every everyone is kinda moving elsewhere. Yeah. I think San Francisco got its own inherent issues outside of web. But I think web three from a Web three centric standpoint, I think what San Francisco investors are realizing is their investing globally now. They didn't used to do that much. You know, most of it was like, yeah. You had your office in San Francisco. You were building San go is very geo centric. And now we you look at their portfolios. These companies are just remote first, they're distributed. And they're do... They're investing over Zoom, you know, that never happened. They're investing over Zoom and then they're ", "start": 372.4828, "end": 423.97092}, {"speaker": "0", "podcast": "executing the investment contracts over smart contracts. They're sending their Usd dc to a multi sig wallet, and you don't you don't need to be. And that's I think this is, yeah. I think this is a really good point in topic is that, you know, you're talking a lot about, you know, web three and smart contracts as, like a human coordination tool We talk about D defy and the meta and N t's, but I think when I was involved with the index coop, I think that was something that really was like a light switch moment for me. I've had a lot of light switch light bulb moments in my in my life in the web three space, but working for the Next c was was definitely one in the sense that This was just a group of individuals spread all over the world that came together for a common purpose. And we didn't have a headquarters. There's no bank account. We would say that our headquarters is on Ethereum, and we were all essentially just Private contractors working for each other, and we would distribute funds to each other based on the work that we did. We've went through a lot of iterations on the hierarchy of how that dow was structured. I do not I'm not as involved with that dow anymore as I used to be. But there were a lot of individuals in the Us, that worked for that dow who were using Op because, you know, when you are doing this private contract work for a dow, which is which is essentially what it is in my mind. You need to look for things like, you know, health care benefits. Yeah. Good luck if you're floating around independent. And so there were people who are using Op for for a lot of these different things and also like... I I think you'll have, like, a tax help as well as for, like, tax documents. So maybe it'd be good idea to just explain what is Op. ", "start": 424.34473, "end": 529.2979}, {"speaker": "1", "podcast": "Yeah. So my... The culmination of all of my Hr tech building experience led me to believe there's some pretty fundamental systemic flaws and how employment works. First off, if you're working for somebody, which you notice you use that word exactly. I was working for a dow. I would argue that you're working with a dow. That's a good point. Yeah. Just old old habits die hard. Oh I know. I mean, we're conditioned to think of employment as a permission sport, Like, you know, the Dow is gonna give me permission to do my thing. Right? Like, parent child relationship, it's pate. So I've studied all these subjects, like the social anthropology of employment, human organizing systems around operations, legal frameworks, economic game design, monetary policy. I've been a nerd of this stuff for fifteen years. Okay? So in my original sort of epoch of like, trying to throw technology at these problems. What I learned was, this not a technology problem. It's an organizing problem. And it's a relational problem. It's a social relational problem. And these are often defined by legal means. Right? So the legal relationship of an employee to an employer is that the employer kinda of gives you permission to do everything. Not kind of they do. I mean, functionally, they can say, you're not employed here anymore, and then all of a sudden, you lose all of your permissions. Right? It's kinda like a bank telling you No. You can't bank here. And then all of a sudden, you don't have bank count. Right? So if employer tells you you're gone, you lose your health care. You you don't you don't lose the money in your retirement plans, but you don't get to put more money in there and it's it's it's tied to that provision employment. So one of the core conclusions that we came out that was part of creating our thesis is like, look, we need a mechanism that's going to allow people to function in the real world, like get basic stuff like health care insurance. It's not I'm not trying to solve the giant problem that is health care, like, at its core. Like, that's a whole other game design, like, that's a whole another industry. But the employment related side of this. How do you give people high quality, low cost health insurance and make it tied to them, Not their their quote employer. Or or how do you make them their employer so they can actually employ themselves? How do we create this concept of self sovereign employment. We talk about self sovereign data, we talk about self sovereign identity. We talk about lots of different things, but like why not self sovereign employment Employment is the core commercial activity that everybody does. It's the great enabler for actually realizing Web three as boring as this stuff is, employment is the key to mass adoption. Dow are the facilitator, but employment is the key. Dow are the the the source of funds. Right? We've got these new next generation organizations that have community, you know, tokens, they have next generation governance mechanisms, coordination mechanisms, value distribution mechanisms that allow people to earn from anywhere in the world, permission listening. But then how do we legit it? How do we actually plug it into the old world? And that's essentially what Ob is. Op is two things. For those working in Web three, it's a great legit. You need healthcare care insurance, come to op. You can get it. It's it's inexpensive and it's great care it's soup... It's a member owned community. It's an employment dial with a legal rapper, so, like you become an owner and a member. So it's not some third party corporation exploiting you and extracting a bunch of money from you. If this thing is profitable at scale, Guess who benefits. You. Right? And me and everybody else who's a member. Right? So there... We're just reorganizing the the typical services and and expectations of employment, but we're putting it in the hands of the individual. So whether it's retirement plans or health insurance or work comp or unemployment insurance or Two or pay stubs or the things that you need to just live a normal life, good luck we're, you know, renting an apartment, showing them your meta mask for your proof of employment. Right? Or your proof of income. Good luck. You know, I wish you well, but they're not gonna give it to you. Now you use Op and you get a pay stub twice a month. You get a w two at the end of the year. No one sub you No one's controlling your time. No one's can telling you where to work from with who any of that. You get completely choosing your adventure. But you get a hand the person to W two and a pay stub and say, no, ma'am, I'm employed. Here you go. They don't ask. They they don't care. They just want... They just check boxes. How does the pay stub feature work? Like, if I'm working for the index coop op dow? If you're working with the index coop op, Yes. Right. Okay. So the way we see it is the index c op would be classified in the Us. Just for kicks. They would be classified as general. Okay? Now, I'm not here to talk about compliance or jurisdiction that. I don't care. Okay? But it's it's yolo. Let's say it's y in the ether space. It lives in ethereum, just like you said. It has no legal status. It has no Ein number. Therefore, it has no employment relationship with you whatsoever. You're an independent contributor. K? Best practice is how it would work with Op is you would wrap yourself in an Llc that Alexa corp status at the federal level. Now why? Because electing s corp status gives you the ability to actually create a bona fide employment relationship with yourself as the only employee of your set entity. So let's say it's Justin Havens or... No, it's Crypto and Llc. Okay? So K and Llc is getting paid ten thousand Usd per month for your contribution, just make up numbers. Not do you. I have no idea. I'm just... I promise everybody who's listening. I'm making this up. Ten thousand that much. Ten thousand Usd d, whatever. Just so I can do the math. Okay? That ten thousand Comes to a wallet controlled by you that your entity owns. Okay? So you would have those asked sits on your balance sheet is revenue. Right? So those assets would equate to potential tax at some point. But what you're gonna do is your entity is actually gonna have her an employment relationship with yourself that's actually going to be then outsourced to op through the employment common Lc. So the legal entity that we use for this, the employment dow is a colorado cooperative that has an Ein number. And the Ein number that we that you then are going to be employed by is the same employment identification number that we use to procure health care insurance and to pay taxes and do all the other compliance activities that we do on your behalf. So then you're still employed by Crypto text and Llc, no one's taking control of your operational day to day, you can work from where with whom and how much you choose. But the outsourcing or employer of record is happening through the employment common Lc, which is the op a entity that does that. Okay? Now functionally, you're getting a W two because you're being employed by that entity. You're getting a semi monthly pace you're getting your taxes withheld and paid on your behalf, all the compliance forms, nine forty ones. Like everything that you've gotta do to check the boxes for the regulators, in the compliance folks, the alphabet soup folks as we say. It's all being done. She just sit back and relax, just like you're sitting in in a in a cube form somewhere, like you would normally do and just get a w two in a pay stub. It's the same thing. K? So we're just... But we're dis index from having to be the employer. Now Index is a coalition member, so they have interest, they don't wanna be employers. Like, most of dow that we work with Unless they've got, you know, investors or legal people whispering in their ear, telling them that they, you know, business people need to do business things, and you've got provide health insurance and employment and contractor compliance solutions and all this. Our our model actually eliminate the need for them to do any of that because the W two's is being handled, taxes are being paid. Compliance is happening, statutory compliance is happening. Everything's happening, so that index can just pay you like you're a service provider just like a consulting firm of any stripe or an accounting firm or software development shop or anybody else did. Why why do they why do you need to be their employee? They don't control all of your time and attention. Do don't do that. It's all statement of work anyways, which is well suited for independent contractor work. So then you don't lose it. You... You're gaining a lot because you get our access to the typical employment frame without having to give up your independence But Index is also benefiting because they don't have to worry about that compliance now. It's been boarded to you, but instead of just dumping you in a lake with cement shoes on and hoping you swim, Op takes it on for you and throws you a live vest. ", "start": 529.7764, "end": 1085.3464}, {"speaker": "0", "podcast": "Wow, this is fascinating. This makes this makes a lot of sense. There... There's a lot of legal in here for those in the Us. ", "start": 1086.3146, "end": 1092.8597}, {"speaker": "1", "podcast": "Yeah. This took... So we're talking a lot from the Us frame, but we are expanding internationally. So this is coming to Canada in January. So if you're in British Columbia, or Ontario provinces that's our Genesis cohort for Canada. So, like, sign up, there's actually some huge bonuses and benefits you'll get by being the in the first one hundred of the Genesis cohort come January. So that's that's a big deal. We're going to Puerto Rico, quarter one and then we're gonna be expanding pretty much everywhere. The goal is within twenty four months to be in a hundred and sixty jurisdictions. The grand vision is a global public utility infrastructure for employment that allows individual contributors to work from where with whom and how much they choose fluid accepting any currency and any jurisdiction and having the life and normalcy see that they want, that fist for that... For what their choices are. That's completely permission less employment on a global scale. And all that by wrapping your own person in a legal entity. That's right. Well, you should be doing that anyways. I mean, best practice if you're gonna do business commercially for risk management or even tax optimization, s corp are great for this. At minimum having an Llc just to kind separate the kind of business from from you But, you know, I I I've become quite a fan of ace corps in the Us for this particular reason, largely because if you're a high earn, you don't have to pay as much tax on payroll if you do it this way. There's, like, actually, like, real functional tax benefits. To to using an S corp plus the employment feature, which is the currently the requirement that we have in the Us. You've gotta have an elected s. And Llc that's selected S corp. You can also use the C corp or a B corp or a not for profit five zero one c three, which is really just a c corp active five zero one c three. So... Yeah. That's that's interesting. And so do you have to be involved in web three or working with a Dow ", "start": 1093.4983, "end": 1220.7142}, {"speaker": "0", "podcast": "to be part of Or is it is it any any independent contractor can join? Our thesis is ", "start": 1221.024, "end": 1226.3032}, {"speaker": "1", "podcast": "from a social anthropology and a social fu standpoint points. So forget web three for a second. Okay? What are we gonna be talking about in five or ten years. Are we gonna be arguing over layer two or what chain is the best gas or what Z k fill in the blank is gonna be the best, you know, zero knowledge proof, Like, are we gonna really be talking about that? Because that equates to talking about Https or Tcp Ip, like protocol level stuff? At some point, we're gonna we're gonna graduate to talking about, you know, commercial layer application experiential layer stuff. Op is an early example of this. So we've built our entire project to be what we call norm friendly. So we've abstract away a lot of the crypto complexities from, you know, crypto native users who are like, well, is this even a crypto project? It is. And under the hood, there's a lot of really cool things that are going on, like, we use magic labs for authentication. We've got Poly wallets actually embedded that are native in the dashboard that we automatically default assigned to people based on delegated proof of or delegated private key management systems. So, like, there's all sorts of cool stuff that's going on. But we're not gonna be... Again, we're not gonna be talking about this in five years. So we're not trying to build for a niche industry. That's, you know, gotta educate our way to mass adoption. Like, no. I can't educate people on how to manage a private key and expect the average real estate agent to wanna do that. Like, they're not gonna do it. So, like, we've gotta figure out better ways to, like, sort of trojan horse it, abstract it away so that people will wanna use it. So our whole product is fiat is native default fiat, you can opt into all the crypto stuff if you want. But, like, if I just find a random, you know, Twitch streamer who just happens to wanna join this because they've... They need healthcare care and and they think it's cool to be a part of this community owned thing. They don't have to know anything about crypto or the the complexities of it to be able to join. Now for those that are crypto native, you can come in and kind of opt into the D dj world or whatever if you want. But, like, we're not forcing people to do So we're... We see ourselves as a bridge product. So not only is it the great legit for those already working in Web three, giving you normalcy and kind of a t back to the real world. It's also a giant bridge. It's a giant portal for people to kinda walk into this world and over time be like hey, maybe I should take some of my payroll in Mat. Maybe I should take some of my payroll in if Ether you know, bitcoin even, like, I don't know. You know, whatever they want. But we're not here to prescribe what people should or shouldn't do. We're here to get people optional, which is not what their employers are gonna do. Their traditional employer, corporate overlords are gonna, like, limit it to whatever benefits them. Like, we're saying, like, this is a choose owner adventure sport in the future. We need to build this so anybody globally use it who works independently. So ", "start": 1226.9183, "end": 1417.8984}, {"speaker": "0", "podcast": "there is a token associated with Op called the work token, and I'm wondering how that fits in ", "start": 1418.3525, "end": 1425.0542}, {"speaker": "1", "podcast": "just to the overall infrastructure. So the work token and I'll go on record is saying this, but the community token is the number one most in important coordination tool that's been invented in the Web three tool set. My opinion I think above and beyond almost anything else that we've built... Smart contracts included all the community tokens are built on smart contracts, so, like, you can't have community tokens without smart contracts. But I think the function of the community token is the most impactful thing that we've built. And the reason for that is because we now have the coordination tool that can reinvent our economic games in a meaningful way. And economic games mean incentives. Like how do we incentivize better behavior. One of the biggest challenges that we have in the corporate setting is distribution of value. You know, how do you get a stock certificate for being an Uber driver? You don't. Okay? Uber drivers built that community It's not Uber. Uber technology is not remarkable. They built a network defect because they built you know, inertia a brand awareness and volume of transactions and network effect in terms of user base, but it's not really that durable. I mean, if there were a better option, why would I wanna stick around at Uber if I could, like, drive for a a community owned version of that? Like, like a driver dow or something like that. Now there's been early iterations, and efforts around trying to democrat ride sharing, it's gonna happen. It's just we haven't hit this sort of maturity level where we've got the entire picture covered. But back to the work token, the work token in terms of our community is how we reward contribution of value to the community. So it is by definition a patron token and that is a term that we coined. So this is a brand new category of token. It is issued out of a Colorado limited Cooperative Association. There is a securities registration exemption for cooperative in the state of Colorado. And we use it as a rewards token. We basically we don't sell it. You know, there's no reason for us to sell it. We've raised capital, we're raising capital. We're gonna raise more capital. And we're gonna we're gonna to a place of profitability. So here's how it works. Okay? So let's say I referred you to Ob. K? Now I'm already a member, so step one of this is I'm receiving work tokens, every time the community hits... Ten percent growth in aggregated payroll volume. So let's say it goes from fifty million to fifty five million. That's gonna trigger payroll mining. So payroll mining is the the function that we also invented that is our inflation mechanism. So when we hit a ten percent growth threshold in payroll volume, that triggers mint of five million new tokens. Those five million new tokens are distributed to the community based on three individual buckets. The first bucket is payroll consumption. So that's that first bucket that I talked about. So employee members, are run their payroll, they're doing their things. So we look at the total aggregated payroll volume between epochs between the growth right of from fifty to fifty five. And the total percentage of payroll consumption that I own. So let's say I owned one percent of the total payroll volume for that particular epoch. I get one percent of thirty percent. So it's one point five million tokens. I get one percent of that, which means I get what fifteen thousand tokens. Okay? So... But let's say I also referred you. And you came in and you're a member, and you've been here, and let's I referred three other people, and I own three percent of that pool. So then one point five million tokens at three percent is forty five thousand tokens that I'm receiving just for referring you. So I have a long term incentive. Now let's tie this back to the coop. What is patron? Patron is the mechanism by which cooperative, ship value back to their membership. Dividends, So when we're profitable, we use the work token as the unit of account for our membership to determine how much of the profits you're entitled to. So let's say I... At and at scale, I own one percent of the total pool of the member based tokens. So of all the members in the coop op, I own one percent of the tokens, Well, that I get one percent of the profits when that's declared. So we tie this back to actual economic value in terms of value that was contributed in the cooperative effort to the community but we use this entirely next generation game design to make sure that everybody's incentives stay aligned. So then if you take a step back from the game design, what does this mean we want? What does this mean we're trying to incentivize? Well, I'm trying to get you to now refer your friends. Right? Because you're seeing, wait, you got forty five thousand tokens just referring three people and you got fifteen thousand for your own consumption. That makes makes a lot more sense not only to, you know, take the low hanging and fruit and do mine. But I'm gonna bring my friends to because, like, I wanna I wanna help build this thing. This thing is gonna be really valuable to me and it's a service that I need. I'm saving two hundred bucks a up on my health care insurance. You know, my kids got, you know, have the right doctors and everything's good. Like, I love this. I'm an owner. What's the downside? There really isn't any? I'm paying one percent of my compensation for this service is a community sustainability fee. That's it. There's no subscriptions. There's no bullshit legal contracts. You're an remember, you can come and go whenever you want. But if you leave, you're gonna lose your health care insurance. So there's not really a lot of incentive just to bounce, you know, it's very sticky. But the incentives are very aligned to create this sort of positive some game mentality for the entire community. Even our investors want to make referrals because it earns them more of a stake in the community. Right? They can they got these big communities. They got you know, I mean, think about Poly on as a community. It's freaking huge. Right? Why do you think we have a partnership brewing with Poly? Why do you think? Because it makes sense for the Poly gon community who also wants to be a destination of choice da and wants to build a big footprint globally and wants to be able to give people, you know, their access to their own features and functions. And, you know, I've I, I've had conversations with Sand deep about this. And he's was like, this is, fantastic. Like, this is going to enable people to you know, to actually t into the real world, make sure all the compliance is there, so the Alphabet soup folks and the regulators are happy. ", "start": 1425.8414, "end": 1871.5052}, {"speaker": "0", "podcast": "But it really does un undo this sort of control mechanism that we know is employment. And I like what you said they're about t this to the real world because I I mean, I I feel like when you're working with a dow when you're working in the space, it can sometimes feel like you're just, like, working in the med. Oh, like, it's an alternate reality. Like, I mean, hundred hundred percent dude. And it comes time to pay your taxes. And Yeah. That ", "start": 1872.2374, "end": 1895.3141}, {"speaker": "1", "podcast": "this is way more real than people, you know, like maybe joking. The alphabet soup guys, they're not gonna, like settle for... Well, that's not real it's in the meta. And it's, like, now it's an asset. It's declared an asset by statute, c chapter and verse, and they're gonna say, You owe taxes. Okay? I don't make the rules on that. Okay? What we're doing is saying, you know, let's... You know, the the donate the Player eight to game. If you don't like the game, build a better game, and that's what we're doing. We're building a better game, but we're also playing by the rules. We're creating legitimate legitimacy mechanisms. Now there's a certain element of the crypto space. It's very, you know, crypto and, you know, ana in general and they're just, like know, I'm not paying taxes, taxation theft and all this. Philosophically, I don't disagree, but I also know that if I don't pay my taxes, I'm going to jail, legitimately. Okay? And I'm docs. I'm out there. I wanna live a normal life. My kids go to school, like, I... Yeah. What am I gonna do? Okay? I do think that this is also the gateway to larger change down the road. I think that, you know, having a decentralized employment framework that operates on a global scale that's community owned, not private equity owned, but community owned and it's not a union in the traditional corrupt sense. It's not a government in a traditional corrupt sense it's distributed, decentralized in community owned. Holy shit. Like, that's gonna be... That that could completely change the game. So, yeah, you're right. It's It creates a level of normalcy. Around crypto that very few projects in the space have been able to achieve. Normalize, it legit and normalize the meta, crypto, d defy, N t's, even jet to a certain stat, like, because we can funnel it into a place where you can actually, like, pay your taxes and you, get health care and live your life that you wanna live, you know? Right? And I to get more people were aware of just the resources that are available like Apple. I think that we would see a lot more people ", "start": 1896.3433, "end": 2023.6898}, {"speaker": "0", "podcast": "doing this type of work in web three. And I think, you know, just just exactly. Yeah. What like, what are some of the just like some examples of the services and benefits that Op members have ", "start": 2024.5463, "end": 2038.0765}, {"speaker": "1", "podcast": "once they become I guess, members of the the organization. So I... I I rapid fired a few of these earlier, but like, The big ones are you're able to you don't have to pay exchange fees to get your crypto if fiat. You're also not gonna tip, you know, piss off your bank by using Op because we do it through paychecks and it's direct deposit. So they also know that taxes are being withheld before that money hits your your bank account. So there's a there's, you know, there's a we save a ton of money just on exchange fees. Number one. Number two, healthcare insurance, we're saving people, we're we have we're self insured now, so the community is self insured and we we control everything. So we do this only on behalf of our members to make the best products that we can possibly make for individual contributors. We don't look at you know, it's not virtue signaling. It's try... It's not cost management. It's not any any of that garbage that typically happens in corporate settings. This is all about creating the best independent worker experience possible. So we're saving people twenty to forty percent on their health care as compared to the state exchanges. It's better coverage. Most state exchange coverage is like state or jurisdiction centric, Like that's how they try to cut cost by limiting your provider network. Ours is national. So anywhere, and we we're even adding international coverage coming twenty twenty three. So, like, you travel, you no mad whatever. You just have to have your address in the Us. That's where your dom style. I mean, go get an Andrew wyoming or Ford or a Texas where there's no state income tax and then just go yellow, go do what you want. And we got a ton of people doing Now they still pay their taxes. They still do all the things Need to do. But like, that's the point is we sort of help facilitate this legitimacy for doing the things that you want. K? So health care is a big one retirement plans. We have variety of options. You can take a traditional four one k vanguard. You know, safe harbor deal or you can do a self directed four zero one k. You can do crypto investing. You can self custody, your keys, you can do all sorts of stuff and have your retirement accounts managed through our products offerings. You can get a w two for income verification or you do get a w two, not you can. You will get a w two. You get a semi monthly pay stub for income verification. You get long term short term disability access. You get other insurance access. You get Work men's comp access. You get unemployment insurance assess. So all the things that you don't qualify typically just kind of doing your own thing, you now get but you don't get it at the expense. You don't... You're not getting it and trade for your sub. You're getting it and you don't give up your independence. And you become an owner voice in in in the in the in the comments. Right? So, you know, it it's it's everything you could possibly want. So think about everything that you get as a traditional corporate employee, from a Fringe benefit standpoint, and that... That's what we offer. And we're gonna continue to offer more and more stuff, even other procurement things outside of employment like, eventually, we'll negotiate cell phone discounts and contracts and we'll eventually negotiate... We've already got discounted rates on zero accounting software. So, like, anybody who wants to use that for their accounting they can use that at a huge discount, it will add a bunch more, so there won't be just one option, there'll be many options, crypto friendly in addition. That just by proxy being a member of Ava, you'll get access to all of these tool sets in a very cost effective streamlined way. Then why would you give up your membership. Right? So anything you could possibly want around employment you get? And the the say that ", "start": 2038.4515, "end": 2289.9158}, {"speaker": "0", "podcast": "you have within the organization. Is that based on the amount of work token that you have? Like, is there like a a traditional doubt... I say traditional dow governance structure, which sounds funny. But is there like, some sort of governance mechanism related to the work token? So at one thousand members, which should happen somewhere around the first of the year. ", "start": 2290.433, "end": 2309.9067}, {"speaker": "1", "podcast": "We're migrating to a hybrid model of community governance and a board of stewards. The Board of Stewards is made up of members who are sort of like super users. Right? The house and the senate kind of situation. We've decided to take a progressive decent depolarization approach because some of the things that we're dealing with are not yolo. You can't yolo people healthcare. You can't yolo people's paychecks. There's a lot of regulatory stuff that comes down on this. So we've taken very progressive approach to our decent. But when it comes to features, fee changes. All of this stuff Your base vote is one member one vote, but the more tokens you earn the more voting signal you have is an employee member. Now currently as its slated, employee members will be the ones voting on everything. If you hold tokens as a coalition member, then you only have economic rights. So and that's done specifically to avoid, you know, people who aren't consuming the product from coming in and doing things to the product that aren't good for the members. Right? The idea is and a cooperative that you shouldn't be doing things that undermine your members wanting to be there, which is a lot of typical corporate game stuff like extract models and things. So it's an entirely scale play. But, yeah, you can... You... It's a quadratic voting system. That's at least what's being discussed and voted on right now is from on the board. But, you know, so the more tokens you have quadratic, you'll be able to vote those tokens based on feature changes, chick fee changes, direct, you know, jurisdiction expansions, like whatever we might happen to be doing, you can vote on these things and have your voice heard. It seems like there might be, like, some separate organizations? Like, is... There's the employment commons? And then there's op. Like, can you just kind of explain like, the legal structure. Yeah. So Op Inc is is the trustee to the commons. That of that entity will be merged with the comments here probably within the next year or less? Eventually, the trustee will be an in house function, but when we first set this up and, you know, the way investors invest before we had all of this sort of figured out. We had to put their money somewhere and we had to give them some sort of sec interest and that's what we did. So we had apple saying it's the trustee It has a services contract with the employment common Lc, which is the actual employment dow legal rapper And eventually, the employment dow will buy or merge with the op entity and that will become a wholly owned subsidiary. That's at least the plan at this at this stage. So I'm still at an employee of the employment common Lc. So I'm a member of the comments just like anybody else. That was more of a legal design for specific risk management and investor handling, but eventually that's that's all gonna be merged into one entity. So there's no external conflicts. Call it the exit to community moment. When's that gonna happen? Right? It's gonna happen? ", "start": 2310.8638, "end": 2503.981}, {"speaker": "0", "podcast": "Yeah. And this this probably leads into my next question was just wondering, like, as you've been developing this organization in this coop op? Like, what were some of the major hurdles that you faced you know, with this very unique structure with unique individuals that you're trying to, I guess, take care of and target. ", "start": 2504.941, "end": 2523.6091}, {"speaker": "1", "podcast": "Education most of it you know, when you're sitting in a acute farm, getting a W two, you don't really understand compliance or employment regulatory law or you know, statutory law or Aca compliance or Fl standards like any of this stuff. You have no You don't care. That doesn't matter. I get a w two. Somebody else is doing that It's not my responsibility. But in the independent world, if you're gonna take responsibility for, you know, just like taking responsibility of your private keys instead of having a bank. You know, now you gotta take responsibility of the private keys of your employment, which essentially are the compliance functions that come along with it, and op is here to help facilitate that. Now it's just educating people to that. It can be a little scary. You know, it's a little overwhelming. It's like, Well, even simple stuff, like, what state should I incorporate in? Can be a little bit of a... Well, do I need just need to be the state that live in? Does it gonna be, you know, I've heard Wyoming? Should I use a Wyoming Dow? Should I use Wyoming Llc? Why is Delaware better? What about Florida? What about hey, I live in California? You know, should I do this Do I need to do this? Like, you know, it's so overwhelming. So some people just go, I yeah. I'll deal with it later. K? Well, we're here to help with that. So, like, all those scary things and there's no sales pitch really. Most of our... I would say most of our selling is just education, just really trying to get people the information they need so they can make good decisions for themselves and their families. But once people get kind of once a light bulb goes on, we talk about red pill moments. Right? Once people get the red pill moment on op, they're like, oh. So I could be contributing, like, three different dow on three different networks and get paid in native tokens on all of them, and I can remit those tokens directly instead of having to get fiat to pay my bill for employment, you're just send of the crypto then you convert it all, then I get a paycheck and then I can go rent an apartment. Yeah. I can get group healthcare care. And then when I stop working for two out of these three dolls, I don't lose my health care insurance. Whoa. Cool. I love this. This is... Where has this been for fifteen years. I these are the kind of things that we hear. When you really get it? Because it's not like, you know, people see it and they're, like, well, how is this different from deal or Gust? And it's like, Yeah. You don't get it done yet. Like, once you get that we're dis corporate employer, sub, And I'm not saying that dr I'm saying that's a legal structure. It's it's mandated by the structure. We're just creating symmetry and alignment of incentives, and using the same compliance framework, ", "start": 2524.3262, "end": 2688.9497}, {"speaker": "0", "podcast": "but we're giving you the keys instead of giving somebody else's keys. Yeah. Yeah. That makes perfect sense that you're red filling me over here. By the way, on Op. It doesn't worry. I've already been kind of... I've already been... I've been aware of ob ever since I saw the work token pop up and, like Mark Cuban Wall I don't know if, like someone sent that to him or if he was an investor at one point. He went. I my understanding was he went and bought some work tokens. ", "start": 2689.4275, "end": 2710.352}, {"speaker": "1", "podcast": "So he started following us on Twitter about a year ago. And He follows, like fifteen hundred people or something. So, like, when he follows you, you know, he... It... It's kind of one of those social signals that people pay attention to. We were like, it it got brought to my attention. And so I started a conversation with Mark. About a year ago in in in Twitter, and we were just chatting in Dms, and it was like, you know, he's like, oh, yeah. He building is great. I love this. And you know, try to get him to come to December twenty twenty two, but he had a spring break conflict with his daughter. So, like, we'll see if we can get him this coming installation, but Yeah. I mean, I think why... If I were to guess, and I don't really know exact I didn't spend enough time with Mark to know exact like what his reason for it is. But crypto is desperate for real world use cases. And I don't think D defy and N nxt are real world use cases. What they are is there crypto world meta use cases that happen to be appealing to a lot more people in Web two than like other super protocol nerd level stuff is. Right? So it just happens to be more appealing. But what I'm talking about is the crypto justification of things we already do. The things that people need to do already. Employment is the most broadly you know, used function in the world when it comes to commercial experience. Payroll, So if we can create a system, a game, a protocol of public utility that incentivize people to do something they already need to do, But the outcomes, the design the incentives are just much more aligned for sustainability and positive some regenerative outcomes. Watch out world because like, then when you get network effects kicking in on that. These are things that Gust and deal can't say because they don't have a regenerative component to any of this. The stakeholder shareholders in those firms are not the users and they never will be. So unless you include people in the financial upside, what incentives do they have to help you build it? What the ten dollar sp you get for referring and another driver to the lyft platform. That's a one and done. Man, maybe I do it, but I'm not gonna be that engaged. It's not gonna socially change the fabric of my life. It's not gonna really move the needle economically. This type of model has the potential to to change the entire game of regenerative capitalism in a way that makes it very tangible for people whereas a lot of this... You know, the N nxt stuff just goes over most people's heads. I mean, I get it, but I'm down a rabbit hole man. We're not... We shouldn't be building for me. Or the, you know, the D defy, you know, crowd. Like, I've done my share D defy. I've got plenty of d gen d five friends, but that's not what's gonna take things mainstream. So I think the real inflection point happens when we find these use cases that people can just tap into and use and go oh away. That's crypto? I didn't even know that. And then boom, it's over. ", "start": 2711.0042, "end": 2924.272}, {"speaker": "0", "podcast": "It's gonna be a slow and study and then all at once. Yeah. And we are unfortunately like, starting to run up on time a little bit, but I just wanna make sure that we touch on all the topics that that we wanna touch on? And like, what what else do you wanna make sure that we touch on that maybe we haven't had a chance to address Well, yeah. Anybody... I'll just say this to your community Anybody who's evaluating ", "start": 2925.2424, "end": 2944.269}, {"speaker": "1", "podcast": "your insurance options for twenty twenty three needs to be looking at off now. So even if you don't join until January one, I would do it, I would take a look and we're saving people as I mentioned earlier in the podcast, twenty to forty percent off the state exchange rates and it's way better coverage. So there's no games. There's no garbage. There's no sales, forty needs. We're not trying to get anything from you. We're not trying we're trying to offer you a better path to live your best life. Okay? So come check it out. Refer your friends when you do it, even if you're not in the market for it, come be a coalition member if you're well network, and then just refer your friends. We have a a new program called friends farming that's coming out. It's actually gonna be out like, next week. And for each referral, that shows up to a qualified membership meeting, you get a hundred bucks, hundred Usd. And if they join, you get two hundred dollar two hundred Usd More. Plus you get the work token rewards as we hit our payroll mining goals. So it's like a double triple thing. So if if you got... If you're well network, you got friends working independently, they haven't heard of Op was just steer our direction. If you're super bullish about it, we can even include you in our ambassador program and get your landing page if you want something like like that. But, like, the point is is we're trying to incentivize our community to build the community. We are a community of communities that builds their community. It sounds a little cliche, but it's functionally what we're doing. So that's a big one. If you got friends in Canada, we're going live in January. There's some huge incentives for the first one hundred. So there's that. And then don't forget to come to eat denver and get our super awesome swag. We got some new limited edition print t shirts that come out. This is the first one that we have. This is called the Magnum opus. So it's a play on the Magnum Opus softest t shirt you'll ever wear. I've got like, twenty of them and it's pretty much all I wear, aside from other eat them swag that I've got that's all printed on the same t shirts. Similar stock at least different colors, but like, same manufacturer. And Denver is February twenty four through March fifth, we're expecting twenty five to thirty five thousand people from over a hundred countries. It's gonna be fantastic. So if you were upset about the long lines and they shitty bathrooms excuse the pun, the cold cramped spaces, like, because of our limited size and space, we out outgrow our old venue. We're moving to a venue space now that can hold up to sixty thousand people. So it's not gonna be cramp, there's not gonna be long lines. It's going to blow your mind when you see the things that we're doing this year. So I would not miss that. It is going to be the absolute Super Bowl of Crypto. Denver, February twenty four through March fifth. ", "start": 2945.126, "end": 3114.0728}, {"speaker": "0", "podcast": "And I'll probably be there. I haven't been East timber yet, but I've always planned ongoing. You're in Texas, and you haven't come. I've been a Denver plenty of times. Eighth denver ", "start": 3114.7258, "end": 3123.5095}, {"speaker": "1", "podcast": "not quite yet. Alright, man. Well, when you come, you have my invitation to my private tequila lounge, we'll have a little subaru. ", "start": 3123.9004, "end": 3131.8528}, {"speaker": "0", "podcast": "That sounds great. But and being from Texas, I do love Tequila. Well, John, I really appreciate you coming on the show. This has been very insightful and very interesting. So if you are working in web three, go check out op. And if you're in the area, well, if you're just in anywhere in the world, Go check out Denver. That's talking to everybody. So John, let's just one final thing working people go to find out more about you, ", "start": 3132.2656, "end": 3158.43}, {"speaker": "1", "podcast": "any denver. Yeah. So you can come to discord. You can find our... We'll make sure that the the Cord link is linked to the podcast. So that way you've got it. But you can also find our discord in our Twitter profile, which is at, op p l I s. You can find me on Twitter most easily at power, p a l l e r, j o h n. And Most of the conversations happening in those two channels. We do have telegram, but mostly we're kinda funneling you to discord, trying to get, you know, somewhat of a concentrated signal of discussion going because it's really hard to manage communities and all these disparate places that are going on. But, yeah, Op on Twitter and then come to our discord, come hang out. We got a lot of information to share and we can help you get oriented If you're not sure where to start. ", "start": 3159.8818, "end": 3210.647}, {"speaker": "0", "podcast": "Thanks again, John. For those of you who are watching on Poly Tv on Youtube, thank you for watching. If you're listening on Apple or Spotify, Thanks for listening. And give us a follow, subscribe, and we will catch you all next time on the Poly of podcast. Thanks again, John. ", "start": 3211.377, "end": 3227.6553}], "summaries": [{"title": "1. Exploring the Background and Journey into Crypto with John Poll", "summary": "The podcast episode features an interview with John Poll, the founder of East Denver and Op, discussing his background in the crypto space and his experience working for a dow. The conversation also touches on Op, an organization focused on democratizing employment. The text then shifts to the author's journey in the HR tech and employment systems space, highlighting their goal of democratizing employment since 2005. They discuss the challenges of the traditional corporate employment model and their interest in decentralized technologies like Ethereum. The author shares their \"Red pill moment\" in 2016, leading them to create Op, a project aimed at democratizing employment using Web 3.0. The text briefly mentions the concept of web three centric cities and the growing influence of web three in global investments. It also discusses the use of Op in decentralized autonomous organizations (DAOs) and proposes the concept of self-sovereign employment. Op aims to provide employment-related services and benefits to individuals, promoting the mass adoption of Web 3."}, {"title": "2. The Journey to Democratizing Employment through Web 3.0 Technology", "summary": "This text discusses the legal aspects of joining the gig economy as an independent contractor. It highlights the expansion plans of a global public utility infrastructure for employment, allowing individuals to work from anywhere and with anyone. The company plans to expand to Canada and Puerto Rico, as well as other jurisdictions within the next two years. The text also mentions the benefits of forming a legal entity, such as an S corp, for risk management and tax optimization."}, {"title": "3. The Rise of Web 3 Cities in the United States", "summary": "This text discusses the future of cryptocurrency adoption and the importance of making it more accessible to the average user. The author argues that the focus should be on building user-friendly applications and experiences that abstract away the complexities of crypto. The text also emphasizes the importance of tax compliance in the cryptocurrency industry and the potential for decentralized employment frameworks and community-owned systems. Additionally, it mentions the services and benefits that Op members can enjoy in web three, such as no exchange fees for cryptocurrency transactions and self-insured healthcare. By becoming a member of Ava, individuals can enjoy a comprehensive package of employment benefits while maintaining their independence."}, {"title": "4. Changing Landscape of Tech Investment in San Francisco", "summary": "This text discusses the role of work tokens in organizational governance and the transition to a hybrid model of community governance. It mentions the establishment of a Board of Stewards consisting of super users with voting power based on the number of tokens they hold. The text also explains the legal structure of the organization and the planned merger of entities. It emphasizes the significance of education in understanding employment compliance and regulatory laws. The text discusses the confusion surrounding Work Tokens and Mark Cuban's involvement. It also highlights the importance of real-world use cases in the crypto industry and the potential for regenerative capitalism."}, {"title": "5. Decentralized Autonomous Organizations (DAOs) and the Use of Op", "summary": "This text discusses the importance of exploring insurance options for 2023 and highlights the benefits of joining a specific insurance program. It also mentions an upcoming launch in Canada and encourages community building. The text announces an event called \"Eat Denver\" that will be a major gathering for the cryptocurrency industry. It also mentions an invitation to a private tequila lounge and discusses the advantages of web three technology. The text provides information on how to join a Discord community for discussions and support, and offers Twitter handles for further engagement. The speaker expresses gratitude to viewers and listeners of their podcast and encourages them to follow and subscribe for future episodes."}]}