{"podcast": {"title": "Polygon Alpha Podcast", "host": "Justin Havens", "image": ""}, "episode": {"title": "Staking Incentives for Uniswap V3 | Revert Finance | Mario Zavala | Polygon Alpha Podcast", "number": "23", "date": "NOV 28, 2022", "description": "", "url": "https://www.youtube.com/watch?v=15xrqqAnGMY", "speakers": {"0": "Justin Havens", "1": "Mario Zavala"}, "file": "november28.mp3"}, "transcripts": [{"speaker": "0", "podcast": "Hello everyone, welcome to the Poly Alpha podcast. Where the Poly gun community gathers insights from today's leaders centralized finance, web three and Crypto. I'm your host, Justin Havens, aka Crypto. Let's get started. On today's episode of Poly gon Alpha, we are joined by Mario, who's the founder of Revert Finance. Mario, thanks for being here with us today? How's everything going? ", "start": 0, "end": 25.690601}, {"speaker": "1", "podcast": "B justin and thanks for having me excited excited out some things for me analysis. ", "start": 26.262459, "end": 29.837055}, {"speaker": "0", "podcast": "Yeah. Absolutely. I'm excited to. Yeah. There's been a little bit of turmoil in the market lately, but from what I can see on the telegram chats and in the discord and just, you know, in Slack and in the emails, just a lot of d defy builders that wanna keep building. So it doesn't phase a lot of... Well, it phases a lot of people, but I think a lot of people understand the importance of putting their heads down and continuing to build. But besides all of that that's going on. Let's talk about you, Mario. What's your background and how does you get into the crypto space and then more specifically to founding revert. ", "start": 30.393105, "end": 73.21}, {"speaker": "1", "podcast": "Sure. So I'm a software engineer. You know, I worked used to before before I'm during the case... Crypto to industry, you know, building apps mostly at the time and in different time. You know, contracting for for different server projects. But you know, at some point I read the the bitcoin. White paper if you know, most of was in. And it... After say eighteen, you know? This to be exciting for me. I think for for a very of reasons, like, first the thing that the permission that's aspect to hit and and you know, it's just done like, like, this thinking of of a of of bitcoin, bitcoin also or, like, you draw some other you know, Sm D node you can build on top of that. So it's that that was easily exciting and also coming from Mexico and just only sort, like, realize you guys realizing that, you know, most most of the people are able to to actually save money here who drive not the keep pesos just out of the historic, you know, mismanagement of of the currency So so like, that aspect the field also, like, made sense though it it seemed like for, like like I foremost that the time I read just like I already I have to work experiment. You know, so I left that I started working Internet on on some different projects using, you know, machine learning and and and was eventually, it it got to a point that after, you know, after I think it was twenty sixteen fifteen point sixteen, definitely after you box and there was some still like a lot of fun gloom, like in the industry, but but it seemed like relatively and stable and, you know, realized that dynamics Mexico a couple of of companies were, you know, starting some exchanges and seem like really interesting. You know, project to to to embark with. So I basically just, you know, like, like, just research and one seemed really, you know, that was was being built by builders which seemed, like, something I I appreciate Team. So basically, convinced to environment business is like, twenty sixteen give for, like, extremely extremely model that point it was did, the second engineer hired. And And yeah, it a great experience. I worked at at at this sort from twenty sixteen, twenty eighteen, which, you know, by that time, it hadn't come like the largest exchange, probably in latin America and and the team, you know, was some was quite large for for like for, like, a start which is, like past by this or something at And that's because, you know, there was too many opportunities as right now it seems like really exciting. I saw the company to the traditional market like see five market making. Just realizing for that like bit. So we require the service. And, yeah, build that over a couple of years. So like, at the same time between twenty eighteen and break twenty when d or or like, the the, like, are previous we have in now we're really just starting up and talking out that was, like, uni swap and compounds and and you know it? Well, I don't you even you, like, before I it, but wasn't like during that time, I was really focused on C, but just like keeping my eye, Like, who gonna see Stupid eye out and and if I seem really Really I am. But twenty twenty, I, you know, decided to really just focus on on D and and started you know, just diving unit but was great time for to tuesday take summer twenty twenty. And just figure out, you know, what interesting things could be built. And that sounds like how in a record works really because, you know, it started Lp and myself in in different pools, you know, this was beef, farming era, and you'd have positions in you know, any number of exchanges and it's really hard to to get proper attractive if you are actually your how much money you were actually making and and sort of like, River evolved as a scratch on each type of team where I had an excel that became, you, I know you into updates so let's me this, and then, you know, became something that that the really required the nashville tint and and food be product school and and did that and and, you know, and started, you know, get excited I'll just speak, you know, you know, how the fine. In general, a in particular evolved for the next years and just getting more and more excited about, you know, focusing on building tools for for, like, L lps, you know, in in in the verbal, which is, you know what some point. Great. You wanna decided to to to race around the a small sea by the end of last year, we closed around and, you know, we spent this year buildings, building the demon and shooting some products in really, you know, excited about well, we have a heads, like, realizing that task, like, during the next year's ravi, probably are different than than what was before. We've all truly been around and and seeing this or expect what's coming and just kind of... Yeah. Like, decided also about having to trying to just focus on ship stuff and and hoping like this. He saying you know, things that happen during the wall and during the crashes. Are you ", "start": 73.85, "end": 421.58347}, {"speaker": "0", "podcast": "less. Right. Yeah. That makes that makes sense. And, yeah. So revert finance, you know, you're building on top of Uni swap. And not only uni swap V two, but also you to swap b three as well. So let's let's talk about that a little bit. Like, what are the sum of the challenge challenges that you have had to overcome when building on uni swap version three specifically. Because I feel like like how long ago did Uni swap v three come out. Like, it's it's been a while. And I feel like we're just recently I mean, there's been some people building on uni swap V three, I guess, in the past, but it's taken a long time for a lot of builders to build on top of that comp comp. So just curious as to, like, what what are the challenges the devs face when building on top of Version three? ", "start": 422.4364, "end": 470.1154}, {"speaker": "1", "podcast": "Sure. So if If I correctly launched like, early twenty twenty one. But, yeah. So so... After, like, you're saying definitely we lost color of Think in in in in that type of in the new type of of Design. You know, I think I think t trails are natural and in engineering and it it was, like, I think on that, I would trade off. I mean, I think with us like, the purpose of of uni swap is, you know, providing query for swaps, you know, and I think. Just just definitely, you know, I mean, my amount liquidity and and and, you know, we can process all them voice. That's definitely a good trade off. But, yeah, I can That the interface of having, you know, Es twenty represent a pool and where they they're all buying the same was definitely much easier to. I wouldn't say, like... It was... I wouldn't say this Necessarily with asked like. Analytics, and tracking performance of of like, individual accounts. But definitely reverse building, you know, protocols that somehow use help tokens. But but, you know, I think it it also calls with with a more express for for Lps, which after, you know, spending this year talking to to quite a lot of them, I think it's something... I mean, all these the ones that use definitely appreciate it. And and, you know, it makes sense... I think like the the sum, A lot of them. I think with two... And and as I think it's... I feel like the the industry all like, coming around on the idea, I think when originally I do is a between lunch, Like, I'm just out of the gate, like the the take by most people was, this is gonna become, you know, like traditional market making or order books. In the sense that you're gonna require some five five minute system that's constantly the adjusting your ranges, and you you know, of course, that that was turning into a game that's controlled by by Few bur who, you know, experts to run the type of system. Which I think is a incorrect just by this misunderstanding of of the advantage you would even have if you if you would do that, which, you know, there may be some in in certain price scenarios, but but but mh most likely not, like, if you were to, try to maximize fees and people. Of course, Have done this. A lot of times in a very tight range and then updating custom and you're just gonna crystallize burn loss, So That I think is I was strategy. And and like, the the idea positive sticks from that, people use the term with refer lane. Well, normal retail piece who are not automated because... I know like, passive could be that you're not taking and an I thing. Definitely, when you initiate a position, you're like, selecting a range, which supervisor have, like, So market opinion and definitely probably an aspect affect arp pool which probably invite you have some opinion as well in the, like volume you expect to get from this pool. So that's already like, not. Just active. And and also like, just you can just look at how long positions live and most are, you know, adjusted and updated, you know, in days or sometimes months. And and sometimes like like, a multi of positions to to exist, but like, there's there's all sort of of no peace and really like there's a... If I had to, like, through, like, think of a persona that would say back who are the people that there are hell being or at least L bean and Houston regards as a tool. It's people who are, you know, usually have a little experience in d defy. They are pretty much, I would say, you know, a trader profile Like like, people who I also have strategies going on on on some sort of of either you know, you know, like my taking positions in in in children's markets or or or different or just, you know, I'm trying to to time whatever you know spot praise they do. And, you know, analyzing charts, that type of thing that's that that's some sort of like the user persona. So I think just to summarize, I think what when Uni saw threes like solves, really in in a great way. Just abstract you a way. They just. You normally an nerd would have like people who wanna trade on both sides, but, you know, they're they don't... You're not, they don't know to mention times, so you need micro makers to disrupt like fill the gaps. Right? And, like, the uni of b tree, you know, model allows for the trainers or for this type of traders to actually require less of spread bulk sides of even if it's buyer state also. Just to participate on both sides by taking, you know, their market positions and then And then you have... Like, the the professional hardware there just, you know, keeping the pricing range and everyone you know, providing fees for the piece. ", "start": 470.83084, "end": 794.1164}, {"speaker": "0", "podcast": "I guess, like, the the next question I wanna ask is, you know, what is Revert finance? And what does that do? Like, what what service are you providing on top of the Uni swap, ", "start": 794.91534, "end": 804.12476}, {"speaker": "1", "podcast": "I guess, tech stack? Like broadly, I I I would say we're building tools focused on piece and Am markets. Right now and for the best month we've been... Only focused on building on top of units side. So just very, you know, precise fit where those tools are right now. That's I think the the most useful ones that that we have on on Hound app is something we call the ini, which lets users. Adequate like, initiate position to strategy. Right? But, you know, it helps you by context contextualize some data to make the required decisions, like what Pool you wanna choose and then what way you wanna choose, it helps you. You know, it seems like the... You're showing them the historic, you know, fees and volume for pools and and and it also lets you, you know, compare the two of different pools and it's sort, like, those have a receivable back test given you selected range and, you know, the price and volume, you know, that was recorded over the last, you know, whatever brings. Select. So that's... You know, the total of helps you like again get a sense like of how, like that and your frame just how you can pools would have would have affected your your performance and I think that's that's very helpful And when you're initiating this position. Effect? Like, the the next step is tracking your performance. Right? Then, you know, as we talked to different user, we be like, know everyone, you track benchmarks and performance segments against, you know, all board assets or whatever else you the boss right, which is where the budget lost for a permanent impairment cluster or, you know, whatever turn we have for you this week. Is it comes into play. Other for example just one, you know, like, benchmark the the value of the C. And then and then we don't don't care so on of about... If if they lose on. And you are talking, So we, like, felt the attractive performance of your positions and essentially, you and I make it very easy to, like, manage those decisions. So I think it if when you wanna exit collect the fees, you know, add do liquidity if required. And, you know, I just want you any you're tracking your positions Send mean, you know, regular where releases and sort, like, updating based on whatever you know, eases you had when when concerning them. And this is what the go powder goes into play, we because some, you know, also I thought to users, we we realize that they just from other lot of them, really wanna the back into the position. And that used to requires, you know, to or three different transactions. And then we just help you automate that by having a single protocol or, like, workers are in search of that for a, like, a small percentage of the of the. And you know, finally, we have the section where you can just, like browse the open position from on Uni Three on on you know on the four current change the that's already and, you know, filter them by whatever criteria you can that. You help some helps to you find the interesting pools just by figure out what other people are doing some poll you might be interested in And yeah. Just like a convenient way to have, like, an overview was happening in on and new so. ", "start": 805.6448, "end": 1008.2517}, {"speaker": "0", "podcast": "So does revert manage the bands ", "start": 1008.9702, "end": 1011.1467}, {"speaker": "1", "podcast": "like the the price bands for l lps within Uni swap V three? No. No. So we're nothing. I the kind of putting manage their our has, like a specific strategy where you on deposit. So we're definitely mean... We're totally focused that at Lob step one manages their own positions and the decide on their own ranges and the side one I enter exit, and and those are, like, I think. Yeah. What the the like, the the type of view I was mentioning were. They're they're all very, you know, trader like focused and And, yeah, the the tool we're building with the t enough of this type of user with tuck. ", "start": 1011.7798, "end": 1046.6471}, {"speaker": "0", "podcast": "Yeah. That makes sense. But the auto compound sounds very interesting. As well. And, you know, I guess, like, if I were to Lp a position in Uni swap, why should I use the auto count compound if I can just do it manually? ", "start": 1047.5208, "end": 1062.2368}, {"speaker": "1", "podcast": "So doing it grand, you can do it? You know, like, collecting the fees and then, you know, swapping if required and then the bus and into the into the position, which would involve a future transactions. You can do that that with the by, depositing your position in the transfer position you have to compile their contract, manually by clicking one button and it does, like all those things and it doesn't charge fees. Right? So so I think that's... If if people like manually manually and don't pay two percent. Think this is like a convenient way to do it, like, and probably the cheaper in the sense just be one. One transaction, the depending how relevant the gas could start that chain. But like the the function of outer to compounding where like, that there's, like, like, there's there's this very simple particle where other you know, work workforce standing weren't really can basically take any of the un collective fees or of final positions. You know, do whatever swab is required to put it back into the position, like, the... To there wasn't blank the collect back into the position. And then they can take one percent of, like, what was a positive as you feed because they they pay the gas and all all work and then one percent goes through pro. So who were of the collected fees, you know, go to the protocol in in total, and you have this automation. And the average is nice not just because because maybe, you know, they'll do it more frequently, then you would be able to do it manually. But but also because, you know, the the way that system is set up, it optimize automatic optimize automatically, for example, for low gas cost. Right? Because these workers are paying the gas goes. And, you know, they'll do it when the gas goes to lower than, like, the one percent they're getting. That means that's, like, for example maybe it, if you have, like, the whatever weekends where the gas is lower at tree again, you're probably gonna get a compound, you know, at those modes. So it's a real. It it it's it's optimizing. You know, ways of manually would just be very hard to ", "start": 1062.8531, "end": 1187.7438}, {"speaker": "0", "podcast": "Yeah. And are there modi quantifiable parameters to the compound of, you know, could I as an Lp peer who's using revert decide like the frequency of the compounding or what are some... Are there any modi parameters, I guess to the compound? Yeah. ", "start": 1188.0547, "end": 1203.0743}, {"speaker": "1", "podcast": "No more final parameters for for for the users. With regards to the just start compounds or still of the compound and it'll just either two percent and you know, it's instant... Because you're always paying two percent you know, of of wire compounded. You're you're, like as an Nlp, your interest is that that the compound is happen to strictly the possible because you're paying what, two percent whatever happens. Right? And and and for, like, the the for the way that the competitor and Incentivized to compound your, like, the coming for the worst. Are incentivized to, like, execute this and pay for the guess, because it's just because they're getting, you know, there's one percent back and if they don't do it, some other, you know, but we'll we'll win that. We'll win them to it. So so that's like the how how that, you know, works. But, yeah. Like, there's no there's no option. We we'd, like, try to keep the simple or start. Stop about the compound. There's one of file parameters to the contract would apply to, like, the color contract is managed with regards to the fees we're charged. Right? So like, there's a multi... There does a time with a multi stick and right now the the two percent. They could add like one percent the below one percent to the compile and they could potentially be modified down, never up. Just out of security, you know, But but yeah, that's it. It... It's a quite, you know, a, you know, focused and simple contract. ", "start": 1203.9534, "end": 1294.3112}, {"speaker": "0", "podcast": "Okay? And I'm also wondering you know, who else is doing something like this in the space. Like does like, who are the competitors to revert and how does Revert differentiate itself from any competitors? ", "start": 1295.0435, "end": 1310.4921}, {"speaker": "1", "podcast": "It's interesting. There's there's people in who soft with regards to analytics and in uni unified tree, like, you know, there's there's senior layers. That allow you to, like, get an idea for a range of how the environment allows my my work, there are some there's other there's at least one more cool product that that is do or, like, analytics for for L lps. I think there's people building in top of Uni three doing things like liquidity management. I don't know... I think really the... Like, what we're... What we what we're built and what we're, like, building so far puts us not exactly, you know, those and it's, like, Right. Tools for Lps, analytics are a huge part of it. We're also, you know, that involves, I think making things convenient, and that's when we go to like one chain stop, so we have already this compounded protocol, we're working on all forms of automation that that I think will very useful be. So I don't know. I think... I think there's... It's it's too early that we'll see help things shake out and and if if if I I think if anything works out we're definitely gonna have birthday competitors, But right now, I think it's just... A bunch of different projects building on top of uni me with sort like, some going to see this as admission and some near inconsistent and, you know, I I wouldn't say exactly who really really unsure. Okay. Okay. And ", "start": 1311.2236, "end": 1402.9464}, {"speaker": "0", "podcast": "Let's talk about the liquidity mining program with Poly gon. This is exciting. There is a liquidity mining program with Poly gone. Coming soon. This will be released about a week after we're recording and so maybe a week after that, we'll be ready for the liquidity mining program, but let's go ahead and just share, Can you share a little bit of the details about how all of this is going to work? So originally, you know, ", "start": 1403.7389, "end": 1431.2041}, {"speaker": "1", "podcast": "with red, expectations from from, like mr. Uni well, I'm launched a taker for for liquidity wine and Uni true. Right? Just uni have too, of course have become such a success with with regards to liquidity mining a contract reading. But but by people not a Uni stop, but you know, became sort like an industry, you know, stand new one he assisting. It's And, of course, like that same guys doesn't doesn't work when you have dream because of the difference is sign. Right? So you can swap, you know, launch this contract, which just really fantastic and in in in a lot of ways on especially compared to, like, what was previously, one of the more obvious ways is that, you know, with with previous, like big or the, you know, beat to side minding things, like mining green money products, So any of this new... You know, the liquidity money Forex creates a new contract and deploy it and, you know, the game back in twenty twenty was, like, figure out. Are they... Did they change any of the culture in a way that's dangerous you? So that... That's Argentina not ideal with regard to user's safety? You know, the use of between taker is fantastic, it's one canonical contract. Anyone can permission of create. Incentives program in it, but you know, having that this. We say for not and this is for whatever, you know, the centers brown, I think it it's really a great forward reduction to to security in mining. You know, space and And, you know... So it it was very exciting when they launched it, and R was the first to try it out in a in a massive way. You with some real, you know money in per owners left grand a month. And you know, what happened was... Well, Liquidity was definitely mined. Like, it was a huge success with regards to having, like, a lot of liquidity barely concentrated concentrate there on the current price in the sense that, you know, they would maximize basically the fees they would get. Normally, time resulting, you also having a lot of impairment us. But because they were getting, like because the rewards were directly tied to the fees as well, you've drawn the rewards over the fees and then the verbal laws often matter. And so in the end, what happened was like, I think ten accounts basically it took, like, eighty percent of the... Our... Like, I I don't have, like, the tech numbers, But, like, you get the idea of the of the rewards, you know, and dumped it and like, the strategy will basically just be around the credit ticket and and are very fashion with the press moves, you know, just go to the new tape like, dumped the rewards. And of course, that's right... Not what used to happen with farm which felt, you know, very dumb crashed. Anyone could, you know, just have this sharing the same risk. But well like, you tokens and you know, be a risk of up. Whenever I ru it, you know, it in Wasn't like exploit like by very small, like, alameda players. So So, you know, the volume team, you know, wanting to incentivize a create use for B three. We have in China, they sort, like, good that they told, basically, you know that they really wanna the was liquidity they wanna do it in a way that you was directly to... Incentivize the way direct. Help you directly, but they were, you know, aware of what happened. Would just take your last time and, you know, why yes. Could we, you know, come up with to serve, like, a address issue? And and, you know, and know, Anti tom, Joe have from the boil of deep office. Like mentioned mission, like, new something we can do with staking, And, you know, we'll started researching, and I eventually filed out that Mori allen who is, you know, one of, like, original you know, uni beach be, you know, riders. That have proposed this idea of modifying the sticker to have some medium best in period So you wouldn't have this explain where, like, people like like, just like got a very tired on specific thing and then you know, when I they off range very quickly they just on rewards. So, yeah, we implemented this idea. I was... We formed the second implement this idea. You know, the political team liked, they paid for but part of, like of of like the... As part of like a an a program and forget name sorry. They they, like, pay for for like for a shield already from the contract, you know, and and we type polish like a a month, spending what what the idea was. And, you know, had so feedback from from people who excited as well of a... I wasn't gonna turn out, and we're gonna see... You know, next week. I don't think I can know exactly you know, what tools or what amounts but basically the ideas we're gonna try this this sticker with the best period, you know, on mongolia, and I think I think we're very excited. I think it's gonna bring back really mining to uni up between in a way that is really, you know, sustaining what accessible about and that that rules for for for the projects and why, you know, this is two the incentives. ", "start": 1432.4802, "end": 1754.1997}, {"speaker": "0", "podcast": "Yeah. It's really exciting. It's it's definitely something that we're very excited about. And I wanna talk a little bit more about the Uni swab v three steak more specifically is... And you touched on this a little bit, but why do you feel like the original v three sticker was not used as much as expected? Like I said, I think you touched on that a little bit, but then also why did you decide to fork the sticker? ", "start": 1754.6942, "end": 1779.8562}, {"speaker": "1", "podcast": "I think the the reason why it was used was because, you know, after what happened driven on other, you know, dials organizations didn't wanna have the same, you know, in like, the users being end up being happy and most of like the the users in their community because, you know, even though they provide liquidity in, you know, in a normal way. They got a very small percentage of the rewards. The they were happy about the price action, I mean, we can't be sure what happened, But but, like, definitely, having, like, all the rewards go to some hour stretch are automatically dumping the token, it's probably not gonna be, you know, good for press. So, like, in like, both those things like the fact that it was... And it wasn't really distributed widely, but to v expect captured by very small players you're doing a specific strategy and that those players were probably gonna be mercenary and not part of the community is, I think why a from hello projects I'm bar hesitant to use it. And and then... So why will to the reasons to... So we were thinking of, how can we, you know, click, prevent this type of strategy where where users can like, really concentrated concentrate liquidity in a way that wouldn't make sense absent the the rewards. And but the thought by next day. Even they're also happen we prevent this and and and yet, like, we would sell and say the of of, like, having a a basic built mentor sense and given how, you know, the the uni historical contract. So a meeting we we could we've could, you know, relatively so you do that would at Florida would would not not that much of a fact a like change wise. So the contract and yeah. And what will he help myself? I mean, we have, like, Apple uber request in Uni up? And who else, Like, if I think ideally if this Like, after this, you know, liquid query I poly proves that that is like a better model to incentivize the white degree. It would get merch. I I don't know. But I think I think definitely, like, there's a opportunity and who gui my stop tweet that, you know, that haven't really taken off. I think it's because we could tweak how this taker ", "start": 1780.5892, "end": 1916.7386}, {"speaker": "0", "podcast": "contract work and I think. Yeah. That this is this an interesting way to do. Yeah. That would be really interesting a reverts request to the Uni d three stake did get merged. That that would be pretty fascinating, I think. But let's let's talk about security a little bit as well. You know, it has been audited, but what other... Like, what are the risks that users should keep in mind when they are using revert? ", "start": 1918.3246, "end": 1942.5421}, {"speaker": "1", "podcast": "Specifically, with us to say select there's... At at this moment, we're like, talking of two different, you know, contracts, and I think point where there's, you know, a smart contract that you've gotta assume there's smart contract chris. Right? So so we have a compile culture and at that point, is people black activate out of compounding. Their n if the token is, you know, transferred to the contract. And this contract, you know, has no way of, you know, remotely pretty, like R video regardless of liquidity, like beyond, you know, it's it's it's obviously the sign a way that that's secure every receivable and I saw it, but there's there's risk there for sure as main contract. I think. With regards to the sticker, I think I think slack... It's brings you or, like, in the sense that you're sending in your energy positions to one contract and, you know, the context challenges of leave more regards to what I can happen the position, but, you know, there there's some smart resistance. It's really in same the same type of reset. I would think... Yeah. Both what happening are that I think what makes perhaps the state curves seems safer Think logically the safer is than it's been used by uni swap for longer, you know, portfolio operators for longer and there's some... You know, we need to ask. Of course, our for. You might have the changes. It's not the same counter. But I think our our our change is only, you know, in a way that that hitting a probably code that put it sec, like, you know, any any type of risk for for the actual positions it's just having reward share the distributed. Right? In general, I think users are right certain, about using a different interface, like word is an interface for, you know, Right now, Uni swap, and you know, the the the use of is within the sticker for the sticker and, you know, it's eventually gonna be any his four The verticals as well. And I think there's not understandable our people should be bringing diligent about using front ends because of death potential vector of attacks, so I think income you know, the the the the real thing... The the only thing that the sort, like gives you confidence is if you, like, half a, you know want a long track record of of doing things, you know, dealing to the end incorrectly and just security the mind that not not clear your user address. And I think, you know, we started out and very focused on that, but I think over over the years we'll hopefully build the reputation in that area. But, yeah I think those basically those are the the risk like if you if you just miss it roberto tensions is it the deposition fact. There's absolutely no risk. If you, you know, use one of the smart contracts and some smart, chris. And if you just use an need, as an for interacting. When you use up as long as you, you know, there's some front end risk, like, you know, things front and half and happen and so forth, and and what I would advise is for any interactions, people should really be, you know, aware of, like, the final aspect of other, like, signing the wallet. And you know, let's take a different topic of conversation but Sure, like, years in walls will improve over the next, you know, months and years. So ", "start": 1943.3502, "end": 2155.9438}, {"speaker": "0", "podcast": "that being happens less than this. Yeah. Okay. Yeah. That's that's helpful. Yeah. That makes sense. And how is the protocol managed. Well, first of all, I wanna ask like, are there any revenue drivers to revert? Like, how does revert the protocol make money? And if it does, are there if there are revenue drivers, like, how has that treasury managed? Is there is there a dow, there's no token. So just curious about how that works from an operational perspective. Yeah. So the the red compound vertical ", "start": 2156.3975, "end": 2185.62}, {"speaker": "1", "podcast": "is revenue generating at the moment. In the sense that it takes one percent of the of the going around the fees and, you know, I keep it in the contract in the So that's all, like, a... The protocol treasury. You know, the the purpose is gonna be o and managed by the team. It's it's like, I said was a quite simple vertical. Going for, like, and how we operate, I said so, like, raise you know, capital late year and we, like, are really not not using that the revenue you're calling for Protocol. But going forward, I think that's sort of, like, in line what we see as as how we will sort, like, have a business model. We definitely don't wanna have like, how to be a sort, like a Saas type of thing or or put a type of payroll things very useful to have. You, you know what an open interest right, You know, like, and neutral record of of Am and and and how they're performing. That what we wanna built and definitely wanna keep it open. So I think... Yeah. Like, the thing we will do for for for revenue will be similar to what the coupon is doing and just like, automate and and make, you know, convenient, you know, functions that that that that that help our users and and and charge some some some of the... This in the idea. And, you know, at that point, it's it's not really a product I think. I think there's there's there's is we we we we definitely wanna build that would be more in line with with sort like that. Traditional and umbilical that will require, you governance, but where we have obviously not not that ", "start": 2186.3945, "end": 2294.2434}, {"speaker": "0", "podcast": "Yeah That makes sense. And I I think there's something you you touched on earlier, where you were saying that... I don't know. Would would you say that you would push back on the notion that... Uni swap v three is more for professional traders or do you feel like that retail can also get involved? I no. I just feel like I feel like Uni B three is almost targeted towards more like professional liquidity providers and market makers because you have to manage that position. So I don't know. Like is there like, is there a way to give edge to retail users? Do you feel like Revert does that in a sense with a compound just get your thoughts on that in general? ", "start": 2294.555, "end": 2334.548}, {"speaker": "1", "podcast": "Yeah. Think I think definitely I think so. I think so like, wanna what I will push track is is in, like, first, like in in in in like, I don't little people do this that you have to, like, like, Gong. If you wanna b and, like, you wanna, like, automatically rebalance or somehow, like, actively management position. So for example, there there's a... I'll I'll give you, like, an example of something that you might like a... Like, like I adi you some Lp might be. Say you think, you know, You have your old And Btc, and you think, you know, it is gonna be oscillating between point seven and point twelve. For the next year. If it goes point on out of point twelve, you'd rather, you know, take profits and and be in Bg and you said it goes to one conservative rather, you know, just just buy case because it pick when you'll be undervalued. Right? But you generally think you'll it'll trend in in in that in the in those on within that range. So so you open a position and and you get some fees. It's automatically managing it for you in the sense that like, if those thing happens, if it goes out point twelve years. Like if it, go towards when twelve start taking profits at at point twelve Europe. So Like my point is you can think of of of our visas. No. Not just a game or of the do. Do the feast... Big the impairment was. I don't Don't think a lot of people work are pretty exclusively on that game. And you all like, I remember when buy loans they were very trying to drive this message phone. Right? Like, it's so you can think of, like, a portfolio relaunch or and you have, like, six assets a you rebalance them for you. And you're considering you're impairment lost at that point, like it's about our everyone. Right? So that... There's those. And I think that's why that's that's like some strategy that wasn't available. It's previously retail, doesn't are require any type of automation. You just have, like, have a a market position. You think, you know, whatever range is is is what you wanna, you know, take this position on, and then you just let it drive. And you can enter it, then you can, you know, At any point you know, take your pliers and exit the position, but you know, general that those that will require that type of strike would require, you know, any kind of automation. But also, you could, you will also have, like, Doctor Will do the for, like, do fees in the dial game. And that also, I don't think requires and really updating your position constantly. It's really more of a on like, like, having an an idea of of what like, the brace and the price and volume for for, like, the and the full specific you might need and then just taking a bit on that, and it's, like use... It's not like... It might be in a short time like you might wanna have that position for seven days, for example, doesn't require any type of automation right. So we also see that. And I think the idea of why, like, the the only reason why it with Deep big players or or like it we call, like a very, you know, more in line threshold market maker, you know, like, in... The industry is that... Well, first the people thought, like, well, this is gonna I make, you know, having to, like update your rage constantly, and, you know, by whenever, you know, market, this is advanced stuff and, you know, they're gonna win. And I I just think that's a good strategy. Otherwise, they definitely hump doing it and damian and Think there. But it's just, you know, of course, the minimum about the price action is, but just re revising and go through there Images can be just... You can leave direct. Whereas you, you know, you start pricing where it otherwise, you would have, like, the the branch of part, you know, be erased by by a by price version. And and the other one was on top like size. If there's enough size, and this is because use opt three launch in high gas cost environment, you know, Like, if you wanna also do the reverse, you can't even do it yourself. Like even if you wrote the bot I, you know, the signals, it'll cost you too much to rebalance, And, you know, both those states I think like, first the first strategy was not a good one. And the state on aspect of like, the highest goes of was well, in environment like, well, it's really not an known issue. You know? So so I I think... The this idea was was just, like, ", "start": 2335.1057, "end": 2602.7378}, {"speaker": "0", "podcast": "I gave ", "start": 2603.709, "end": 2604.447}, {"speaker": "1", "podcast": "the the the the the white spreading too, but as some sort of like I think, you know, this is debate of, like Yeah. Go, like use up real obese with, like, traditional market makers. ", "start": 2606.0112, "end": 2619.857}, {"speaker": "0", "podcast": "I'm curious like, what are what are some of the bigger positions or like not position. Sorry. But like some of the bigger, like, pairs that the auto compound is use... I would would assume that you're not doing like long tail assets or very exotic pairs, but more just like liquid pairing. ", "start": 2620.5898, "end": 2636.6196}, {"speaker": "1", "podcast": "Would be would be a more of a focus for the auto compound powder. Well, we see both definitely like the larger positions we've seeing are like, you know, use schematic and and, you know, Idea traffic, which you would expect. But but, yeah, we we definitely see long term assets on like, just just because they're also like I think... So fit the profile of already, you know, the the more powerful users. So so... Yeah, we definitely see. Long assets on, you know, we also see the the... Like the compile is on, you know, grow steadily, but when we have this on, you know, big volatility. You know, we see people rearrange you the ranges and and, you know, like... It it people so, like except precisely not being passive that and just, you know, like, they similar to a trade took composition. And then, you know, something happens and the decide breaks for the position or not, and they, you know, reassess them and we but. But, yeah, I think we we see thank pretty much the whole range of of pulls from the various dolby ones to to Yeah, thanks very much. This is definitely where you would expect that under your. ", "start": 2637.3489, "end": 2712.7795}, {"speaker": "0", "podcast": "In other protocols and, like other teams, they can they can also provide incentives to revert as well. Right? Yeah. So... Yeah. That's what account. When when of it loans to the state you booked like, ", "start": 2713.5752, "end": 2725.067}, {"speaker": "1", "podcast": "you know, a Ui was real consortium. Which would allow, yeah. Any any protocol to we have this Ui to add, you know, whatever tokens they wanna... Give incentives to send you all the parameters of how long they want them for incentives period large to to to how long how long they wanna such period to be? And how, you know, what proportion of that do they want the best in period to me, Right? To So so, like, we you can say, well, we're gonna give this, like, incentive firm is gonna last you in three months. But for it to be fully invested you perceive has to be arranged, you know, these three weeks or or or what I'm noticed necessarily, like, parameters is. But, yeah, It's it's pretty much arts come and social serve and at that point, it's some. It's life on on under you know, say your contact it's s on on the Dolby life on that site where, you know, anyone that can see, like, the current trying incentive it price. And like with they then go river, We have, like, an our our own, like, incentive staff where you see... Yeah. Any of the incentives per created. ", "start": 2725.5212, "end": 2794.416}, {"speaker": "0", "podcast": "So that's that's the how the incentives are calculated when staking in the V three. It's based on the amount of days that you're in range or is it based on the amount of fees that are generated by your Lp? ", "start": 2795.0696, "end": 2806.5757}, {"speaker": "1", "podcast": "Vote. So it's it's based on the fees that the directory in proportion to, like, the disease that, like, all people on that pool are, but there's all in your vest in period we have... We don't have this attack we manage mentioned. Right? So, like, if your position... Like, the best in period last twenty eight days and your position was only because it was very tight and trying to get a lot of fees and and and you was wasn't engaged on the say, you know, six hours with twelve hours, then, you know, do proportional, you know, best in rewards time you were what you regard would be, you know, like, a then, like, one sixty or or whatever to us. You. And it's all you're investing. So it's a your position. You know, it stays in range for two weeks out of, you know, a four week vest period, then you would get, like, half of you of what you guidance. So it's incentive it it's, like the point is trying to incentivize you know, wider raise security that we otherwise been the pool and that and this, you know, ideally more sticky and and has already, you know, perhaps or probably a holder of of the of the toilet in the pool and not, you know, some... Mh. You know, farmer who was, like, just trying to exploit the strategy temporarily and really has no plans to ", "start": 2807.0557, "end": 2885.662}, {"speaker": "0", "podcast": "took to walter. Yeah that makes sense. That makes sense. Well, Mario we're unfortunately kinda coming up on time here, but I just kinda wanted to get just a final word from you. Are there any questions or topics that you wanted to touch on specifically that maybe we haven't had a chance to? So I think I think we we've regard pretty pretty well. I mean, ", "start": 2886.2756, "end": 2906.8816}, {"speaker": "1", "podcast": "just, yeah. I I... It's it's it's like, I think the the liquidity the steak is gonna be... I think really exciting. I'm hoping, you know, users check that out and and, you know, hopefully, we'll we'll we'll prove that that, you know, like, user, which we can can definitely be like a a great way liquidity lining, and and, you know, we'll have some sort of like resurgence of of days of halt farming Ul. ", "start": 2907.9172, "end": 2939.982}, {"speaker": "0", "podcast": "The days, the the original farming days with Uni v two Those were those were good times. Yeah. I I I'm loving to see, like, the the innovations and just the development of people building around the comp comp of Uni swap, v three. I think this has a lot of potential love what revert is doing specifically, obviously, the Poly d team loves what Is doing. So, yeah, we're really excited about this. Pay attention everyone and stay tuned for the announcement of the liquidity mining program. And yeah, Mario, where can people go to find out more about you and revert? ", "start": 2940.7808, "end": 2978.9956}, {"speaker": "1", "podcast": "Definitely View Finance that's our our Url and and Twitter where we were Finance as well. And and, yeah, Roles, we will have this for that leave there and please, you know, draw in. Answer any question, having Happy have to talk me you. And then thanks for thanks for inviting me Distance. This is This is fine. Yeah. Absolutely, Mario. It's it's always a pleasure. And for everyone who's watching on Youtube on Poly gong Tv. ", "start": 2979.7297, "end": 3003.0112}, {"speaker": "0", "podcast": "Thank you for watching. And if you're just listening on apple or Spotify, Thank you for listening. Oh and subs two, you could be listening on subs. Because that's a thing. Thanks everyone for listening. Thanks again, Mario and revert for joining us, and we'll see all next time. Thanks everyone. ", "start": 3003.5837, "end": 3020.1135}], "summaries": [{"title": "1. The Importance of Building in the Turbulent Crypto Market", "summary": "In this episode of the Poly Alpha podcast, Mario, the founder of Revert Finance, shares his expertise and experiences in centralized finance, web three, and crypto. The article discusses Mario's background and journey into the crypto space, as well as his role in founding revert. It follows the journey of a software engineer who discovered the potential of Bitcoin and eventually joined a cryptocurrency exchange in Mexico. The engineer discusses the growth of the exchange and their focus on building tools for liquidity providers. The challenges faced by developers when building on top of UniSwap Version 3 are also discussed."}, {"title": "2. The Benefits of UniSwap for Traders", "summary": "This text discusses the concept of auto compounding in UniSwap and its advantages over manual compounding. It highlights the convenience and cost-effectiveness of automating fee collection and position optimization in financial transactions. The system optimizes for low gas costs and maximizes efficiency."}, {"title": "3. Liquidity Mining Program with Polygon", "summary": "An upcoming liquidity mining program with Polygon is generating excitement, although details have not yet been released. The article discusses the challenges of liquidity mining, including concentration of rewards and volatility. UniSwap is proposing a modification to the staking process to address these issues. The text also discusses compound reversion parameters and the elimination of final parameters in a compound contract. Competitors of Revert are mentioned, as well as the potential for analytics and automation in the Uni3 ecosystem. The author believes there is room for improvement and innovation in this area."}, {"title": "4. The Challenges of Liquidity Incentives in Token Projects", "summary": "This text discusses the challenges faced by token projects in incentivizing liquidity providers. It mentions the need to prevent users from concentrating liquidity in a way that only makes sense due to the rewards. The text suggests the possibility of tweaking the liquidity incentives model to better incentivize participation. It also discusses the risks associated with using smart contracts and front-end interfaces in cryptocurrency transactions and emphasizes the importance of choosing reputable platforms with a track record of security. The text also discusses the revenue drivers and treasury management of the Revert Protocol and the need to develop a revenue model for the protocol. It mentions the potential benefits of UniSwap v3 for professional liquidity providers and market makers, but questions whether retail traders can also get involved."}, {"title": "5. The Importance of Automation in Portfolio Management", "summary": "This text discusses the benefits of using automation in portfolio management, particularly in cryptocurrency trading. The author highlights the ability to automatically rebalance positions and take profits based on market conditions. They argue that automation allows for more efficient portfolio management, reducing the need for constant monitoring. The text also mentions challenges such as high gas costs and potential limitations of certain strategies. Overall, the author emphasizes the value of automation in optimizing portfolio performance."}, {"title": "6. How Incentives are Calculated in V3 Staking", "summary": "The text discusses a system in V3 staking that incentivizes security in a pool by adjusting rewards based on time and effort invested. Rewards are proportional to fees collected and participant engagement. The speaker expresses excitement about liquidity staking and its potential to enhance user engagement. They mention the innovations and development surrounding UniSwap v3, including the work of the Poly d team and an upcoming liquidity mining program. The text also discusses the concept of a decentralized consortium that allows users to add protocols and tokens, specifying incentives and durations. This approach aims to incentivize token usage and investment."}]}