{"podcast": {"title": "Polygon Alpha Podcast", "host": "Justin Havens", "image": ""}, "episode": {"title": "A Self-custody Wallet for Web3 Citizens | Alexander Guy | Zerion | Polygon Alpha Podcast", "number": "21", "date": "NOV 4, 2022", "description": "", "url": "https://www.youtube.com/watch?v=15xrqqAnGMY", "speakers": {"0": "Justin Havens", "1": "Alexander Guy"}, "file": "november4.mp3"}, "transcripts": [{"speaker": "0", "podcast": "Hello, everyone. Welcome to the Poly Alpha podcast. For the Poly community Gathers insights from today's leaders in decentralized finance, web three in Crypto. I'm your host Justin Evans, aka Crypto. Let's get started. On this episode of Poly alpha, we're joined by Alexander Guy from Siri. Alexander, thanks for being here with us today. How's everything going? It's going really well. Tax. I I appreciate You. Is not the first time we've had a pod conversation, and, yeah. I really really thrilled to be... Be talking to the pilot community today. Yeah. Absolutely. And I don't have too many reoccurring guests. On the show. Well, for this one specifically, because I did do the podcast for the index coup. And I think the the only three guests that I've had on for this one is you. Cain Warwick from synthetic and then Lay K from full together. All great, Amazing people. And if you can't see here, I'm wearing a Z hoodie today in honor of this shout out to Boo ave, who I caught up with in Bog for giving me this this hoodie. So yeah, Alexander, let's kinda just get started with your background and how did you end up in the Web three space and more specifically at Siri. ", "start": 0, "end": 87.372505}, {"speaker": "1", "podcast": "Yeah. Sure. I same really quickly, but, like, I had massive ball the entire time everyone was in bog out So, like, the fact that you even got some cool swag that I don't have is, like, just, like, really drive them the ass the spike in. But... Yeah. So, like, I mean, Like I said, really happy to be here and and and speaking to you all about about Siri and and and about Poly, It's really really a real pleasure to be be part of this. And my journey to to web three is kind of like... I don't know. I guess it's a little bit. It definitely wasn't something that I've been in for, like, my entire career or something like that or for for years and years. My... I guess you could call me a rough reform, we went to kind of growth marketer. I spent bulk of my career in London and Paris in various stage of start off anything from, you know, start the stamps that have been acquired and opposite of the Spectrum starts that around of money. So it's be honest about two or three years ago. Was starting to feel kinda jade a little bit like fatigue by, like, the startup grind and sort thinking that actually, I wasn't I wasn't a whole had of reorganization happening and just start feeling in general so, like, maybe I needed to change. And around that time, I heard about, like, I guess, Should say, for the bulk of my career, I've been kind of like aware of crypto ethereum. But, like, very naive. Kind of view them as, like, genres of, like, startups. Right? It's like, I yeah. You be Ai, you know, cohort over here. You have you, like, fintech cohort over here. You got your e commerce over there. And, yeah, over there somewhere there's things like the crypto out. And so, like, I was aware of that, thought of the school, I thought it was interesting. I didn't know if it was for me especially early on. And now you even kinda thought of it as just like another cool thing that people are working up. And that meant that I wasn't smart enough to get wellington things. I sure gotten involved in very early odd. On the personal side. But it it made me, like, sort of, I guess, open to ultimately what happened two, three years ago, which is, like, I was kinda looking for an entry point, I guess, into Crypto. I started me a little bit more about it, a couple of friend I'm I'm based paris so a couple of friends might work at ledger and you know, so it was was becoming something that was interesting to me And finally, the the rabbit hall moment was ", "start": 87.93078, "end": 238.17822}, {"speaker": "2", "podcast": "I started ", "start": 238.96709, "end": 239.70573}, {"speaker": "1", "podcast": "getting really into so rare. Is this like Needs fancy football for the americans. You know, basically, It was like, whoa. Okay. So I clicked in Baseball cards and basketball cards as kid. So, like, there's a collector's mindset that it ticked that box, like many males, our, not just males, but many men are age at so lot time plan fantasy, sports or involved fancy sports is like a, you know, my college friends or stuff like that. And so like started I just, like, immediately click for me. And the the concepts are like, very and, you know, things are like... All this stuff about Etsy, just like, immediately made sense. I wasn't, you know, sort of, like, I didn't really get, like, early P projects, and Nxt and like digital hearts wasn't really, like, it It's cool, and I'm not all trying to say that that that it's not interesting, but it wasn't something that like pulled me it. But but Sawyer Made a lot of sense in a lot of levels. And so started getting a a really advanced advanced. Started spending some time and money and so, I quickly needed a place to manage then what became sort of like a diverse going from Crypto portfolio. Found Z as a tool to help me manage my portfolio on check kind of the assets across different different communities and different protocols and things As I starting to dabbling. And basically, at that when I was, like, so hooked. I was, like, I gotta I gotta, like, work in this space, I mean I'm I'm in. I... Like while in every color pill you can think of to, like, get, you know, into this space. I'm I'm just obsessed. And so I started sort of arguing I think is probably the best way, like, Z team and founders on this discord. And, like, eventually, they were hiring head of marketing growth. And basically just was, like, please give me a shot. And I think if you ask, you gary see her now, like, if think that when you first stand on the initial problem me whether or not it was gonna work or, like, I think he's gonna give me give me a go. I don't think you didn't necessarily would have thought it would worked. But now it's been a year and a half, and, I guess in Crypto land that means some sort of a veteran these days. And I at least like I feel a little bit more comfortable. Talking about some of some of the key concepts and and themes here. But it's... It was sort of a why we secured at secured to read, but it it really feels like A I found founder on spot. So it took a while to get there, but generally the number, I guess. I guess we're really stuff. We're we're so early right. ", "start": 240.39897, "end": 398.57712}, {"speaker": "0", "podcast": "And Yeah. Yeah. Yeah. I think I think that's so interesting. I feel like when, you know, the whole Web three space was really starting out before It I was even called the web three space. You know, I think you had like, the technologists and people who were just, like, really interested in technology and and crypto. They were hopping on board. Fast forward through Deep defy summer, you get a lot of like, Deep defy, focused people or finance focused people, economists and and more technology focused people. And then, like the n craze came along and now you're starting to attract collectors and content creators and artists, and it's it's always interesting to see, and I keep thinking about, like, what's gonna be, like the next big thing to to drive, like the next, I guess like sub culture of people to this space. And I think it's really gonna be gaming in my mind. I don't know Do you have any thoughts on that? ", "start": 399.0556, "end": 453.30707}, {"speaker": "1", "podcast": "I I guess I referenced it, like, I definitely have a good collector's mindset. But the other sort of thing enjoy that is, like, world building, going deep into, like, I don't know. I mean a lot of like, fast seed stuff where, like, it's a whole constructed, you know, universe and and I think that people who are like that. Our gainer, usually. I'm not such a hardcore gamer. I I think as a kid, I wasn't it. But I do totally agree with you that, like, the power to construct an entire universe. I mean a good example is, I was actually I'm sure that I trying to figure out wrap my head around parallel. Do you know this like Sci f game I See into it. I was about to say. I see Deep dad tweet about it all the time. But I haven't dug into it. So I was asking I... And, like it was crazy because I said, like, I need a primer. Like, I feel like this is my thing, but I don't know where to start. And like, this community was just like bombarding me with threads and videos and guys well kind of stuff, and I was thinking, like, this is exactly... Like these kinds of use cases, what they allow is for, like, kind sm groups of people to be, like, extremely passionate about this thing, you know, creating help build the the lord, must especially if it's a dow, You know, you can, like, actually bring the community into the the the world creation itself, which a number of the cool projects are doing anything, And this, like combination of then having, like, an in game marketplace for stuff is, like... Such a driver for, like, the community to grow and get, like, real momentum. Actually, it's weird because Sur kinda has a lot of the same dynamics. Right? And people are fans of sports teams. And built into your surveys is like the competition element. It's the fandom. It's the fact that you can sell your own cars in the secondary market. It's the fact that then there's, like, this running auction at all time of players and something like that. And these kind of elements I think are real building blocks for for adoption. And also, the other thing and this is, I think a key thing that helps so but also help a lot of gaming things is I think many people are like me, which is, like, they we're sort of looking for an entry point to, like, web three quote unquote, which is kinda challenging to find that. Right? Route in. But like, oh, there's this one game that I like that I'm starting to understand and learn more about over time by using it, then, like, the rest of it opens up for you. I think that doing... Because the fact is, like a smoother smoother landing perhaps, like, into, you know, into Rate and some other other routes, ", "start": 454.42, "end": 603.6325}, {"speaker": "0", "podcast": "It's it's rude to on onboard a lot of people into the specs. I totally do. Yeah. And I think, you know, all this talk about gaming and and onboarding new users. I think this also kinda... This helps us transition to the the conversation about Siri because I do have the Siri on app on my phone. And the user interface and just the general user experience with the app is amazing. And I think that that's something a lot of people are focusing on in the bear market, which I'm I'm I'm would say that I'm a big Ui Ux Maxi right now in the bear market. And... But another really important thing about Z on as aside from how easy and smooth the interfaces is the fact that it's still maintaining the principles of the Web three community in the sense that it is a self custody wallet. So I want you to talk a little bit about that, just like the background of Siri on, why self custody as a choice for a wallet is so important. And what was that always on the road map or was there a pivot at one point? So ", "start": 605.159, "end": 670.1429}, {"speaker": "1", "podcast": "Z as a company is actually the the founders are, like, definitely, like, Og g kind of people in the web through crypto out crm. Broad community, like, all those different buzzer or things. But they've been around, like, they started doing back in two thousand... Like, two thousand sixteen or early two thousand seventeen, like, the first like, versions came out. They kinda had this vision of, like, especially at the time there on this trend towards, like, un banking yourself, you know? Like, like, get it breaking free from the banks, like becoming your own bank, I think was one of our early life sort of timelines. But what we ultimately you came like the first real version of Z that that drove a lot of adoption. And it got a lot of users was effectively a portfolio tracker. We got the team done, I think really, like best in class, one of the best portfolio checkers in the market. We have really, really strong adoption for things like the real time his, you know, transaction history, which as your portfolio gets more complex, particularly in a multi chain context, You know, having a real time history of what's going on and was really important to people. Coming along with that, were push notifications both on the web and on your phone. Which is, again, this is like, idea of, like, you know, du and the fact that we wanted to create like a a uniform experience for people to try portfolios on the web app as well as on the mobile. And we were one of the first D five projects to have an Ios app to get approved. And we've we've been about... I think the first version was was approved in, like, two thousand eighteen. So it's been quite a while for us. But I think that I guess, like... So post portfolio tracker, the the team quickly realized that... Okay. So you got your portfolio, but like, seeing it isn't enough. You wanna be able to do things with it. And so in Nineteen, we added swap functionality to the to the app. And one of the other sort of points that we wanna to address is the fact that it's kind of pain, like, hop around different indexes to make swaps and things or do... Obviously, you wanna do it in your heart. You know, that's a whole mother a globe of mini minimizing and things. But, like, basically, they wanted to make it so you could swap directly within Air and crucially to make it as cons as possible. So what we did was aggregate, many, many, many, most of the major decks, xerox x. Let's get one swap do strong. Para swap and forgetting one, but that's okay. They, like, when you do a swap on here, crossing me chain, by the way now. It will we'll scan all the available indexes and give you the cheapest trade possible every time. And so this is the core piece is trying to make, like the port like the Z app, much more like dynamic? Feature ish, etcetera. And and the the... Next thing you wanna to do was to get, with two multi chain functionality. So integrate like great. Project called socket. And now we do the same thing for bridging. So you can bridge directly than Z from chain chain, and we do the sampling thing socket based provides an ag of all bridges, gives you the cheapest rate every time. And so, like, that was, like, I guess, the next element to making this this app a little bit more like, about doing things versus just seeing things. And I guess, like then, from there, we had an Tracking functionality, Only on theory right now, multi chain, particularly Power coming soon bank things that safe to say. And so, like, basically, we're trying to like... What started to come and emerge from these actions like, independently use this vision I think of when. You know, sort of one place for, like, everything, one place to explore all. And particularly within a southeast studio, you mentioned this story before. Within the self custodial environment, we started to realize it was it was pretty natural for us to move towards know, the the the wallet and actually in be a while. It's actually in June ended May or early June this year, we we didn't really launch a lot. I think we actually be Became wallet or if all into a wallet. And so, like, what now you can do is have, like, the same really accept excellent portfolio tracking kate. You're, like, all the same portfolio tracking functionality down, but, like, do that within your while. And that combination of factors is I think a real important building block towards, like, you know, becoming... I think what's real vision this become the best wallet for for, like, the most active web three. The people using work through the most, the people who are here, people who believe in it, people who are. Figure it out in the in the bear market and and still, you know, doing things here. This is kind of who we're going for and and and I think what the mission are in it. And so, like, it's kind of like been a a long path that but I feel I feel really good. And we feel really good about, like, the the wallet as, like, they imported place. You know? Today, you know, at the end of the day, like, the wall is like, so core to your experience in web three. Right? I think, exploring web three always involves interacting with your wallet. But current the current like, kind of options out there. I think a lot of times almost feel like a a storage facility, you know? Like, where you just throw don't bunch just soft and, like, you got boxes and, you know, holds stuff over here and some stuff you forgot about over there. And, you know, you have to, like, get the key and open it up and it's like, yeah, where is anything and stuff like that. I wanna make a much more dynamic experience and I for for people to to use for their well. Like we wanna make a lot that actually feels like we should feel, I guess. Is is I think the real vision. Yeah. That makes sense. And to comment on what you said about people just finding assets that they may have forgotten about that are in different apps and ", "start": 670.7745, "end": 1017.3099}, {"speaker": "0", "podcast": "we're just on different blockchain chains. Yeah. I mean, when I when I first downloaded Siri on onto my phone, and I, you know, I connected everything And and I think this concept like might sound crazy to people who aren't like native web three, but like in like in the depths of the bull run and d defy summer, you were trying out everything, and I definitely found like like a material amount of money that I had just like, forgotten about that were left on other chains. And the fact that miss Just kinda like floats all this to the top and this awesome user interfaces is really funny. And I think this also speaks to the type of defy gen ", "start": 1017.76886, "end": 1055.7301}, {"speaker": "1", "podcast": "that I really am. But this to our team also our team Like, honestly like, they and they they very much valued this kind of idea. Was, like, you should be able to just see and track all your stuff in one place. It it seems sort of like, you know, counter immediately and then I maybe seems so obvious that somebody who's, like, just coming to this this face now is, like, yeah, Of course, you do, but it's not actually been in the case. A lot of things are manual. A lot of things are spread out and I because of, like, as we becomes more complex. This problem is only gonna compound. You know? Like, this this like, you have multiple wallets doing different things oftentimes, You've got a high roll or some stuff. You got a high wallets for you got out of stuff. It, you know, the the like, the the opportunity for things to get lost or confused is like, pretty high, actually. ", "start": 1056.1101, "end": 1111.9551}, {"speaker": "0", "podcast": "And so that's right that's kinda what we're trying to solve, I think. Yeah. And you also mentioned, you know, you're building that you wanna build a wallet that's for web three citizens and you kinda went into who those citizens are basically, the people who are still here, the builders and the people who are still here working in the bear market in the Web three space right now... But I also feel like that's that's also a place where Meta mask positions itself. It's kind of like... I mean, Meta mask is like the og wallet, I think. From from a D defy standpoint or just like or just like an ethereum standpoint in general. But on that note, there is a lot of competition out there when it comes to web three wallets. And, you know, you've heard of, like, the curve wars and There's like, the Q Wars On Poly gon. There's the flu dow wars. Are there like wallet wars as well? Is that a thing? And like like, how do you really differentiate yourself from the competition there? ", "start": 1112.915, "end": 1169.2888}, {"speaker": "1", "podcast": "It's a super juicy question. I'm actually gonna I that phrase said that to on a podcast heck a pack. So is a juicy question. I'll link it too. That's a good one. There the short answer is, like, there's absolutely a a word going on. But to be honest with you, I think it's more like the empire you know, versus the the rebels here at the stage. In that there's a lot of really interesting small bands of people trying to attack the to of hedge default in this case. Mask does a lot of things really out. And I do not want to suggest that they... I don't know if that that that people shouldn't use that math. What I think we wanna say is and the the way we try to differentiate is, Meta mms is vulnerable in a number of different areas and we can kinda group them into, like, probably the Ux ui, which is a a mini topic in that itself. It's not just like, how it looks. It's not designed when people care that. They're like, oh, you just wanna build to better looking... Well, that's not really what you mean, so we can talk about that and unpack a bit. But the other bit is that especially for people in this space a lot. Mass is when we offer you anything by the way of insights, alpha, you know, social cues. Like, there's not a whole lot of ways for you to, like, get stuff from know what I mean? Like, get insights or get any any... Oh, hey, Maybe you wanna do this sort of thing. Maybe that's an idea you. Wanna try out. Maybe that's a protocol. And you wanna floor maybe that's an Nlp collection, you might wanna collect. You know, it doesn't give you anything by way of like. Cues about where they go. It's kinda... That's why I say it's kinda more like a storage facility. Like, it's a place where stuff is, not where you like think, oh, hey, maybe that's somewhere I wanna head. And so, like, on the on that particular use case, we actually have already had this kind of idea for while, which is basically like, you can watch anyone's wallet in the z already. So, like, you have your own portfolio, which gonna be made up of multiple multiple wallets nested, you know, kind on top of each other. Toward Next to each other. I guess. And you can also wash people's wallets. So not only can you see, like, what? I don't know. Semi wallet with... His public wallet is like, no on wallet, or semi dot me or semi out lens, whatever he's using these say. You can you can see, like what he owns, what he holds, you get notifications like he does certain things. And, you know, this is a pretty trivial example because he's so known and and like, trusted. But there's a lot of, like, whales out there who legitimately make interesting, you know, do interesting things. And in theory, you can actually get notified, you know, that so so long you're watching has done a a certain action. And then directly in our app, you can go and talk on that information. Directly within there a while. You can collect on that information. And this is like the most basic basic basic of of social cues and social use cases. Like, we talk a lot about... You Again I talked a lot about sort. You're, like, your own trusted, like, investment community. You I, like, these people who you trust who who are doing interesting things, you might not be their opinions. And They're like, go act that behavior. That's already. I think, like a real improvement on experience So you have Ben us, which is very, like static. It's just not that it. From the Ux side, Ux and your side. Design and usability portability, the fact that on your phone, you're gonna have the same experience in the same app that you do your desktop or in your extension. Like, this is already a place where Meta mask isn't very good. Right? I... There's functionality that isn't consistent across each of these things. And our vision is to make a unified experience across any device that gives people over, you know, real command of their portfolios. The other thing that on the Ux side, beyond the design and functionality is trust and security. Think that it's pretty obvious that you made a mask less people down when these is a lot of ways. How many times a year stories about people sending stuff to the wrong chain because they weren't on the right network or the... Wallet it was connected to this thing. And, you know, that's a really basic thing, but it's it's it's pretty honest There's lot of be ways for us to make, you know, the wallet a little bit more like secure a little bit more trust. Another, you know, I guess, moments that's important for us to work towards is, like, securing the transaction itself. We're thinking about... It's not there yet, but we're thinking about a lot of ways in a road roadmap to, like, make this transaction, like, to be able to trust that transaction. Particularly in the mobile context I'm gonna sign something. Hey, this is a smart contract you've interacted with before. So like, yep, should be all set for you to sign this transaction very quickly. Like, this isn't a fake thing. You're not getting scammed. Or, hey, this is a, you know, this is a smart contract. You don't have to worry about this it's on it's verified, like, you can go and do this trade. You things like this that that I think especially on mobile are really lacking right now. And it's one of reason why I think most people don't do as transactions on their but device at all, because it's like, it feels less secure. And feels risk. It feels scarier. And so we're trying to, like I think across those key areas differentiates. Key aspects of our everyone roadmap coming up. I think there's lot of basic usability things, not just with Mini mms with all wallets, There's some problems, multi chain clear. Clear the issue, it's such a pain that switch back and forth between networks. You know, every time you wanna do anything, you system adapt that have to go, oh, you're running right now where you search optimism to ethereum. You know, this soon as stuff is just like, it's like really no brainer things that I honestly early ten x improvement from a usability perspective. And the key thing, this is to get back to what three citizens, the people who feel these pains, aren't new. If you're new, you're like, oh, this is a lot on supposed to download. This is how it's supposed to be. Okay. I've got mini mms you're fine. Now the people who are here who are active or training. They feel these pain is like, gosh. Again, I gotta do this thing or. Now like, this feels like, a funny, a funky smart tie I don't wanna sign this shared transaction action. What am I doing here? They're the ones that have heard the stories about packs, the ones that been, you know, love themselves like there's all of these things that people who have only been here and are active, will understand our products. I think that's that's kind of what we're going for. We wanna been in a better while in. ", "start": 1171.1184, "end": 1560.256}, {"speaker": "0", "podcast": "Yeah. That makes sense. And I also wanna bring up a news article that I've seen recently. I think this was released about eight days ago. And it's it's from Fortune. And it says Z wants to beef up it's wallet with a twelve point three million dollar fund raise and take on Meta mask. What can you tell us about this twelve point three million dollar funding round for Z. ", "start": 1560.7081, "end": 1586.6482}, {"speaker": "1", "podcast": "Realistically, what we you wanna do requires best sent on the people front. It also requires road roadmap to, like, build out some of these features to execute on that map. And so we were fortunate not to be partnering with some some really excellent investors in space. But I think the critical partner that we found here was was actually it, who is becoming more active in their venture arm and becoming more to, you know, engaged in this sense. And they really they really got into our vision for what while it should be. And so when we found me as a key partner and sort of... You know, completed the round with some existing investors that went down as well as some some new entrants including like, Coinbase based ventures and, like, who's their light speed. You know, we... Need some major lesser kinda back the the project. And the combination of, like, them matching our vision and what we wanted to build, plus, like, the fact that we would be able to extend a road roadmap and kinda, like, how the time you go out and build it. This is really like the the sort of sealing factor for us and the the the the the main thing that I think pushes us over the edge. I guess, how can ventures also participate participated. You also like some not just like Vcs, but like, real active, like web three kind of copies of web three, you know, read three personas we're were participate. It was a really exciting group of people that we're able set to bring together for the round. And and so, like, you know, we're happy to be able to to announce. Yeah. I think I think Winner meets a great partner. ", "start": 1587.9244, "end": 1681.1053}, {"speaker": "0", "podcast": "They're they're a great market maker in the space. They're a great voice in the space. They did have that little exploit that happened and a while back. You know, that that stuff happens. I mean, that just shows more than anything that they're web three native. No. I actually knew ", "start": 1681.6624, "end": 1695.6469}, {"speaker": "1", "podcast": "if anything, I mean, you the rims is already close by it, but we're actually really impressed with the way that they handled the like, all of the communication about it. I think that you know, some of these exploits that you seen recently with, like, no communication or, like, the team is working on it. We'll get back to you, you know, this kind of stuff. Surely, like, isn't very Shit's fair. Isn't very open. And, like, the team, like, from from their Ceo of Guinea. All the way I'm out there and their their team they're like, open the communicate, they they communicated with the hacker directly and, you know, attempted to re regain the funds in exchange for, like, basically, like a white hat know, turning to white activity me. But they were very, very, very proactive from the being about communicating what was affected and what was in? Like, I actually think it was a really impressive way to to sort of handle everything really challenging situation. So, you know, for if anything, I think that sort of made us feel like, you know, Okay. They they know what they're doing, you know, a lot of a lot of protocols a lot a lot of you there's a lot of it threats out there. And so, like, when... The way you respond to crisis I think they wanna value and you really impressed with the way that the what you need to handle that. So ", "start": 1696.4375, "end": 1768.8928}, {"speaker": "0", "podcast": "Yeah. I actually, I I was too I was too personally. And just kinda looking down the road map for Siri on. So you know, I I have a ledger that I use for, you know, because I'm you know, I bought my ledger in, like twenty seventeen, and I I still have the same one. I've got some upgrades, but it's just you know. And then I also use just like a web browser interface pretty frequently as well. Is that on the map anywhere? Like, do you have a browser interface where you can execute transactions through an Rpc network? And it is there are there any plans to integrate ledger or other hardware wallets in the future or have you done that already? ", "start": 1769.3622, "end": 1807.0802}, {"speaker": "1", "podcast": "So ledger is already integrated area. You can actually connect to via a Bluetooth. On your phone, which is pretty neat. There's a video that we made, like, honestly, I think, like, every three years ago. I have product Android just like, showing this happening you. But so ledger ledger has actually been a a key partner for us for a while. We we experienced we one of the first wallets and pro point of trackers in there and Ledger rider. We were really close relationship with the team and they worked close to February, if you can actually connect your ledger wallet at to X just like the portfolio tracker so you can, like, view, you know, your ledger the signing area other wallets to your portfolio. Right now, and that's through the web app. To answer your earlier question on the sort of browser side, We kind think the I'm I'm a give away some help here. Like, we have work on an extension. It's pretty imminent. And the reason is that it. I think that to to to true vehicle the, you know, sort of best best one for citizens you have to be able to like the everywhere said that they were using the service. So we we turned to your mobile first with our with our all launch because the fact that mobile wallets are are a little, like, insufficient buyer our estimation. Also, it's where our team is quite strong. So we really like, you know, kind of double down in that area. But but we always knew that we wanted to build an extension and it's it's it's coming. I can't say when or, you know, exactly what. But it's definitely intimate. Like isn't in I've seen it. I've seen know, people demo it. I've seen more than just designs, like, it's definitely a major project for us and we're we're gonna be excited to fully launch it. So there's some good alpha for the ", "start": 1808.0537, "end": 1911.6149}, {"speaker": "0", "podcast": "I get to you the out there. Yeah. That makes sense. I mean, I I think if you're gonna be the wallet for, you know, the web three native. Yeah. You definitely need to have hardware wallet integration and then probably a browser extension as well. So y'all are talking the talk. Another question I had, you know, when I'm using the app, right, I have the ability to execute a swap on that application. Where is that swap routing to? Is it just is it using like zero x to, like, find the most efficient route? Or is it going to uni swap V three specific like, how do you determine that? We basically... ", "start": 1912.0548, "end": 1947.5372}, {"speaker": "1", "podcast": "I... In terms of the technical elements, I'm not necessarily the best person answering to talk through. But basically, there's a little animation that does it. But you go to try to execute a trade and like, like, before you done the trade itself. We're... We've already conducted a scan of xerox x out Para, one inch. I mean, it depends on which chain on which chain support pitch. Which tokens and things like that. Obviously, if you, you know, go to happen as you may limited in terms of which which decks you can use. But basically, you will scan any of them will decks, and just like a need... Like present you. And if you don't complete a transaction, like if you just leave it there on the swap screen, it will actually, like, change it after a while, if it's senses that a... You know, there's a cheaper there's a cheaper trade out there that be had. So, like, it's pretty well. Actually, like give you like, I don't know. Get up and leave the room per second. You can, like, actually get a different quote than when you, like, left the room if you didn't complete the trade to immediately. And so, yeah. You work with I'm I'm forgetting one I know I am So sorry to the team, But it's like xerox x, one ish pass swap, uni swap, Su swap. Cash flow... Cash flow is the one I getting, which is a real shame because we went him. And team there. And so... Yeah, You know, we we basically... Our our whole thing is... And this is actually speaking to getting back to lake Qui pieces and it's, like, you know, builders, creators, creators in the space, like, they know how fine good. You know, good good quotes. Like, they they know this stuff. But especially as, like, the the pool of, like, Web three enthusiasts, slippery fans, referee users, maybe it's just a better way to think about it as they come in, do weird alternative roots in the space like me and and so, it's like, I don't know there's like, like, how to go and find the cheapest. You know, I'm just like, like, somebody told me Uni swap is the best one. And so I went to Uni swap. You know. And so, like, actually, it's a feature for us. I think is a lot about, like, increasing but, like, ability for, like... And then maybe I definitely got new people. But basically increasingly it really made easier for everybody to get through inside good deals, good. It make the best options for that. So Certain when you built, I think that's kinda one of the reasons why you had an advisors. It's like, you know, the most the most experience, the pros. Like, they know how to do this stuff. But, like, you know, people who are even want new or even consume themselves to experience, like, maybe they don't know all that stuff. So it's it's having a lot about increasing the the the floor for everybody. In terms of like education. So... ", "start": 1948.3877, "end": 2098.8225}, {"speaker": "0", "podcast": "Yeah. So it sounds like an ag of decks ag is what it sounds like. I hear. ", "start": 2100.09, "end": 2106.4587}, {"speaker": "1", "podcast": "It's very sexy and terror. When we like, ag aggregating lot. Especially you include the bridge in next you, So it's like Okay. So ag log the plus bridge ag, ", "start": 2107.2556, "end": 2116.2617}, {"speaker": "0", "podcast": "which is really, really insects. Yeah. Well, another thing Thought that would also be interesting that that I haven't seen a lot of wallets implement would be like a borrowing and lending function within there as well. Is that anywhere on y'all road map or just maybe just in general what else is On map as it comes to, like defy integration specifically. ", "start": 2116.738, "end": 2135.0662}, {"speaker": "1", "podcast": "On the Side, we Like right now, our big focus. This is in defy. Right. But our big focus is the the the multi chain N functionality. It's a big thing for us. We really think if we wanted to deliver on this vision of, like, every asset, every chain, every device, which is something we we can like, mission statement or a calling card, unifying call or something like that. We we need to be able to, like, deliver on the multi chain and a t piece. We also are really, really, really trying to increase our level of sophistication related to multi chain like transaction history. No one really actually does this quite well at the moment, like, in one place. Like, a lot of people do with The transaction history level, but you really wanna be one of the first, like, really hit and nail all, like, any shame transaction history, which is pretty exciting. The other thing that we're also is pretty imminent in terms of releases This is also a little bit of alpha is like, we are integrating in mobile Adapt browser. So, like, the ability to, like, go to different apps directly within your wallet and and do different things, Like, you can imagine go ahead and lux extra floor sweeping a bit and like then having it be directly in your wallet. One of the really cool things this is again like pretty big alpha output but This is Web three. We don't have traditional electronically police from city anymore. One of the cool things you we can do is if you have multiple wallets, like, multiple lots of in zoom. You can, like, switch back and forth and, like a click or two between those lots. Like you're in looks spanner, And you can just, like, click or re or, you know, a couple of the naps I'm thinking you can actually happen Test app. You guys just like, clicking in between your wallets, like, from there from the That browser and you just then switch to the right wallet. So if you like an F t's, you know, y or, like dji one you can just, like, do that at the bath itself in in the that browser. Just pretty pretty neat stuff. I think it's a really excellent addition to the to the family of features in. I'm trying to think of some other stuff on the on the whole map that's it's exciting. We've that basically, like, the way we are trying to think about it. It's like, we wanna make... So we wanna make this experience really fantastic for for people who are like, really active here. We've targeted, like, the transaction, as I said as a key moment. All assets trying to be a a key moment. But in terms of borrowing and lending, I don't think it's something that we're exploring. You can stake directly zoom. That's been true for a while. So, like, you know, A customer number different. Like, it'll tell you the staking opportunities that you might have you can, you know, track your staking rewards and stuff like that. But I think that arctic focus is on a lot of these is sort of router went through use cases at the moment versus gonna deep down some quite round holes for the most part. Now, I wanna say actively adding protocol is in terms of tracking and training all the time. We also are on ten chains currently, including Ethereum. And so those include some of the main ones that you can think of, but we also are are actively trying to find, you know, the new change to to support. I saw, you know, obviously, Z k, like maybe that's... I don't know I don't know for sure if that's on a road map, It should be. So we already are on poly Mp, and, you know, you definitely wanna move towards I think yeah. Be more initiated in the call because of some more ground. So like that... That's an brainer. I think probably in in the long run. You know, for us, I think it's really important that the people who are like, we go we go where these active systems are. So, like, for example, if I don't know, like, all you guys are attracted to do. One of the reasons why I think we'll prioritize it in terms of multi chain F. Is because Well, Poly has a super us, active engaged at a t community. And so, like, if lots of things are happening on, you know Pal from... Perspective, we clearly wanna make sure you accommodate that news case. Similarly, you know, no is really exciting to us. Has change really sent to us because Pop, Yep. Use crops. They're they're fantastic part it. You can assuming right to actually drops. So importantly you check for two zero while people like, connect somewhere. I like oh my god. I like, fifty pops. And I gotta didn't even know I have on these problems You know, and stuff like that. It's like, it's another one of these examples where they're, like, we're just trying to make, like, the the the behaviors and use stages that people in the community, you know, happen those, the the you, that we come in at you six. Also really quickly. I just wanna add. I I had a brain fart a second ago. Life is not participating our around. They didn't participate. I was seen a Poly morph. Just a quick caveat to to add there. Just wanna make sure I'm accurate it. I was thinking about a second ago. That's okay. ", "start": 2136.2551, "end": 2424.311}, {"speaker": "0", "podcast": "Thanks for that clarification. Yeah. And on your comment... In regards to the Z E, Yeah. I we knew that we were going to get like a lot of positive feedback on the Z ak and there's gonna be a lot of excitement around it. But I think We didn't anticipate how much excitement there was gonna be around the Z k Eb. It's overwhelming, actually, and so that's something that we're really excited about. And, yeah, I think that while like Z is just gonna help. You know, I... You're you're building it for web three citizens, but you're also, like, just I don't know. Just like the innovations I'm seeing on the Ui ux side from wallets like Siri. I don't think there's a lot of people doing quite like Siri, I did interview last week wallet called Gi up or no. It's called Gi. And I just keep saying Gi up because I'm from Texas. I don't know. So, yeah. And it's just like, I I think that there's a lot of very unique Ui ux problems that need to be solved and the ones who are at the forefront of really trying to make those changes from a technological standpoint and just like a usability standpoint are the wallets. Like the wallets are the front of what makes web three functional to, like Grandma in grandpa's pause. And that's kind of the thing like, when I talk to people about Web three and Sometimes I just say, look, like, we're not building this for grandma to submit a transaction on, you know, the on meta mask But then I I talked to some of the wallet providers and there... And they say, actually, yeah, we are building... We're trying to build this for grandma. Like, that's their goal, and that's just kind of the mindset. It's it's two different mindset within the space they're converging together to make just a very, very robust ecosystem for for everyone. ", "start": 2425.2842, "end": 2534.605}, {"speaker": "1", "podcast": "Yeah. I I actually think that I... You know, I don't wanna say that we're like, not building for the grandma, you know? I just hope that, like, one day, the grandma get sophisticated in that. They're like, three hands the no brainer. I think that's probably like, you know, the way that I wanna think about. What I mean is to say, like, the people who are active here. I I kinda mentioned earlier, But, the people who are most active here are the ones that have the most of them game, high e the most risk. And are the ones that have experienced, maybe, like, literally having, you know, something go wrong or being lost or missing opportunity, they're the ones that feel the fo, the the harness, You know, they're the ones that are looking for the most insights and actions and stuff like that And so like I think that's have our focus is if we wanna go to the better wallet for people who are, like, committed here now, you know? And like, ultimately, I think I believe, fundamentally that like, the... The group of, like, Web three systems will continue to grow. You know, over the time. And and more and more people will become more educated, but, like, we we've said I said this quite a lot, and I'm like, I'm not dismissing it. Like, I don't need to... Like, if somebody doesn't know, like, what gas is. Like, I don't think zoom that it's necessarily for them. Like, like, we're trying to provide like a a a more premium experience. I think it's a big premiums bad word but it. We're turn private to a service for people that, like really like, kinda got at a more higher level of understanding about what's going on in space? And are you looking to, like, ", "start": 2535.3977, "end": 2619.9167}, {"speaker": "0", "podcast": "you know, ramping up a bit, I think it's probably a good way to put. Yeah. No Absolutely. I I totally agree with you. And, you know, with all of this focus, and with this raise and in hiring new people, I think the next question I need to ask is, you know, how how does Siri make its money because it's it's a free app to use and it's incredible, but there's gotta be a revenue driver somewhere. Right? ", "start": 2620.6504, "end": 2644.7117}, {"speaker": "1", "podcast": "Yes. So first new charge, we've taken positive slippage for for a long time and as like a revenue source and it's something that is increasingly like, it's it's a pretty pretty small map math as you can imagine. It's not enough on its own. So two things we've done recently. We have instituted fees on swaps. Much lower than the competition, but there is a marginal swap swap feed out on top of the gas and then the Next seat. But There's two things. Two caveats there. The first is if you are a z genesis and Empty holder, which I don't know what the floor is now, but you can go and buy them on open and see if you don't already have them. You can actually get not fee waived entirely. We basically then collect some some royalty fees from and about step on agenda the sales. But, like, you can get them to qualify for, like, a few waiver base today. And the other thing is this money isn't going towards, like, Operating expenses, I guess or even our like, you know, some profit and stuff. It's actually going into a multi swing and it's kind of like a first step towards, like, a decent. Like, you know, we've sort, like, actually communicated this way. It's like, the fees are being collected is kind of like at opening sal into, like, this path towards decent descent decent centralization. And so, like, the fees are are are Pdp piece of our business model, but I I do think there's a there's a two pretty big caveats there. So if you're interested and you wanna get paid, you know, feel less wanna go trading other than the next fee and the gas. You can just go bio genesis x genesis t. They're still pretty pretty affordable on open see in the secondary market. The other thing and the third element that we were really strong lot is Z has a pretty robust Api, and it's used by a number of different big projects. And we basically are are starting to, I think churn towards making that something that we can monetize. And we're we're we're interested in trying to explore the Api as a as a root to to stabilizing our our revenue recognition and like, solidifying her business business. So those those three things are kind of how I guess he ", "start": 2645.6064, "end": 2785.4822}, {"speaker": "0", "podcast": "Yeah. And the wallet dis centralization, what you... You're saying it's not alpha but it's news to me, I think that's really really interesting. And I also was not aware of the n teeth that saves you some money on the transaction transactions Yeah. I could tweet out. It's ", "start": 2787.7048, "end": 2804.3137}, {"speaker": "1", "podcast": "it'll give you, like, a cool little... But you get a cool star in your Z web app. Actually, you're in your mobile model too. It's like a cool star. It's like, hey, this is a, you know, you could trade fee us he was draining or zero zero fee trading with this which is an. That's that's reason the way the way you communicate it kind of dump a aisle like you want hide from like the ease like, you know, we're a business we're trying to to make something that lasts we need to solidify our our our our destruction on the underneath us. It's But what we also wanted to communicate and very true in core to what we ultimately I think our working towards just like, we also think that, you know, the element of decent centralization, a piece of decent centralization is is kinda key to to level everyone try to build. So it's how we communicated it when we introduced the first we did on multi chain fees. And then pretty recently, we we updated included their in swaps as well. So so it was initially just multi share outs. It's out the as well. But these days. We... We the initially it was like gas is so what right down the theory. I'm like we don't have like, price people laugh. But now, he says, glasses drives around at ethereum and it it it didn't make make much shift but I like if you wanna do him on another chain. ", "start": 2804.7861, "end": 2885.3083}, {"speaker": "0", "podcast": "Yeah. That that makes sense. And we are running up on time a little bit, but I also wanted to mention that I do have a x on N, and it's the Z Dna. So wondering wondering if you could talk about that, a little bit, and then we can just... We can probably do some closing comments and and head out. ", "start": 2886.106, "end": 2903.7935}, {"speaker": "1", "podcast": "So a key piece in this like, dynamic wallet equation for us, and I don't think we're the only ones thinking about this. That is identity. And we really believe and this is, like, I think, a a a key jump from from some other wallets out there. Was like, we just say I the actions the behavior should do with your wallet, the assets you hold, the collections you're a part of, the Ftc you you you trade. All this stuff have these on chain behaviors kinda combine the form like, your your your on chain identity for lack competitor. And what we wanted to try to do was the end X wallet users, the ability to kind of visually represent they're on jane kind of per persona. And this is like kind of the this core of an idea was where zero D four. And so Right now, if you go and download the Serial app on Android or Ios, you basically get prompted, within that a t tab to claim your Dna. And it's a free. So where the gas cost is, you know, might midas and gas It's a free there's no charge for it. Basically what this N nxt is gonna do it's a generative entity. Also sometimes called living. And so every time you make a transaction, the the networks and and chains you use, the the amount of money in your wallet, the the fees you pay in terms of gas fees, all these... These... There's six attributes, and they basically all contribute to a different way that the the Dna will look. And so Over time, your dna a will change and become more advanced, more more rare based on the things you do within your wallet. And in six attributes reason we have now, I should say are are pretty much just we we want, like, I think to probably add other attributes. So maybe for more advanced options, we we... I think it lot always really large the Dna like new concept or looking for ways to kind and double down the idea. That basically for us that we just think that users deserve a way to, like, visually represent, like, the kinds of things that are doing. And so you know, for example, if a user is very active on Poly and and, you know, uses the Poly ecosystem call a, Their their Dna is gonna be very purple. Actually you mentioned like our Lunar earlier and B Dna is like, very, very, very purple. Because he's super active in the Power. And like, yeah. The the idea here is that, like, what we want is to to have people... Give people the ability to express themselves expressing on chain identities individual format. You know, I guess, the only other way to do that would be, like, gonna ether hand or, you know, didn't know there while Guys and tracking in X or something like that. But but you wanted to make it a little bit more social and a little bit more adopt. Sterling. Can you get who do you are companies you were interested? So it's a it's a new project. I mean, it came out when we launched a while in June. Us it's still not even been six months or barely six months or getting close to the other should it. But it's it's been an interesting experiment for us. I think it's something we're continue to try to try to innovate around. Because the core, the idea is so it is so cool. ", "start": 2904.6685, "end": 3103.8652}, {"speaker": "0", "podcast": "Yeah. I I do love it. Yeah. It's it's so cool to have, like a dynamic N avatar within my wallet that changes the more transact that I complete on a specific network and as you can imagine, there is a lot of purple on my avatar. Because I work at Poly. Yeah. I could get I could get docs like this. Right? This could get me in trouble if I wasn't if I wasn't on Poly gun all the time. Well, yeah Alexander, this has been great. I really appreciate you coming on again. It's always great to catch up with you and your team whenever we're at conferences. ", "start": 3104.8389, "end": 3137.6658}, {"speaker": "1", "podcast": "I got... Yeah. I be real life man. But I missed out of kinda missed out on seoul as well. I wasn't there. ", "start": 3138.7966, "end": 3145.093}, {"speaker": "0", "podcast": "Yeah. Soul is fun too. That was a good one. But... Yeah, as we're closing out, we'll just, you know, where could people go to find out more about you, Alexander and Siri. ", "start": 3146.701, "end": 3156.653}, {"speaker": "1", "podcast": "So you can find me on Twitter, my handle is down here, but it's for, you know, listening, it's Alexander, w guy nineteen. Apologize for the for the length. I was making it ten years ago, just just seemed like the right way to do it. Maybe it's do for a refresh. That's where you can find me for now. You can find out word about zoom at zoom dot io o or on our website or you can follow us on at z ", "start": 3157.4468, "end": 3180.9133}, {"speaker": "0", "podcast": "underscore, I o. Amazing. Amazing. Go check out the wallet everybody. And For those of you, Listening. Thank you for listening For those of you watching on Poly Tv on Youtube. Thank you for doing that as well. Please subscribe. Check out Siri on, follow Alex on Twitter, and we'll catch you all next time. Thanks one. ", "start": 3181.7698, "end": 3202.7395}, {"speaker": "1", "podcast": "Thank you. ", "start": 3203.5396, "end": 3203.8596}], "summaries": [{"title": "1. Exploring the World of Decentralized Finance and Web 3 with Alexander Guy from Siri", "summary": "This text provides a summary of various topics discussed in the Poly Alpha podcast. It includes an interview with Alexander Guy from Siri about his background and entry into the Web 3 space. The author also shares their personal journey of becoming interested in cryptocurrency and Web 3. Another topic discussed is the impact of climate change on global food security and the need for urgent action. The text also includes a personal account of the author's involvement in the So Rare fantasy sports platform and their reflections on the evolution of the Web 3 space. Lastly, the author discusses the potential of gaming in driving interest and adoption of web 3.0 technologies."}, {"title": "2. The Impact of Climate Change on Global Food Security", "summary": "This text discusses the significance of self-custody wallets, focusing on the Siri on app. The author explores the background of Siri on and why self-custody is important. They discuss the limitations of MetaMask and propose improvements. Z, a company featured in a recent Fortune article, has secured a $12.3 million funding round to challenge MetaMask. The text emphasizes the importance of finding the right partners and securing funding for a project. They are excited to announce their partnership with Winner."}, {"title": "3. The Journey into the World of So Rare: Exploring the Potential Impact of Gaming in Web 3", "summary": "The speaker discusses their personal use of Siri and their interest in a web browser interface for executing transactions through an Rpc network. They inquire about plans to integrate hardware wallets like Ledger into Siri. The text also discusses the integration of Ledger Wallet with a portfolio tracker, accessible through a web app and soon-to-be-launched browser extension. The importance of hardware wallet integration and browser extensions for web 3 applications is highlighted. The text also mentions the routing of swaps within the application and the importance of finding the most efficient route. A trading platform feature that scans decentralized exchanges to find the best trade options is discussed, aiming to increase accessibility and education for users."}, {"title": "4. The Evolution of Web 3 and the Power of Gaming Communities", "summary": "This text emphasizes the importance of bridges in infrastructure planning, as they provide connectivity and facilitate transportation. It discusses the integration of borrowing and lending functions into wallets, as well as the need for multi-chain functionality and transaction history. The text also highlights the excitement surrounding the Z k Eb and the importance of user interface and user experience in web three wallets. It suggests focusing on active users with a high level of understanding and experience in the space, rather than trying to cater to a broader audience."}, {"title": "5. The Importance of Self-Custody Wallets and the Evolution of Z in the Web 3 Community", "summary": "The text discusses the advantages of having a dynamic avatar in a digital wallet that changes based on the user's transactions. It also explores the financial model behind the popular voice assistant app Siri and discusses three strategies the company is implementing to generate revenue stability. The text then discusses the concept of wallet decentralization and potential cost savings associated with it. It also mentions the significance of decentralization in a business's long-term success and introduces the concept of on-chain identity in dynamic wallets. The text mentions a new project called N nxt that aims to visually represent a user's on-chain persona."}, {"title": "6. Discovering Forgotten Funds on Different Blockchain Chains and the Importance of Centralized Tracking", "summary": "The author regrets not experiencing Seoul and encourages readers to learn more about Alexander and Siri. They provide information on how to find Alexander on Twitter and mention the website and Twitter handle for Zoom. The author expresses gratitude to the audience and encourages them to check out a wallet, subscribe to their YouTube channel, and follow them on Twitter. They promise to return with more content in the future. Regular physical activity can improve mental well-being by reducing anxiety and depression symptoms, boosting self-esteem, and promoting better sleep."}]}