{"podcast": {"title": "Polygon Alpha Podcast", "host": "Justin Havens", "image": ""}, "episode": {"title": "Win By Saving & DeFi Composability | PoolTogether | Leighton Cusack | Polygon Alpha Podcast", "number": "19", "date": "OCT 7, 2022", "description": "", "url": "https://www.youtube.com/watch?v=15xrqqAnGMY", "speakers": {"0": "Justin Havens", "1": "Leighton Cusack"}, "file": "october7.mp3"}, "transcripts": [{"speaker": "0", "podcast": "Hello, everyone. Welcome to the Poly Alpha podcast for the Poly community gathers insights from today's leaders in Decentralized finance web three in Crypto. I'm your host Justin Havens, A aka Crypto. Let's get started. ", "start": 0, "end": 12.22356}, {"speaker": "2", "podcast": "On today's episode Poly on Alpha, we are joined by Leigh K, who is the founder of the Pool together protocol. Leigh, thanks for being here with us today. How's everything going? Going well. Yeah. Thank you for having me. And I should I should say, I'm c founder. C founder Pulled together, Inc the the the company. So I can't take all the credit. ", "start": 17.646544, "end": 34.447697}, {"speaker": "1", "podcast": "You're you're so modest. No. I just wanna clarify. That's that's important clarification. Can't leave anybody out. Yeah That's the ethos of web three, I guess, sometimes. So Like, what is your background and how did you get into crypto and the D device space? ", "start": 35.41937, "end": 54.067863}, {"speaker": "2", "podcast": "Yeah. So my background is sort of generally in software entrepreneurship. I I graduated undergrad in twenty ten and started a Fintech company, not blockchain related. That was around building software to help facilitate donations. So that was... Yeah. That that was what we did. Ran that for, like, seven years and the whole premise of that company was like, hey, how can we use technology to help people become or more generous. And by making it easier to give... Help people give more money away? So that I did until, like, twenty seventeen left that company in early twenty eighteen. And that's when I got really interested in in crypto and blockchain. And that at that time, early twenty eighteen was when D five was just barely starting. I don't even think the term D Had quite been invented yet. I don't think that wasn't until like I a year later, twenty nineteen. But I was really interested in crypto and D defy, And I was also interested in sort of how can different financial tools, help people become more financially healthy. How can you actually help people create wealth and achieve economic mobility by building healthy financial tools? And so in the course of my research on that question, I came across this idea that's been around for a little while called like price savings, it's also sometimes called no loss lotte. And while, I was researching that, I realized that this is a tool, this price savings product is a tool that's proven to help people save more money than they save normally, open savings accounts for the first time, stops spending money money on lotte and and start saving money. And so it's a tool that's proven to really help people achieve financial health. And I also was really interested in Crypto. And so I thought hey, this is a really cool tool. And also this is work way better on the blockchain, and so that's how ", "start": 54.785408, "end": 165.65875}, {"speaker": "1", "podcast": "how pull together the company started. Yeah. That's really that's that's really interesting. How you just kinda transitioned from the donation side to I guess, like the price saving side. But I I think there's a little bit of a correlation there too. Right? I think like on the donation side, and I think you'll are doing something like somewhat related to donations or has the ability to allow for donations, but we can talk about about. Yeah. We can talk about it later. Yeah. You can talk about that a little bit later. But something you did touch on was you're the c cofounder of Pull together ink. And so I think it would also be helpful just for audience like, maybe like make a differentiation or just kind of explain that structure a little bit. Because you have to pull together protocol and the the corporation as well. ", "start": 166.19746, "end": 209.60905}, {"speaker": "2", "podcast": "Right. Yeah. So that's a great question. And this is relevant to a lot of D defy. So sort of the standard model and open source software generally and Defy is obviously a type of open source software. Is that a company will be created. The company will design and develop this Open source software. But the software itself is open source, meaning no one owns it. No one claims ownership of. So pool together Inc. We did contribute code to the software that constitutes the pooled get a protocol that's deployed on the blockchain on Poly, obviously. But the company doesn't own it. Anyone can take that. Anyone can copy it. Anyone can anyone can it's it's it's it's open source license. And so the company originally developed it, and then what we did to decentralized control of the software is issue the pool token. And so the pool token represents control of the software that's on the blockchain. So the pool token controls the actual protocol. And you see this with other g five protocols too. So like, same model with Uni swap. Right? Uni swap the uni swap labs is the company that developed the protocol that we call uni swap, and then the token controls it. Same model with abe. Ave Ave labs created the protocol, the Abe token holders now control it. So it's the same model. It's not unique to pull together. But that's sort of the roughly, like, how how g protocols get developed. And so now the company pulled together need to company and work for. We don't control a protocol anymore. So, like, what do we do? And now what we work on is basically helping other people integrate with the protocol, helping build services on top of the protocol. So if if hit say a wallet says, hey, we really wanna integrate with we'll together the protocol. We can say, hey, we built that. So we're the experts on it? So why don't you work with us? And you can pay us to help you integrate with it. And maybe you can use our Apis and things like that. So that's sort of the the model for a pool together inked the company And in hindsight would probably change the name of the company. We're probably to call it like, you know, price savings, ink or whatever to make it more clear. But but that's a really... It's actually a really helpful concept. I think to understand just some deep dpi in general, how that all works. Yeah. Right. Yeah. Yeah. Very similar to that, Absolutely. And ", "start": 210.40425, "end": 349.7766}, {"speaker": "1", "podcast": "I'm curious too, Like, you you said that maybe you wish you would changed the name from pulled together to like, price saving inc. But... And like, I know, like, Ethereum has a foundation and maker did have a foundation that eventually dissolved. Like, do you think like a in hindsight, maybe you were just doing, like what uni swaps and are they and compound we're doing at the time and maybe they're could have been a a better structure for that or are are you happy with the, you know, incorporating under the I inc period structure? And I have haven't to talk much about ", "start": 351.51434, "end": 382.27808}, {"speaker": "2", "podcast": "I think I think I'm pretty happy with it. But, you know, there are there are other ways there like, you could do the foundation model. And, you know, and who knows maybe at some point in the future there will be a pool of together foundation. Maybe there'll be a foundation of people who want it help steward the protocol. You know? Because at this point, the community around the protocols is much bigger than the company. The company that I work for is a small company. We don't have that at many employees. But there's a lot of people who, you know, contribute in various ways or just hang out in the discord or use the protocol or vote governance proposals or So there's there is probably a need maybe for some sort of ", "start": 382.98898, "end": 420.22836}, {"speaker": "1", "podcast": "rallying point for all those contributors. Yeah. And so let's let's talk a little bit more about how pull together works. So we know it's a price savings account, but, like, what is a price savings account and what does it do? Like, if I've got a hundred Usd dc ", "start": 420.60455, "end": 435.86752}, {"speaker": "2", "podcast": "What do I do? Right. Okay. So first, we'll talk about it a little bit from sort of the user side. Just sort of like, what's the value of it. So the main value of pool together. The idea is it's it's like no loss savings. So just like a savings account, you can deposit your money, you can withdraw whenever you want to. But what's unique about it is that well your money's is deposited, you have the chance to win really large prizes. And that's possible because the yield on everyone's deposits is combined and then given out as prices. And so for for example, like, the luck person ever used the protocol. They deposited, I think seventy six dollars and they won forty three around forty three thousand dollars. So what so basically, it's a way for people to have the chance to get really large returns without needing to risk their money. Right? And that's what's so important about it is right now, if you think if you think about it, there's no consumer financial product that gives people the chance to say get a ten or a hundred x return without needing to risk the money they put into it. So pool together is unique and that it's a protocol that enables people to not risk their principal, not risk what they're depositing, but while they money it's a positive to have a chance to get these outs outside returns. So if you have a hundred dollars and you think, hey, your options are, I could go and deposit into, like, let's say, abe. And I could earn, like, a one percent Apr and over the course of a year, I'll earn a dollar. Or you can come over to Pull together and deposit it and maybe you would over the course the year, you might get nothing you might seven hundred dollars. But you might also win a hundred or a thousand dollars or you might win like one dollar and get the same the same Apr. So that's sort of how it works and The one other thing I'll say in it too is the way the prizes work is there's there's thousands of them. And so we might get to this later, but just to, like, touch on we were talking about this beforehand. You know, thus far on... In the last three hundred and thirty days, there's been two point four million dollars in prizes distributed by the pool to together a protocol on the Poly blockchain. And almost ten thousand unique wallets have one. And so if you do the math on that, that's a lot there's a lot of different size prizes. Some prices are like, five dollars, some prices are one dollars some prices are a thousand dollars. Some prices are even bigger. So that's that sort the high level of the overview. It's a protocol that enables you to deposit your money, take out whenever you want to and win prizes what your money deposited. Yeah. That that totally makes sense. And in the example we're using, I guess, if you take a hundred dollars worth of Usd dc and you ", "start": 437.69006, "end": 591.77234}, {"speaker": "1", "podcast": "deposited into Abe, you get one percent over the year and you get one dollar. I guess, like from an opportunity cost perspective, I guess the the user could say, well, is it worth a guaranteed one dollar return on O, not that any interest rates are guaranteed, but for, you know, for example, a guaranteed one dollar return on Abe ebay versus potentially, you know, like a two, three x return or zero percent return on pull together. And I think the best thing about it too, you know, it's called like a no loss lottery. And that's because With a lottery, you're purchasing lottery tickets for a chance to win and then that money's gone. And pulled together, you're depositing your money, and you just... Everyone's pulling their funds together. Yeah. Great name. ", "start": 592.6434, "end": 640.97125}, {"speaker": "2", "podcast": "For the interest and it gets distributed to the the prize winners. And this prize winner, there's there's usually a couple hundred... Sorry. The one thing I'd say is like, there's usually just to give a sense of scale, like, there's usually just just on poly is usually a few hundred per day that are at least winning something. So it's not like one prize a year type thing. Yeah. Absolutely. And another thing I wanna talk about is related to comp comp within the Defy ecosystem. ", "start": 642.4236, "end": 667.7555}, {"speaker": "1", "podcast": "Because... Yeah. I think it's also important to know you know, when all these deposit are pulling their funds together what what they're essentially doing is you're depositing and to pull together and the pull together protocol, the code, is lending it out and that's how you generate the interest. But where are you lending those funds out? Well, that's a great question to ask. Right? Because in the last year, there's been a lot of ", "start": 668.4867, "end": 693.5136}, {"speaker": "2", "podcast": "a lot of sort of things in the crypto space where it's like, where does the yield actually come from? So with with the pool together a protocol, a couple of things I say, Yeah. The pool of protocols is designed to be modular and that it can plug into different yield sources. So as of today, the primary two yield sources... Well, the only yield source that's use on Poly is Abe. So if you deposit into the pool together protocol, that deposit ultimately will go into Abe. So that's something for you to know. But technically, it can be integrated with other yield generation protocols. And and that's why it's this really kind of cool example of comp comp ability because these yield generation protocols just exist. And then the pull together protocol plugs in on top. And then basically, a assistance layer on top that ga signifies the yield generation. The Ga signifies the experience and says, aggregate, you know, everyone deposits and it all goes in through one, essentially as one person. That's sort of how the... Because the protocol deposits all that as one account. All the yield is then taken and red distributed. And so it says gamification layer on top of yield generation. One thing I do wanna say though, it's really important about the way the protocols designed is it's really designed to maximize for security and safety. And so with that, the protocols non custodial. And what that means is there's no way for anyone to access your deposited funds. So there's not like a multi sig a multi signature wallet that control something, even the pool of token holders, they don't have the ability to take your funds out of the protocol. And so what that means is if you deposit, into pull together and and it will go into and it will, you know, and it goes into abe, that's not gonna change in the future. It's not like that money is gonna get moved into into a higher risk yield source in the future. So that non custodial nature a pretty important thing for people to know about because that's a really important thing to keeping your your money secure. Yeah. That is. And and when I think of ", "start": 693.8927, "end": 808.925}, {"speaker": "1", "podcast": "security on the blockchain from a borrowing and lending standpoint, I think Ave in compound probably come number one and number two in my mind. So... But what are some of the other yield sources maybe on the other change? I think that could be interesting to talk about. Obviously, On Poly, it's it's auto alone. But what like, what are some other ones that? Yeah. Just some other D five protocols from a Lending and borrowing standpoint that the code is leveraging? ", "start": 809.28455, "end": 833.1261}, {"speaker": "2", "podcast": "Well, it still... It has been primarily compound because of what you said. I think the the pool together, governance is very conservative. On yield generation because, you know, pull together sort of the front door to D defy. And we wanna make sure that deep... It's no loss. And we wanna make sure the protocols no lost. And so we are really conservative on what protocols get integrated. But you are touching a little bit on on a protocol upgrade that's that's being considered, which basically would make it a lot easier for people to add create new pools with new yield sources and and and yet to create pools of new yield sources. And so with that coming, we... Because we do anticipate in the long term as Continues to mature, there's going to be a lot of different yield sources and you're going to want to be able to integrate with them because you want to get different rates of yield. And so that is that is a big focus, but right now it's pretty... It's with a few... There's a few small exceptions, but it's pretty much just compound and abe per yield. ", "start": 833.85895, "end": 892.94196}, {"speaker": "1", "podcast": "Okay. That makes sense. And, yeah, I think... So that would be, you from a protocol upgrade standpoint, yours So that's version five of pulled together. Yeah. W five. Version five. Counting... It counts that... That's counting sort of some beta versions that we had. But, yes. Yeah. Technically the version of five. Yeah. Because when I first started paying attention to pull together, it was on version three and it was on ethereum only. And I think you've gone to... Through some interesting iterations of the versions of the pull together code in the sense that On version three, it was only on a ethereum because scaling solutions were not yet available. Right. Right And you could create a pool for almost any token because I remember having compound tokens in a pool and just waiting waiting to win one day. And then, yeah, I I think it'd be interesting to kinda go through those different iterations. Like version three if pull together, version four, where it is now and, like, maybe with the future looks like with with V five? ", "start": 893.5928, "end": 950.8538}, {"speaker": "2", "podcast": "Yeah. So that's... Okay. So so the thing with version three that was cool is we it it did support more token types. So you could deposit more more types of different tokens into it. So the currently version four is only Usd. So in version three where was school was there is other token types. But the thing the problem was that each token type and each network. So like version three was on Poly. Each one was its own sort of completely separate prize pool. And so the reason that was sort of a bummer is because you don't get these really big prizes. Like, what makes pool together really fun and exciting is having these, like really big prizes. It's a person who deposits seventy five dollars and wins forty three thousand. But what happened is you would have to sort of choose like, oh, I wanna do the comp pool and that price is like a thousand dollars a week or the Pool and that price fifty thousand dollars a week or the You know, the T pool and that price is twenty five thousand a week. Right? And you sort of ideally, do you don't wanna choose between those you want us build to say, like, I want deposit and have a chance to win a hundred thousand dollars. And so maybe disagree that. But we we you didn't talked about that. But but so so that was sort of a limitation of of the v three was that And as so, like, when we expanded onto the Poly with the a b three, the Poly prize started at zero. You know? So the poly... You had... So basically, people had to choose Do I pay really high gas fees on Ethereum and have a chance to win a big prize or do I pay low gas fees on Poly, but the price is really small. And so what the D four was all about was networking all the pools together. So you can have different pools and different chains, but they all contribute to one really big cry. You know, they'll all yeah, They all contribute to one big prize. So that was what the v the V four was really about. And what the V five is really about is is opening up that. So so yes, the the V four got the network. Of all of, but it's only Usd. And so with the V five is, like, keep the network, but let people add more assets and more yield sources like we had v three. So it kind combines the best of both worlds. Now there's a lot of different tokens you can deposit. There's a lot of different yield sources you can use, but they're all building towards this massive sort of prize network that can be plugged into. And so the prizes can get to, like, millions of dollars a week. And that's when I think you start to see, you know, explosive growth happening. Yeah. And actually, I ", "start": 951.56714, "end": 1097.3285}, {"speaker": "1", "podcast": "I do remember pull together v three being on Poly gun because I think I had some t in there. And I just decided I just forgotten about that. So that's that's why I was making that making that face... But it wasn't as much fun because, you know, you had you had fifty thousand dollar prize ethereum and the thousand dollar prize on Poly got. It's like, great. You know, you wanna be the in the fifty thousand dollar one. Yeah. And I think one of the really interesting things about pull together version four was the multi chain aspect of it. In the sense that... Yes. Right? Because it's not... The prices are not side load now. And I'm also wondering and maybe it's gonna be too technical of the question. But how do you get all of the pull together instances that are on all these different chains to communicate with each other to, I guess, reach a consensus on who are the winners and what the prizes are? Yeah. Yeah. It's pretty cool. We won't go shoe technical on it, but basically ", "start": 1098.3466, "end": 1151.4105}, {"speaker": "2", "podcast": "basically the way it works is the governance lives on ethereum. And so the each each of the prize pools essentially reports back to ethereum on how much what their Tv is. So it says, okay, there's ten million deposited on ethereum and fifteen million on Poly. So using cross chain messaging, that's that's reported back to ethereum. And so it says, okay. The total Tb. The total deposits are twenty five million. I can't remember what it said in my analogy. Ten million ethereum, fifteen million on Poly, twenty five million. And then So that twenty five million number is used to generate the price distribution. And then the price distribution is pushed out to the chain so then people can claim the claim their prizes. So that's how... It basically works with cross chain communication. So Important thing again from a security perspective is the money itself is not moving back and forth. If you deposit on Poly, your money stays on Poly. It's not getting bridged anywhere. No one controls your money. But but... Yeah, That that's... That's how ", "start": 1152.0228, "end": 1222.2239}, {"speaker": "1", "podcast": "That's how that works. So that if that makes that makes sense. No. Yeah. That that makes sense. Yeah. That's that's very helpful. It paints a little bit of a picture with that without getting too technical. So I think that's yeah. That's a good way to do it. And so with version four only having Usd dc, like, are there any concerns, like maybe from a censorship resistance perspective of of just having Usd us dc? Or is that a risk that maybe a governance has discussed? ", "start": 1223.1743, "end": 1250.6799}, {"speaker": "2", "podcast": "You know, there there is. There right. There's definitely... So you're always trading off different risks. And with Dc, it's it's centralized... It's essentially issued stable coin, which means that there's a central party. It's called Circle, It's a company based in the United States and they can blacklist people if if they can black people. Meaning if you hold And they put you on the blacklist, you can no longer transfer that. In practice that's only happened a few times. And it's with, you know, worldwide known criminals. So it's not a bad thing. But but, yeah, you know, alternatively, you could use a a token like die, which is a stable coin that's not essentially issued. And therefore, it's more censorship resistant, but it's maybe a little bit less user friendly to get. And so I would basically say, like, yes, we've we've we've optimized the protocol again for really for security and really for usability for beginners. And so that's why we're primarily using, but also with the Speed pipe upgrade, that is a big thing we're interested in is being able to have other assets so that people do care more about centralization, they can use other assets that are more decentralized. So that's definitely an important thing for us to keep in mind. Again, he just kinda touched on pull together being ", "start": 1251.72, "end": 1323.7634}, {"speaker": "1", "podcast": "for beginners. ", "start": 1324.1534, "end": 1325.2646}, {"speaker": "2", "podcast": "And Yeah. Do you do you see together? It's, like the front door to d defy? Yeah. Yeah. I mean, we definitely... And we hear that. All the time. Like, people all the time Were like, oh, pulled together was the first deep I thing I used, and then I went on and used a bunch of other stuff. And that's great. Like, I think it's great that people sort of It's it's sort of d five one zero one and then people can go try other more complicated things. But, yeah, we definitely have always seen that as you know, normal people aren't going to trade options. They're not going to... You know, there... Most people aren't even being like Lp lps. They're not gonna do like, liquidity provisioning and understand permanent loss, but everyone has a savings account. Well, not everyone. But a lot of people have a savings account. Everyone should have a savings account. And this is a better version of a savings account. It's far better. You know, instead of getting tiny tiny Apr, you get all these prizes times far higher than one an Apr you would get in the traditional financial system. So that's where we think that, like, pool together really can be sort of this this on ramps to D five, front door to D five, and that's where we care a lot about trying to make sure. ", "start": 1325.8203, "end": 1389.7723}, {"speaker": "1", "podcast": "The protocol maintains a highest level of security and stability. Yeah. I totally agree. And I think, like, from a d defy perspective as well, a pulled together is easy to understand on the surface. Right? It's a it's a no loss lottery. The interest distributed among the winners, But then once you dig down into it a little bit more and you start talking about how it's built on top of Ave primarily, and then it it kinda... It does become just let that natural gateway for people to go into the rabbit hole and kinda understand these concepts of, like, you know, comp comp, self custom, everything that makes Web three and centralized finance, so special. And yeah. And I... Yeah. I think that that's... Yeah. I I think that's a perfect example. Yeah. And I would say, you know, if there's people watching this and they're interested like, if you go to ", "start": 1390.744, "end": 1439.0165}, {"speaker": "2", "podcast": "docs dot pool together dot com and also dev dot pool together dot com. There's a lot of extensive documentation about how does the protocol work and all the intricacies of it. You know, I've sort of been breathing through things. But like you said, Justin, It's like a really good way to sort of learn about D five because a lot of other protocols working in similar ways but offer a different thing, you know, maybe they offer options trading, but they have some similarities in terms of how they're structured. Yeah. And and on that, similar to that same topic, I feel like Pull together from a community ", "start": 1439.633, "end": 1472.35}, {"speaker": "1", "podcast": "standpoint has such a strong community. And I'm wondering like, I don't know. Like why do you feel like that is the case? Like, like, I... You've obviously got Timothy Cox over there running your community with the community podcast and he's amazing, but I don't know. Like, like, how do you attribute that success? Yeah. I mean, I do think we have our awesome community ", "start": 1472.8099, "end": 1494.2274}, {"speaker": "2", "podcast": "in there's a ton of people who who... Yeah, who represent that. Yeah. So many so many people who who I'd love to, like, individually talk about. I think there's no shortcuts to community. So, you know, like, cool together has been live for over three years. I would say as both a community around the protocol and as a company, we haven't really taken shortcuts, and I think that has that has served it us really well in terms of attracting people who are interested in the long term. It's typically interested and, you know, pooled together had sort of the social good aspect to it. The protocol helps people save. And that attracts a certain type of person who's interested in contributing to that and interested in seeing you know, people people thrive financially. So I think... Yeah. I mean, if I was to get a little more tactical, I would say, you we have our community calls every Friday. Those are open. We try to be hyper transparent with everyone. Try to be very you know, obviously, in terms of the pool governance of the protocol, it's it's it's very sort of like a flat governance structure of like, there's thousands of people that hold the token, a lot of people vote. And so there's not like a single person in charge. Actually, the very first governance proposal once once when the pool tokens was issued, the very first governance proposal was one that I didn't submit, but I was like a big fan of and was advocating for, and it was actually the first one like I voted down. And so that was like a great example of, like, right off the bat. You know, as the founder Pulled together, Inc, the first thing that I think is a good idea of the communities is based like now, we're not gonna do that. And I think that that really stuck out to people as like, hey, And this is actually a decentralized protocol and I can actually have a big role in this community. Yeah. And you touched on something else to that was really interesting in fact that you said that pulled together has been around for three years. ", "start": 1494.7612, "end": 1606.6339}, {"speaker": "1", "podcast": "And from a D five protocol perspective, you're in the Dinosaur club. Have you've been around for three years. Like Yeah. Pull together is like a low key d defy o g and you know, it's been around almost as long as maker and synthetic in... Right. Uni swap in Eth lin, which is now are they? And But I feel like pull together, like when you compare to those other protocols that I just named, they really haven't obtain, like the same type of popularity as the other ones. And I'm wondering like, you know, you you also have like this incredible community. I'm wondering like, why do you feel like you haven't achieved that same notoriety? ", "start": 1607.4293, "end": 1645.9812}, {"speaker": "2", "podcast": "Well, I think there's two things. I think like you know, in some ways, pulled together was a little early, first time for sure, you know, what what you're really early early, which is what we were. The normal user is not someone who... It's actually a very sophisticated user who is they're not even... They're not risk ave reverse at all. They actually would want to seek out risk. And for those types of people, pool together to probably doesn't make a lot of sense. And so I think those people are more attracted to some of these more D gen protocols, where they can do more you know, more more options trading again or like, lending and powering, a more complicated financial things. So I think that's part of it. Like, there's was a little early. But I and I also think that pool together is a protocol that is is is again, it's it's its strength is in sort of it's appeal to normal people. And it's been really hard for normal people to access the blockchain. And that's why, you know, the they were recording this is the day Robinhood, release their beta for the Poly Robinhood wallet. That's why I kinda think pool the other time is finally finally come in a lot of ways. Because we finally are getting, you know, with with Poly gon with Robinhood with coinbase. We're finally getting easier and easier ways to on ramp easier and easier ways to access decentralized finance. And as that happens, I don't think people are gonna start by you know, trading options. I think people are gonna start by using something like, pool together. It's like, hey, like, let me put part of my savings on chain. Let me get a better return on my savings. You know, and then from their graduate. So I think that the reason... Yeah. I think the reason that it hasn't sort of found the same adoption is as as some things like Maker da or or synthetic is is because it's really suited to a different type of user. I think it's getting easier and easier for that type of user to start using pool together. Yeah. Absolutely. And yeah, We're we're obviously very excited and very happy with the the Robinhood hood announcement. ", "start": 1646.555, "end": 1764.822}, {"speaker": "1", "podcast": "I do. And I just what it means for web three in general. Yeah. Yep. It it's it's incredible. And like you said, like, there's a there's a lot of users. I've got a lot of friends to, you know, make their dollar cost average purchases on Robinhood because it's... Because it's easy. It set it and forget it. And now they have the ability to withdraw those funds to the Poly gon network and they could... I mean, take their T and ", "start": 1765.4739, "end": 1788.0708}, {"speaker": "2", "podcast": "deposit and to pull together. Yeah. It's gonna be it's gonna be awesome. I'm very very excited. It's it's amazing how much there's been so much awesome stuff that's happened this year. Obviously, the prices have been terrible. But in terms of actual usage and things being built and partnerships and all that. And so it's really exciting. Yeah. That's that's always like part of the thing. Right? It's like, ", "start": 1788.9215, "end": 1810.3636}, {"speaker": "1", "podcast": "I talked to my non Web three friends and they're, you know, they see the price and they're like, hey, are you doing okay? And I'm just like, yeah. Like, I'm doing fine. You know, it's like, I go to all these conferences and I I talk to all these teams that are building really cool stuff that it's like way ahead of its time and, you know, like the price is not reflective of the innovation and the drive that a lot of these people have and, you know, it's not just it's not just in the Us too. Like, this is global, like, I've gone to conferences in South Korea. I'm going to Colombia for a conference, and it's just this is a very much a global movement. And I think people in the Us get kinda stuck in the mindset of, like, I have no use case for this in the Us. ", "start": 1811.4766, "end": 1852.7916}, {"speaker": "2", "podcast": "But it's... Well, let let let's talk about that for for a brief minute because because it's true in a lot of ways a lot of times in a lot of a lot of ways, people in the United States and Western countries have less of a need for Defy. Because they already have access to a well developed financial system. But pool together has a lot of users in like Argentina, for example. In Argentina, where inflation, you know, ninety percent a year, just them having the ability to save their money in Usd dc is is like an amazing amazing thing. That's already helping him so much. And then on top of that, we have we have a community member from Argentina, well, we have a lot, but we have one specific one. I'm thinking of who was talking... You know, I mentioned there's a lot different prizes, different sizes. And we were having a debate of, like, our one dollar prize is worth it. And this community member said, like, hey, for me to win one dollar, that's like me winning a day's salary. And so, yeah, like a one dollar prize is a really big deal to me. And, you know, that's something where you talk to someone in the United States, and they'd probably be like, oh, you know, the prize a dollar prize. I don't care about winning that. I'm not even gonna claim it or whatever. But, you know, you talked to someone in Argentina and they say, yeah. Saving my money in dollars and being able to win prizes and dollars. That's a huge deal. So yeah. I I often say that, like, Defy for wealthy people sort of like, hobby, but for for poor people, it's it's like a lifeline. ", "start": 1853.9104, "end": 1937.9602}, {"speaker": "1", "podcast": "Because it's especially people who don't have access to a well developed financial system. Right. And and like, the only thing is like there's like this huge technical hurdle as well for a lot of a lot of people. Right? Downloading the meta mask, like, how... Like, if you are an Argentina, like, how do even get your money on the blockchain. Do you just... Is it just like, peer to peer in person. Like, what was the like, what was the bitcoin peer to peer where you could, like, meet people in the like points. Local coins. Yeah. Just kinda like that. But for Usd dc and in Argentina, maybe. I'm not really sure how that would work. But interesting. But... And I I feel like that that also kinda leads into, like, price savings accounts. This whole idea is is perfect for the blockchain. Because there are those like real world examples of what you said. And there are price savings accounts and no loss lotte in real life. And I've heard you talk about these before. So can you just kinda touch on, like, the existing real world pricing savings account? No loss lotte, and then maybe I'll also talk about, like, why is doing it on the blockchain so much better? Well, I usually used for reference, like, the in the Uk, ", "start": 1938.933, "end": 2005.5803}, {"speaker": "2", "podcast": "it's called premium bonds, and that's like the biggest one in the world. So there's a hundred... Over a hundred billion Us dollars, the Us dollar equivalent. It's obviously in pounds, deposited into this price savings program in the Uk. And in the Uk, like I said, it's called premium bonds. So that's... So that's a lot of money. Right? If there was a hundred billion dollars to deposited to pool together. That means that means every month, there'd be, like, five hundred million dollars in prizes. Right? That'd be pretty crazy. So so that's a ton of money. So there's there's a lot of usage And it varies by countries, some countries they're not as popular some are more popular, but that's like one of the ones it's most popular. So why though why why is it better? Like, why why is pool together, the protocol better than this product savings in the Uk. I think there's a few reasons. One is just transparency and audit ability. Right? Pull together, like I said, it's all on the blockchain. It's open source code. Anyone can read it. Anyone can verify that it's fair that it's operating securely that it can't be hacked. Right? So that that end of itself is huge. Because typically, you have to trust some third party like a bank to say, oh, yeah. We did this fairly, but you actually don't know how they did it. And you can't audit it how they did it. Right? So that's that that that sort of fairness and transparency is a big benefit. The other benefit is sort of the scalability of it. So if you look at price savings programs in the world, typically they have a lot of stipulation around them. They're like, oh, it has to be at least a thirty dollar deposit, you have to notify a seven days in advance if you wanna to withdraw, you have to keep your deposit for thirty days before you're eligible to win anything, all sorts of things. And the reason they have this is because It's very expensive to administrative. Right? If you're if you're just getting small amounts of interest on small deposits and turning those into prizes, That's not very cost thing to. With pull together, no one it. The blockchain it, the smart contracts it. So that cost is gone. So that means it can actually scale. It can actually make sense. Even if you only have one dollar deposited, you can still have, you know, the set you can have, you can withdraw whenever you want to, There's no waiting periods. There's no stipulation. You can deposit. You can withdraw whatever you want to. And it can it can grow. It can scale as fast as as fast as possible because there's no cost to scale it. So that scalability is another big thing. And then the third thing, I think is that it can be, you know, decentralized and user owned. So That's again, really powerful. The fact that people who use the pool together protocol can become owners of the pool together protocol by holding the pool token. And we've distributed many pool tokens for free through the air drop. And and so that's like, awesome really cool. Cool. Right? Like, to actually be able to not just be a user, but also an owner at the same time. Those are cool things. So those are those are some of the biggest things you know, I could I can go on for a while, but but I think... So to me, when I look at that, I'd say, okay, we have this thing that's proven to be popular. There's a hundred billion dollars a deposit into it. We have a version of it that's very clearly better. You don't have to, like, argue you in circles. It's very obviously just like a better implementation built on a blockchain. So the... It's really just an execution question of like, okay, what's the best way to get that hundred billion dollars onto the blockchain? Because obviously, if it's a better system, people are gonna prefer to use it. So that's that's what we're in the process of doing right now. Yeah. That makes sense. And You also talked about ", "start": 2006.551, "end": 2217.3345}, {"speaker": "1", "podcast": "how, I guess, like in the real world, there are, like, limitations on how long you have to be deposited. But there are also limitations how long someone has to be positive and pull together to be eligible to win too. Right? Because I think I think about you did mention this I heard you mentioned this before? Because what's top a user from coming in and depositing like, a hundred thousand dollars like, thirty minutes before ", "start": 2217.7095, "end": 2241.185}, {"speaker": "2", "podcast": "the drawing of the winner and then just we're withdrawing right after that. So good question. So... Okay. So that is a good question and that... Points to some improvements I been made. So that was true. There was a time a while ago where like on version three or... Yeah. Version three, you you could you could always withdraw whenever you wanted to, but basically, like, Basically when it works is there was a little bit of a time delay, it would be like a couple of days between like, when you deposit and when you're actually eligible to win your first prize. But with the version four, one of the improvements that was made, Didn't touch on this one. But is that it actually when a price is awarded, it uses your time weighted average balance. To to calculate your chances to win. So, yes, you could deposit a hundred thousand dollars right foreign a price is awarded, but having a hundred thousand dollars deposited for, like, one second is gonna be the same as having, like, a hundred dollars deposited for seven days. Because it's using the average balance you had over the period of time to calculate how much money you've had deposited. Not your balance at the point of the prize being awarded. So again, that's something that you, you know, that's something that you do... That's done on the blockchain. And that's something that, like, again, a very superior superior method to to this program then than something that you would do in the traditional financial system. Yeah. So it's like blocked by block essentially. The more blocks that you've had your money. Yeah. So you could deposit a million dollars right before, but you're gonna have the same chances as someone who had a smaller amount for a longer period of time. Yeah. That makes sense. And just like the the idea of, like, trying to maintain that, like, on the in the real world example, ", "start": 2241.4941, "end": 2342.9937}, {"speaker": "1", "podcast": "Like said, administration costs are too high. And here, it just the smart contract just manages this ", "start": 2343.553, "end": 2349.3335}, {"speaker": "2", "podcast": "automatically. And so... Yeah There's it's it's almost like that type of... Yeah. It's really like that type of feature can only be possible on the blockchain. Yeah. It's definitely... I I think it... Yeah. It's uniquely better in a in a very... Yeah. It makes it really a different thing because it's so much better. ", "start": 2349.7893, "end": 2363.8508}, {"speaker": "1", "podcast": "Yeah, Absolutely. I also want to talk about the poll token for a little bit. And you know, what is the pull token? Like, it it appears or it seems like it's like pretty well distributed within the pull together ecosystem. Which is something that you need to account for as a user when you're looking at the centralized protocols is the token distribution. And so how do you feel like like, how are you also successful in that distribution of the token? And what's some of the utility behind the token and what does governance have control over? ", "start": 2364.4246, "end": 2398.843}, {"speaker": "2", "podcast": "Yeah. So on the first question, how do... You know, we were definitely very aggressive on wanting truly decentralized governance. And so you know, when we did the initial Air opt, fifteen percent of the total supply went to went to the the existing deposit in the protocol, which was more than went to even the investors in pulled together Inc. Or any of the employees have pooled together. So the greatest amount of pool tokens went to the users. And that was day one, and since then even more have been distributed. So So I guess like, the short answer is we... You know, anyone can do that, but you know, you just have to sort of have less for yourself and give more away. And you're able to accomplish those those goals. And we we sort of wanted to take that route from the beginning to make it, you know, really really decentralized. And also we made the barriers to governance participation really low. So you only have to have ten thousand pool tokens to create a governance proposal, which is ten millions of total supply. So it's zero point one percent of the total supply. So it's super super low. So you can you can, you know... A lot a lot of these protocols, It's like, oh, there's no way a normal person could ever get that many tokens to be able to influence governance. But in pool together a normal person certainly can. So that's it. So in terms of what what is the protocol or what do the pool token holders control? I was say, broadly, the primary things are one we touched on is, like yield generation or yield sources. So like what yield sources are approved by the protocol to be able to generate yield. Another is a big one is like the price distribution. How often enterprises is happening, how are they distributed? Again, there's a big design space there? Because you can have one ten thousand dollar prize each week or you can have ten one hundred dollar or ten that one thousand dollar or, you whatever. You can have a lot of different price distributions. So the price distribution. The third is also just the further distribution of the pool token itself. So the pool tokens are in charge of the protocol treasury which has a lot of pool tokens in it as well as other assets And so how those get distributed up to the the pool token holders? There is a lot more come in with B five in terms of making the pool token more integral to the to the protocol sort of operations. I won't get too much into it, but there's basically... The pools open will have a bigger role to play in sort of balancing these different price pools that have to yield sources to determine which ones are sort of the best ones to deposit to? I think guy, I think I could do some pretty easy speculating on the type utility. ", "start": 2399.7205, "end": 2558.9775}, {"speaker": "1", "podcast": "You don't say... Yeah. I won't say it. But and like... So all of that interest that's being generated by the pool deposit. So is all of that going to the users at the end of the day or the week the price period is or is some of that actually retained by the pull together treasury. How does... Because I think at one time there was like a small percentage that was going to the treasury and I'm wondering, like, is that still the case? So the way... Yeah. ", "start": 2559.9504, "end": 2590.3508}, {"speaker": "2", "podcast": "Yes and no. So the so no no as in right now, no. That's not the case. Yes, as in at at certain points, it has been the case. So Again, that's that's a pretty important job of the pool token hold of the governance is sort of managing the inflow and outflow in terms of like how much interest is being accrued, how many projects are being distributed. And so at certain times, there's been less prices distributed than interest coming in, that other times we've doing more prizes distributed than interest coming in. And the token holder governance is basically managing that to sort of optimize it. To have the best sort of the best sort of distribution to the deposit. And so at times when yield rates are really low, there's some subsidy, which like again, this is the Alpha podcast. So like, right now, people who are depositing into pull together on Poly are are almost are almost mathematically guaranteed to be getting a better Apr than depositing into Abe directly. And that's because the pool together a protocol itself is giving more yield to them than is the the abe protocol is giving to the giving. And so So so... But but on the flip side, there there there was there was a time maybe you know, I don't know a specific time. But maybe a year ago or whatever ever where. It was absent. Where there's, you know, more yield coming in and than going out. So so I guess, I think that sort of answers your question. So it's sort of it's sort of like, the the token holders do sort of control the inflow and outflow and try to try to balance that for optimum option growth. That makes sense. And I know that like during v three, there was like a a reserve factor as well. ", "start": 2592.3403, "end": 2688.9844}, {"speaker": "1", "podcast": "Can you explain what that is and is it ", "start": 2689.9365, "end": 2692.4207}, {"speaker": "2", "podcast": "Is it live in v before? Do you think we'll see that in v five? Yeah. So the reserve factor was basically, like, setting an explicit rate to say, like, okay, ten percent of the yield will be kept in the protocol for future prizes. And with d four, there is not a reserve factor, although conceptually the same thing sort of exists. Where there's not, like an explicit rate that's set, but conceptually, you can just sort of distribute ten percent less prizes then yield comes in. And, yeah, I I do think, like, again, continuing to manage this relationship because between yield generation and and prizes going out is is gonna be a really important. For the pool open holders with the with the V five as well, because ultimately, there is sort of this cold start problem with the protocol where I think to get to the... And needs to have really big prizes to get to the to to to sort of break out and sort of become viral and sort of gets to the place where your your mom, and your grandma are depositing. And so to have that, there's gonna have to be a subsidy, you know, there's gonna have to be some bootstrapping from the protocol to to get to there. But then I think once it gets to this really large scale, that that subsidy will no longer will no longer be needed. Yeah. Another thing I wanted to touch on in this ", "start": 2692.7307, "end": 2762.7559}, {"speaker": "1", "podcast": "touches a little bit on pull together community, but also just touches on the wider crypto Web three community and that is related to the Pool N campaign that y'all Yeah. Released. Made big waves on Twitter, I am in Pool N holder as well. So I think that would be fun to explain for just for those who are not aware of of the Pool campaign. Yeah. So for sure. So the Pool campaign was an amazing thing. For for... ", "start": 2764.2585, "end": 2793.2236}, {"speaker": "2", "podcast": "I would feel like crypto in general, but for me personally. So for a little bit of context, back in October... Or sorry, November, November of last year. There's a lawsuit filed against my the company pulled together Inc as well as myself personally as well as some some other investors in in the company. And I won't really go into details lawsuit because it's an ongoing lawsuit, so I'm not really allowed to talk about it, but I will say if people are interested, they can go to mint that pool the other dot com. And you can find... There it was covered in the Wall street Journal and there's some other court filings you can read. So anyways, a lawsuit was filed, we could say that. And And, yeah. And it was a lawsuit that I I think the crypto community generally felt like was not a a very fair characterization of sort of the protocol and and how lawsuit was was filed. And so the one cool thing about the lawsuit was that there's a ton of people who reached out wanting to support myself and and the company. And finally, in May of this year, we launched Campaign to be able to facilitate that. So that people could actually buy these n entities to support the company and in our legal defense. And so that was, like, the Energy campaign was a huge success. I think we raised, like, one point five million dollars in terms by selling these Entities. Sold thousands of amount of t's, which was just incredible. And also outside of just the financial side of it, just having so many people support us was was really amazing. So it was a huge life changer for me, really because, you know, it took something that was super stressful. Was taking a lot of time and resources away from the company and put it as something that was sort of taken care of. And that's that's been really, really amazing. So ", "start": 2794.0217, "end": 2902.6296}, {"speaker": "1", "podcast": "I'm deeply grateful for all the Pool holders. Yeah. It was obviously, such successful campaign, just seeing everyone on Twitter changed their avatar or their P p to a a pool. And I think mine, I think Mine says swimsuit not lawsuits. ", "start": 2903.0989, "end": 2919.1675}, {"speaker": "2", "podcast": "On it. So. Yeah. A little Pool bird holding a sign. Yeah. Yep. In Oops and David, who are two community members were the artist behind that and they did, like an amazing job, I think of, like, really embody the protocol and the company and this in this really cute ", "start": 2919.659, "end": 2935.9902}, {"speaker": "1", "podcast": "little pool bird. So if you go to mint that pool together dot com and see that as well. Yeah. It's it's such a successful campaign and it was it was just really great to see like the entire web three community, just kinda hop behind this. Whether they had use the protocol or not, I think people were just buying in a t to support just the web three ecosystem? Because how dare how dare you gain people into saving money versus spending it or. ", "start": 2936.778, "end": 2961.9536}, {"speaker": "2", "podcast": "Yeah. ", "start": 2963.2446, "end": 2963.3245}, {"speaker": "1", "podcast": "Anyway... Anyone can read the lawsuit for themselves to to make their own opinion on the merits of the case. But, yeah. I don't I don't believe it has merits. Yeah. I I will I won't make you talk too much more about it. So... But it it also... Yeah. I mean, just kinda reminds me too of, like, you know, you had, you know, the tornado cash thing that came about and you had coinbase base step up and say, yeah, we're gonna support this lawsuit and we're gonna fight this because we feel like oh opec this overs stepped its constitutional reach. On this. And weren't you part of the coinbase based anti flood campaign for a little bit? Is the of thing that you'll doing on Twitter? Yeah. I was. I was. ", "start": 2964.3606, "end": 3000.3616}, {"speaker": "2", "podcast": "Yes. So that was a very informal thing, but, you know, I was just, you know, we're in we are in I don't I don't know if I'd say it's a hard time for crypto, but it it's a it's an important time. It's an important type for crypto because there has been these things that are crypto adjacent that really don't represent crypto or D defy, things like celsius, things like t, that don't really represent it, but get associated with it and have been very detrimental to people, very damaging to people. And I think regulators are rightly looking into that and say, okay, we need to, like, prevent this from happening again. But unfortunately, they don't really understand what happened. And why it happened. And therefore, they're they're they're sort of attacking everything. And so that makes this a really important time And I think you know, Coinbase basis is a company, that's one of the only publicly traded crypto companies out there. It's a very important companies in the space. So I was trying to sort of, you know, support the narrative around them because I felt like they were sort of unfairly getting discouraged a lot. And I just think it's a time of general all the crypto we have to see the bigger vision, which is not obviously the successor failure of any individual person or company, but it's trying to usher in a more fair financial system, that's better for people. That that displace it's more efficient and that displace, you know, powerful incumbents. And instead creates better out financial outcomes. And that's the goal. And so I'm definitely trying to, you know, encourage people towards that positive sum thinking and and and defending coinbase base was was one small thing I did. Along that ride. ", "start": 3001.1733, "end": 3097.8135}, {"speaker": "1", "podcast": "Yeah. And I was just kinda waiting for, you know, the coinbase based tornado cash in F feet to come out because I thought that, you know, There's there's one. There's a case study for the success of something like this. But anyway, that one. I'd buy one two. Another n topic related to pull together is There's rumors that y'all all are starting a partnership with central games and their ice poker wearables. And I'm am a fan of central games and ice poker and Ryan and My over there. So Yeah. Can you can you talk about that at all? Yeah. Well, that just wasn't announced today. ", "start": 3098.4646, "end": 3136.6375}, {"speaker": "2", "podcast": "And so just going. But, yeah, it's it's a really fun one. Where basically essential games has provided a free wearable for everyone who's a opted to pull together in Poly. You have a deposit, you can go and and claim this. And it's really fun. It's like it's like a Pool leak, like literally a Pool. And so you can wear that in the central gains virtual virtual meta. And, yeah, that sort of just getting started, but it's sort of playing at that intersection of again, like, with with pulled together being, like a front door d defy, it has a lot of deposit. It has a lot of users. And so we really want to get more people introduce them to more things in the ecosystem. You know, it's like, once you try pool together, it's like hey, go try this thing now. The meta versus sort of the next level. So ", "start": 3137.3528, "end": 3184.0273}, {"speaker": "1", "podcast": "really excited about that as well. Yeah. Well, I didn't know that I could go commit that today, so I'm gonna go admit that today. Right after this interview. Absolutely. Enlighten, is there anything else as we're were starting to run up on time here that maybe we didn't get a chance to talk about that you want to address specifically about pull together or just anything? ", "start": 3184.4028, "end": 3204.243}, {"speaker": "2", "podcast": "No. I mean I think, you know, I definitely saw this podcast. It's a little bit of a celebration in some ways because you know, for some people listening, pools together on Poly might not be new because it has been almost a year that been deployed on there. But it's been really cool to have so many users on Poly gong. There's now... Like I, there's been two point four million in prizes distributed, ten thousand unique of almost ten thousand unique people winning prizes on Poly. And, yeah. So so we're, you know, really excited about, like, all the growth that Poly scene and all the partnerships Poly has. In terms of getting onboarding people, the normal people again through, like, Starbucks and through Robinhood hood. And really excited about how that will grow pulled together on poly on too. So I don't know. I get I guess that's not really another thing to say, but just more of you know, I think as worth celebrating even in the midst of a bear market price wise. It's worth celebrating all these all these good things that are happening. Yeah. I absolutely ", "start": 3204.7224, "end": 3263.0222}, {"speaker": "1", "podcast": "agree. And I think with that, yeah. We'll just say Leigh, where can people ", "start": 3263.3982, "end": 3268.534}, {"speaker": "2", "podcast": "are listeners go to find out more about you and pull together. Yeah. Well, so if you wanna keep up with Pool together, just sort of the news, Twitter's of best space for that. So go to our Twitter account just app pool together. Discord, if you wanna join the community, go to our just discord. If you wanna to get involved in the weekly community calls and governance, etcetera, join the discord. And then obviously, pool together dot com is where you go just to use use the protocol, and you can use it on Poly deposit there. And and, yeah, would love to would love to hear any feedback We'd would love the people join the discord community and ", "start": 3268.9104, "end": 3305.916}, {"speaker": "1", "podcast": "got more involved and we're always looking for more community members. So it's a great place to get your get your feet wet. If you're looking to dive into D five. Absolutely. And I'm a user together, and I am a big fan. So awesome I'm the glad that you came on Leigh. Thanks for joining us for this conversation. And for everyone listening and watching. Thank you for listening and watching. Subs stack, Spotify, Apple, Youtube, please subscribe. And we will see you next time on the Poly Alpha podcast. Thanks again, Leigh. Thank you, Justin. ", "start": 3306.4648, "end": 3335.5774}], "summaries": [{"title": "1. Understanding the Poly Community and Pool Together Protocol's Success in Crypto and the D Device Space", "summary": "This podcast episode features Leigh K, co-founder of Pool Together, Inc, discussing the importance of clarification and inclusivity in web three. They also talk about their background in software entrepreneurship and their interest in crypto and blockchain. The conversation covers the structure of Pool Together Inc., the concept of open source software, and the potential need for a better organizational structure in cryptocurrency foundations. The author emphasizes the significance of community involvement in the development and stewardship of protocols and suggests the possibility of creating a foundation or pool of people to help ensure the success and sustainability of the protocols."}, {"title": "2. Exploring the Potential of Price Savings on the Blockchain and the Structure of Pull Together Inc.", "summary": "This text discusses the concept of a price savings account within the context of Pull Together. It explains how Pool Together works as a protocol that allows users to deposit money and have the chance to win prizes without risking their principal. The text highlights the distribution of $2.4 million in prizes and the potential for high returns. It also mentions Abe, a guaranteed one percent return option, and the importance of competition within the ecosystem. The text explains the Pool Together protocol and its non-custodial nature for security. It discusses the top yield sources and the integration of different protocols. The conversation explores the evolution of Pull Together from version 3 to version 5, emphasizing the ability to deposit various tokens and utilize different yield sources. It also explains how cross chain communication is used to distribute prize pools in a decentralized manner."}, {"title": "3. The Importance of Organizational Structure and Community in Cryptocurrency Foundations and Protocol Development", "summary": "The text discusses the confusion surrounding the use of Usd dc in version four and raises concerns about censorship resistance and governance discussions regarding this risk. It mentions the differences between centralized and decentralized stablecoins, highlighting the trade-offs involved. The text also discusses Pool Together, a protocol that aims to introduce everyday people to decentralized finance (DeFi) through a user-friendly and rewarding savings account. It discusses the security and stability of the protocol and the availability of comprehensive documentation. The text also mentions the strong community support for Pool Together and the importance of community and transparency in the protocol. It concludes by discussing the potential for increased adoption of Pool Together with easier access to decentralized finance platforms like Robinhood."}, {"title": "4. Understanding Pull Together: A Price Savings Account with No-Loss and Prize Opportunities", "summary": "The speaker discusses the global movement of Web 3.0 and how cryptocurrencies are undervalued. They emphasize that Web 3.0 is not limited to the US and highlight its potential in countries with unstable economies. They discuss the benefits of using blockchain technology for financial services, such as savings accounts and lotteries. The Pool Together Protocol is praised for its transparency, scalability, and user ownership. The text also mentions improvements in calculating chances of winning in version 4 of a blockchain program. Smart contracts are highlighted for their ability to automate processes and reduce costs. Despite the decline in prices, the crypto industry has made significant progress."}, {"title": "5. Exploring the Impact of Pull Together and Pool Together Protocols on Lending, Yield Generation, and Multi-Chain Functionality", "summary": "This text discusses the distribution and governance control of the Poll Token in the Pool Together ecosystem. It highlights the inclusive distribution of pool tokens and the control they give users over the protocol. The text also questions the allocation of funds generated by pool deposits and the impact on user benefits. Token holders play a crucial role in managing the inflow and outflow of funds for optimal growth. The text also discusses the impact of climate change on food security and the need for urgent action. Lastly, it discusses the concept of a reserve factor in yield generation and prizes in protocol V4 and how it will be managed in protocol V5."}, {"title": "6. Addressing Confusion and Concerns, and Highlighting the Benefits and Popularity of Pull Together and Pool Together Protocols", "summary": "The text discusses the success of a fundraising campaign launched by a company facing a lawsuit. The campaign raised $1.5 million and received widespread support, relieving stress and providing resources for the company. The author expresses gratitude for the campaign's success and the support of the community. The text also mentions the creation of a sign representing the company and praises its design. Additionally, the text discusses the need for action to mitigate the effects of climate change on agriculture and ensure global food security. It also emphasizes the importance of regulation in the cryptocurrency industry and expresses support for Coinbase. The text concludes by providing information on where to find Pool Together and encourages feedback and community engagement."}]}