{"podcast": {"title": "Polygon Alpha Podcast", "host": "Justin Havens", "image": ""}, "episode": {"title": "An Unreal Primer on Real World Assets | TJ Ragsdale & Jack Chong | Polygon Alpha Podcast", "number": "18", "date": "OCT 18, 2022", "description": "", "url": "https://www.youtube.com/watch?v=15xrqqAnGMY", "speakers": {"0": "Justin Havens", "1": "TJ Ragsdale", "2": "Jack Chong"}, "file": "october18.mp3"}, "transcripts": [{"speaker": "0", "podcast": "Hello one, welcome to the Poly Alpha podcast. With the Poly gun community gathers insights from today's leaders decentralized finance crypto in Web three. I'm your host, Justin Havens, a aka Crypto. Let's get started. On today's episode of Po on Alpha, we are joined by Jack Chung and Teach Rag. Who authored the real world asset primer. It's an incredible piece of literature touching on all of the aspects of bringing real world assets onto the blockchain and what the future looks like. So Jack, Teach? Thanks for being here with us today. How's everything going? Good, sir. Thank you for having us on. Thanks for having us. Yeah. Absolutely. Let's just get started on y'all background. Jack will start with you, you know, what's your background and then T will will go to you as well. Yeah. Sure. So ", "start": 0, "end": 56.184788}, {"speaker": "2", "podcast": "I am more like a E guys, but funny enough actually just become crypto code in the beginning of the year. A started of doing a solidity coding. And before that, I had a biotech, I've bought an As sas thought watching in the enterprise Saas Vc. And so when I first jumped into Dubai are so unwanted of parallels. Word and express. When it comes to adoption dynamics, when it comes how to clear out or classified different solutions. In terms of surprising model. And I think that kind of hinted it at some of the motivations, and some of the lenses that I looked at real world assets. And b is really exciting, You know, particularly because I initially saw to look at stable points, a lower parallels between monetary economics and mechanism design, but there's a problem, which is crypto has so far remained quite reflective. And so I did a bunch of stable research. I actually wrote the first court based analysis and economic analysis of F. That went viral and up to my day. And I saw the light at the end of the tunnel, You know, the mall protocols I saw, the more I'm like, wow, but where's the fundamental value from this? Why how do we reduce volatility of this asset? And I thought real world asset is inevitable, and that's what drew into it. Can't teach what about your background. ", "start": 56.735, "end": 147.21658}, {"speaker": "1", "podcast": "Yeah, my background. So I spent about three years on Wall Street, trading commercial mortgage backed securities. Basically pools of real estate loans, primarily commercial. That was very interesting. Always enjoyed the intellectual exercise of finding a position undervalued before someone else, but like many of us who have sought refuge in crypto. I was sort of tired of being told what to do. And I felt the shop that I was working for was was a bit dogma mad. So I gave my two weeks the beginning of Covid moved to Turkey for a bit and then rein in the workforce and the only way I knew how, which was at the inter section of crypto and the real world. And so I've been leading the real world asset effort ", "start": 147.78818, "end": 197.43593}, {"speaker": "0", "podcast": "at Maker out for the past year. Or so. Oh, very, very interesting. And so the title of this document for this paper, this primer, if you will, is called an unreal primer on real world assets. By Ut, Jack, and then you also have a third author cocoon, Can why will just give a little bit of background on M tuned since he's unable to be here? Sure I can take it. ", "start": 197.81328, "end": 223.01372}, {"speaker": "1", "podcast": "Mu is our third contributor early on when we decided to sit down and write this thing, he, you know, shot across the bow and said he wanted to contribute and we were, of course thrilled to have someone a crypto native and be interested in sort of contributing to what we hoped was a foundational piece. Mu, I believe is a junior at Harvard. He recently intern with Box Group as well as anti metal. Knows a ton about crypto, and he actually announced today that he'd be taking a a new gig, but I'll let him announce that to the world. So We're thrilled to have him on. Yeah. That's amazing. So I I guess we can just kinda go ahead and start digging into this primer on real world assets. ", "start": 223.81041, "end": 270.39883}, {"speaker": "0", "podcast": "And one of the first things that y'all talk about in this primer is the dual ism of real world assets. And you touch on this topic of birth and rebirth of real world assets or Rwa, Can you explain a little bit about what that means? ", "start": 271.03378, "end": 287.23428}, {"speaker": "1", "podcast": "Sure. I could take it. Maybe we'll let Jack. Snag the next one. Yeah. So, look, We sat down and we sought to contextualize the universe of real world assets. For the purposes of onboarding them onto crypto rails. And so we came up with two broad categorization, which together should explain the entire universe of onboard assets. So the first category is what we refer to as rebirth assets. Now these are assets that all of us on this call as well as presumably listeners will have heard of. These are your traditional asset types like equities, prime mortgages, commercial and and and residential. Public corporate loans, sovereign debt. These assets are very liquid. They're established. They've been around floating around in capital markets for a very long time. And so one part of this journey for us is to re ledger those assets and hopefully gain some efficiencies in the process. Now the problem is that those assets benefit from what we've called excellent execution. The capital market for those sorts of assets are already very tight. They're good. They work. People are comfortable with them. And so while we must re those ass. We're sort of splitting hairs, right? Those assets behave fairly efficiently. But what about the remainder of the universe of assets that can be pulled on to crypto rails? So the other sort of side of this is birth assets. And these are really assets that The underlying distributed ledger technology unlocks the very existence stuff. Right? And so the ledger itself is sort of the zero to one required to give birth to these asset types. These are asset types we expect to become bigger and bigger over the next five to ten years. And so this is your stuff like your dow to dow bonds, your agricultural, commodity, perpetual futures as well as your decentralized insurance. So to just summarize their rebirth, existing established assets being re ledger, birth, new asset classes unlocked by the underlying technology. ", "start": 289.07034, "end": 422.8304}, {"speaker": "2", "podcast": "To add on that, Right? So when we think about real world assets, when you think about assets, there's, like two aspects of what makes an asset and asset. There is the representation of an asset, right, which determines so in economics. There is a tab called arrow arrow security, which is defined as, you know, a security we'll security an asset, well, it determines the payout. Given certain state of affairs. For example, what is a debt? Well, a debt. Let's say, I bore you a hundred bucks from you, Justin, Well, the state of affairs is in the next six months, I'm going to return you back a hundred bucks at no plus some interest rate. So that's the representation of it. But there's also the ownership of it, right, which is who owns what at what time and what quotient. And this ownership and representation? Both sides have to sit on a ledger. So what T said about when it comes to birth at rebirth, that handset the underlying ledger. Rebirth, right, existing Mb mortgage backed securities. State at the moment, they sit at either a hundred page legal documents sit at some banks, base spaces, or some web to fintech date spaces. And for both assets, that's really interesting. You know, they they likes to hash power backed modes or crypto minus. They are fairly crypto because these crypto minus soon as they use efficiency to mind cryptocurrency, that hash power is sold and then this process this flow of funds, this transfer of value is happening in digital digital native way. Right? And then the next question becomes, right? We have representation. We have ownership? Then how do we actually represent the on a blockchain? Or even should we ", "start": 423.80115, "end": 546.96344}, {"speaker": "0", "podcast": "put some of that on the blockchain? Yeah. And I guess that kinda leads into, you know, what are some of the hurdles and I think in the paper you also addressed the issue of standards or the lack of standards, I guess. Why do you feel like that's important and, I guess, in kind of addressing the problem there? Yeah. So there's really two... ", "start": 547.4155, "end": 567.98505}, {"speaker": "2", "podcast": "Ways to tackle this observation we have. The first one is, is there a problem for... You know, when it comes to standard for real world assets? N number two why is this proper important. So I'm gonna tackle the important question first. I studied I had a philosophy in academic training, so very often in, like, economic philosophy. When you go into a topic, You start with why is it important? And then you go into the actual subset of it? Why is the standard important? If we look at financial innovations history standards, reduces transaction cost. You know, rise of English language is a literal ling f used around the world that facilitated global trade. Jpeg, Pdf, M p three, These are Internet native standards and a makes transfer of content or even value, so easy on the internet. And similarly, in the financial world, there is sec prioritization centered, right, which was probably invented sixty seventies onwards right? Surely definitely before it is with. That's the invention of jump board with of Nokia. And sec secured that was sec standardization did was basically a re transform how credit or loans is done. Right? So investors... So basically, the on underlying loans, so T j used to work used to trade mortgage backed securities. And behind these mortgage backed securities, are packaged and bundled loans to homeowners Right? They borrow if they take a loan to borrow a house, to borrow money to buy a house. And these are packaged up to diversify and to basically scale up. The the underlying risk and underlying collateral since we. And sec characterization was it was cool because it took these liquid assets. Right? If I take out a mortgage to buy a apartment New york That's just me myself. And it's fairly... It's not scalable to get financing one by one. Right? But what if there's a way that a hundred of these loans a package together, and they follow the same way when it comes to legal standard, but it comes to financial standard, when it comes to their way risk is understood and the data input. Right? So you can patch them up and larger institutional investors. The pension funds and the mutual funds. They can invest it and they can have exposure up to this asset class. And that consolidated multi how value flows and how finances is done in the modern world. The problem is, that, you know, in sec standardization that is a standard called the C Ips. Right? It's like, a literal digit, define tape, this is a mortgage backed security in the Us this state with this type of property. When it comes to other assets it's actually not not that clear. You know, When it comes to emerging market and consumer credit. That is a body adult trouble percentage. When it comes to renewable index, which is why building again, this asset class. Again, there's no interval standard. So in tri, there's a problem standard. And similarly, in cr, you know, in the the rural asset adoption. Right now, that there's also a problem with standards. And without standards, then when it comes to token patronizing real assets, there's no clue for protocols, for investors and for asset owners or borrowers to have consensus. How do we define the state of affairs? How would do we define the payoff? And so that is the problem that we think real world asset faces. And obviously, there are more specific examples that will cover They take this podcast out as well. Yeah. T do you have anything else to add on that? Yeah. I, I think it's just a ", "start": 568.79803, "end": 825.4764}, {"speaker": "1", "podcast": "serviceable analogy for anyone listening would be sort of what happened in the in the early days of of the Internet. Right? So At the beginning, the giant's, Ibm and xerox, they both vowed to have their proprietary standards for transmission and Internet protocols, be sort of the market standard. Right? They had an interest in ensuring that everyone interacting on Internet rails had to pay them rent. But what ended up happening was that the Internet standard, Tcp ip was not commercial, right? It was a thin standard. It was sort of a public good that allowed for all that activity built on top of the Internet to really explode and and be unlocked. Now sort of as Jack alluded to, we're missing this in on chain Rwa land, right? And one of the key sort of shortcomings in all the protocols that are seeking to drive liquidity to these assets is they're having trouble figuring out this issue of secondary market liquidity. If you justin are a huge hedge fund. And you go to one of these protocols and you're like, look, I like your assets like the protocol, I'm comfortable with the smart contract risk. I'm a put fifty million dollars in. But you protocol have to guarantee me Justin if I wanna get out of this position, you can honor. There'll be someone on the other side of that trade. And for the most part, the protocols can't really guarantee that secondary market liquidity today. Right? It doesn't exist. It's the achilles heel of the whole industry. And what we think is what's gonna end up happening is these common standards across the various protocols for things like permission, for things like legal, for things like liquidity. Right? And that allows for the protocols to speak to one another and be one another secondary market liquidity, which really unlocks growth for the entire industry. So our problem statement is really lack of a real world asset standard to the extent that we can agree on that standard a set of policies and procedures that everyone follows. ", "start": 826.806, "end": 952.5004}, {"speaker": "0", "podcast": "We think growth will be explosive from there. So when you say standard, you, when I think the standards in the blockchain space, I think E twenty E seven twenty one, eleven fifty five and, like, even I guess, more recently four six two six. So are you thinking that there should be an E token standard specifically for real world assets. Is that what you're saying? So that's a great question. And ", "start": 953.15247, "end": 977.02997}, {"speaker": "2", "podcast": "we actually cover that in the third section of the primary solution. So we figured this so we have a mapping of the real low asset stack. Right the diagram. And maybe we can pull it up as well. But on the left, there is the representation and ownership. And that's more at the standard level that we're talking about. And then there's the infrastructure and asset specialist that will cover throughout this podcast forecast. Going back to the standards for representation and ownership of assets. So because I personally both in the space, and our mission so ability f, the echo and our mission is to help, renewable developments, assess financing. And and doing so, I face this problem, which is we have some rural asset. We know that we want to token a low token a debt. And I need to pick a way to represent it on chain. Right? To write some code and to figure out to what extent can I automate some financial work workflow around it? And so I looked at a bunch of token standards, that Are listed in the primary as well. And so there's El twenty that is N t's there is E thirty six forty three and the different standards, more in the security token standard. So I think realistically, we're not in a position to push for any standards and it's fairly difficult to do so because you know, I come from a... So sort of I wasn't the position to pick a standard it. So I understand the criteria and it comes to in second. It's ultimately fulfilling three meats. The technical need, which is how easy how compost... How manageable the code is, the legal need, which is... Does a... For example, does it limit transfer? Does it a fail certain Us or non Us regulation of the underlying asset. And there's the business need, which is... Does say makes sense on a financial workflow perspective when it comes to the lower funds or chain or when it comes to the even the whole underwriting process is so. So in short, basically, I think the twenty, something like the twenty can be a stand for real asset, but there will be a lot of attempts to sort of customize and use other standards but obviously, the trade off is you sacrifice comp on top of it. But things like forty six twenty six is really interesting. Because it... It's the best of both votes. You have a vote, and then you can issue tokens that represent a share of this vote So I personally followed quite personally to ", "start": 977.55, "end": 1153.9021}, {"speaker": "0", "podcast": "the adoption of forty six twenty six real assets. That's really, really interesting. And, I'm also falling very closely the adopt of E four six two six. I think it's it's it's a very interesting standard and yeah we just need more and more protocols to adopt it in order to gain that comp compatibility that you were talking about. And also you, you touched on section three in in section three of this primer, you talk about what you call the protocol wars and similar to what t was saying earlier, you know, when you're looking at Web one, you have, like Ibm and Xerox for fighting over their standards, but ultimately Tcp Ip, one, and now we're kinda of looking at Web three and I wanna know, like, what do you mean in the sense of protocol wars and how do you exactly expect these wars ", "start": 1154.3593, "end": 1201.8766}, {"speaker": "1", "podcast": "to be fought? Yes. So I think we think about the protocol wars as essentially being fought at sort of two different plans. One is sort of at the infrastructure layer. Which if folks are looking at, the primer is sort of our inner circle. The yellow circle of the builders of the rails upon which assets run. So these are things like, you know, your Oracle network These are things like your stable coins, whether it's maker or circle or anyone else, as well as sort of your token synchronization platforms like center fu fusion on. And so even at this level, you're seeing protocols like cent, and protocols like On look to really token assets, which means ingest certain assets into their protocol and I a token with some combination of representation of that asset and ownership of that asset. The other sort of playing upon which we see the protocol wars playing out, arguably more vicious is on the asset specialist side. So these are really the protocols that are seeking to build out marketplaces for the connection of assets and d defy liquidity. So this is sort of your cent, your gold finish as well as your maple Clear pool, T f, on, etcetera. Right? These guys wanna build a two sided marketplace where an origin who sits in the real world, who has some deal flow does some underwriting does some servicing inject his or her assets into Defy and then there's so one on the other side to fund those assets. Right? And they create that network effect. Well, all these protocols wanna create that network effect. Right? And by virtue of wanting to be a first mover and really own that liquidity as really any software company that is seeking to build a network we'll want to do. We see an opportunity for there to be more collaboration around a standard than there is now. Competition is simultaneously very expected. And it sort of acts as a ham to the growth of the whole industry here. ", "start": 1202.3309, "end": 1336.2947}, {"speaker": "2", "podcast": "Just to add on that. So I personally find a little where protocol war very interesting, Particularly, it's more the regulatory tech layer. So in short, basically, we classify regulatory technology which is, you know, and and enables permission of the participation and this real asset and creating network. We'll classify that, the infrastructure list because if you think about it it's like a horizontal software. Horizontal male. And from a protocol perspective, again, I'm putting my hat as a as a builder. I face the permanent question, which is when it comes to real assets, let's face it, most assets cell securities. It's fairly difficult to to avoid falling under that classification. And when it comes to securities regulation, in the Us. And non Us, there are certain parameters. There are certain commissioning that is required. The most simple permission standard is a simple Ky Am or to be able to tell that who your counterpart party or with a where wallet address from, and let's say you block it out Us investors. Right? And at the moment, the Ux is free bad where, you know, if you go through Ky with Golfing, for example, to invest in emerging market credit, you and you want to invest in cent as well. You have to do the K twice. Cent juices, sec, go users, a Web to solution provider. What if there's a way for them to communicate with each other, Right? That cent can it can it be able to say, hey, your user welcome to our platform, we check that you've already done Q with Go. And we're able to pull that data from Go or some other third third party solution provider and we're to say, I'm gonna save you ten minutes to go to Ky and immediately let at the front end showed you the results. You know, either you blocked or either you're not blocked and improve reach assets our platform. So I think something similar is happening in renewable assets with the cycle ver standard, which I'm personally very excited about. So ver is going to launch a proof of concept with one of the real asset protocol that we mentioned in the p, I'm not sure if that news is public yet. So oh, actually, it is is public. So circle is doing with T find doubt. Of which they rebranded into Ash block, and they will be using the Ver standard, which makes it easy for So existing circle users that have done the Ky with circle or corporate account to use T five platform to either be a borrower, or to be a lender. I'm personally looking into that. Standard and we are on the track to do another Poc as well, and hopefully pushing that forefront and making it a lot easier for institutions to come to d defy for real world assets. ", "start": 1337.329, "end": 1535.8578}, {"speaker": "0", "podcast": "Yeah. This is interesting because I think when a lot of people in the Def defy space, think about protocol wars, I think they think more about, you know, the curve wars or the q wars and it really, like wars that are focusing on the allocation of liquidity and not necessarily wars related to, I guess, procedural processes of k c ky b or or middle wear adoption. So I I think that's I think that's really interesting. ", "start": 1536.416, "end": 1565.55}, {"speaker": "2", "podcast": "I mean, I'm going to throw a home here. I personally think of wars is like a bigger eye. In encrypted history. So... Listen as feel free to argue with me on on on Twitter. But going back to you... I think the reason why crypto has mentality or has affinity for narrative, curve walls is because crypto many assets, they have similar asset return profile, very high volatility, high risk, high return. But when it comes to real world, there's a whole spectrum of assets. Right? From treasury build which we're are supposed to be risk free. All the way to the bottom to, like, emerging markets jump or even even, like, high risk, high return asset classes. And so the protocol walls, so to speak, is, like, from a investor point of view, like I've got capital These asset classes are not really mutually exclusive. Right? Because one of the biggest tenants in modern finance is diversify your portfolio. It doesn't matter what return profile the asset is. There's always a place somewhere and someone else's portfolio that this asset is the optimal asset to add and their portfolio. Right? And so I think that's why the asset specialist per, we see less of the dynamic that we'll see when it comes to curve wars when it comes to protocols, e protocols, fighting for liquidity. Because very often, you know, investors that want low risk assets. They are seeking treasury like yield and asset profile. They are probably not the investor profile that go or cent. Looking for anywhere. And so it's pretty much like a customer segmentation mental model that we're heading at here. ", "start": 1567.2301, "end": 1688.308}, {"speaker": "0", "podcast": "Yeah. Very interesting. If there's two things we like on this podcast, it's hot takes and alpha. Jack, I think that you've given both of those in the past five minutes. So I appreciate that. But let's let's continue on and let's focus a little bit about adoption. And, you know, we've heard the phrase software is eating the world and I forget who who said that quote. But is the same thing happening with decentralized finance is decentralized finance going to eat traditional finance ", "start": 1689.0221, "end": 1721.0114}, {"speaker": "1", "podcast": "And just how do we How do we focus on that adoption? This is this is a good this is a good jack section? I'll let him take it. Yeah. Sure. So ", "start": 1721.3839, "end": 1729.5308}, {"speaker": "2", "podcast": "I am a sucker for history. And when I want to predict how the future looks, I want to go back at the past. The comparable history that I think b Should love from is well the most obvious one is how traditional finance evolved. And the financial innovations and history and the cycle of bubbles. But on the other hand, because when it comes to real world asset, We're kind assuming, like, it's Blockchain nor crypto. Very smaller like, okay. We're using Blockchain, streamline, some of the financing workflow. And the intuitive comparable that jumped to me is enterprise software, And one of the largest innovation in in Enterprise software is adoption of a cloud and truth this. The cloud has been talking, you know, for the past decade, we've been twenty years. And it's still happening. There's still a debate about server less architecture versus on prem computing, both at the technical level and the financial cost and the economics of it. And so if we can apply that to and start to predict how D will eat traditional finance, Then probably, try find d file will live together and will coexist similar to how in the real world. Right now in software. Cloud, computing, and on prem computing kinda coexist exists, and it's There's no play cut. There's no but proponents of either side was say, hey, you know, cloud computing is the world, but then someone will show the economics and the cost of it and be, like, well, in the long run. It's like it's not necessarily that cheap. And so I think that's how we view about this. But we have specific predictions that were laid out in the primer and a fast one very Thingy is what T j proposed. D five eats won't tail assets first. T. Do you wanna expand on that? Yeah. So this idea of ", "start": 1731.1952, "end": 1857.5494}, {"speaker": "1", "podcast": "running two systems in parallel, server and server less architecture is a great analogy for our rebirth assets. Right? For traditional assets for traditional managers. They're gonna do the vast majority of their business. Through traditional avenues for the foreseeable future. It's what they know it works, but they're gonna start to dabble with acquiring assets, via crypto protocols with funding their own assets that currently sit on their books via crypto protocols slowly, but surely. So they're gonna pay fees for two systems. But we really think where crypto will make the biggest dent out of the gate is in a long tail of us So this is the underserved sectors of the economy broadly, whether jurisdiction, asset class, borrower type, etcetera. These groups are far more likely to benefit from plugging into crypto than their traditional counterparts. They have far far far more to gain. Right? And by virtue of that, we expect to see the progress in the short and medium term be disproportionately skewed towards that long tail. ", "start": 1858.1631, "end": 1933.7347}, {"speaker": "2", "podcast": "And T j, you have this very nice two times two matrix. B I leads a long tail speculated. Develop first. What does that metrics mean and what wants you to make that matrix? ", "start": 1934.545, "end": 1948.3422}, {"speaker": "1", "podcast": "We think about what sort of the long tail looks like. It can be along two dimensions. So an x and a y axis. One dimension is gonna kind be geographical, right? So we have the g seven world developed, and then we have the rest of the world, which is emerging. Right? And presumably for most asset classes, all else equal, if they are dom in an economy or in a jurisdiction like the Us, they're gonna be much safer than if they're dom in a jurisdiction like Uganda. Right? So that's I'll say our our y axis. On the X axis, we also have... We're going from emerging asset classes, to established asset classes. From risky asset classes to fairly safe asset classes. So on the x access in the far right, we'd have the safest asset classes such as Us government securities. On the far left in emerging asset classes we'd have something like you know, lending against a coffee farm in Indonesia. Right? And so in general, we're gonna find ourselves with crypto making the greatest impact today, tomorrow the next day. At this combination, this x y combo of emerging jurisdiction, emerging asset class. And it's gonna take much longer for crypto to attack and make a dent on the exact opposite x y, which to say very established jurisdiction, very established low risk asset class. ", "start": 1948.9136, "end": 2038.3116}, {"speaker": "0", "podcast": "I think something Notes all you all on touched on in terms of adoption is, like, unless D defy is ten x better or more efficient than traditional finance. These institutions or, I guess, money managers are gonna remain hesitant. On that. ", "start": 2039.5973, "end": 2056.6753}, {"speaker": "2", "podcast": "So I don't know I was wondering if you could if you could touch on that a little bit as well. Yeah. So we have a actually did in the last section. In the dialect, we have a cost cut so happy to sort of mention in detail when it come to that section? Yeah. Sure. But it short, basically, the idea is special calls, you know, similar to I'm using a iphone and you wanna convince me to use a sensor. Well, I've got everything set up on my iphone on my icloud, the photos and imessage, you know, ten better that what I'm using, if that's just marginally better, have a better camera, maybe twenty percent longer battery life, I wouldn't ace. ", "start": 2058.422, "end": 2097.6626}, {"speaker": "0", "podcast": "That's the intuition. Okay. Let's let's talk about, like the capital, you know, in the in the terms of demand for asset managers. That's something I'll touched on in the primary as well. Can you can you touch on that a little bit? Yeah. So this is part of the connection that I making take was the previous Et ", "start": 2098.5415, "end": 2115.06}, {"speaker": "2", "podcast": "predicted that adoption, which is origin, like assets from long tail is gonna be originated first. That's more a supply side. Right? At how we look at the demand side. There are two types of demand that we predict that will predict will come from, demand from asset managers, traditional finance, institutions. So, you know, the European investment bank, which is the investment norm of the European union twenty nineteen, twenty twenty issue first initial bond or ethereum of public. K here arm h? Token one of the healthcare care funds on off lunch and using sec ties as like, a permission layout on top of it. And so I think this shows that there's a class of traditional asset managers that are critical curious And given the right opportunity, they will use Blockchain rails to do investing and to supply capital. Or best place to become a demand. And I think this is really important because verbal asset adoption is facing a value of death moment right now. For the past few years, no real asset can rely on retail liquidity because of the market. Now in a bear market cycle there has to be, like core of value proposition. That these real world adoption can deliver. And this is where institutional adoption is really key at this moment, when we think that if given the right approach, given the right sort of starting point, they're give the right investment opportunity. Asset managers will allocate some capital and you spoke change to ss real assets. And, you know, conversely, on the other hand, there is demand from crypto native organizations. So make a dial, which J let the real world asset team on. It's known to be on the forefront. Of real assets effort amount of organizations. There's a lot of doubt with huge treasuries, that are the den denominator eve or stable recordings. It's gonna take a while, but I think it's inevitable that they will want to manage the treasury and make some un yield and by un I mean are completely correlated from, like, macro. Not even crypto macro but like, Us equities, or like global macro. And and that will be like, recession proof sector, by such as energy utilities, renewables, awesome tax defense. And you know, meg it out is already doing this. Make out is working with back finance, G bring board some token Us treasuries and holding it on the balance sheet. And so we think these two are the types of predictions we make on the demand side. Okay. Yes. So that's the demand side, but what about the supply side? We think what the supply side as actually much ", "start": 2115.695, "end": 2307.0715}, {"speaker": "1", "podcast": "more trivial, simpler. To get done in terms of rwa adoption on chain then demand side. In general, when you think about an asset manager who originates assets or loans from the real world. You know, they're generally gonna be pretty open to securing creative new cheap solutions to finance their assets. Right? In general, they'll have some senior secured facility from a bank challenger bank, some sort of a fund. Can be fairly punitive has to be renegotiate There fees in the front end there are fees in the back end. You come to them and you say, look, we got a creative solution. If you to quickly get funded cheaply, they're gonna be open to that. Right? They're gonna be more open to that than someone who's on the other side investing in their assets. I. E. The buy side what Jack just explained. And so we think what's gonna happen here is when you think about the sort of traditional asset manager with a big book assets, let's say, fifty billion dollars in assets. You know, for the vast majority of those assets, they're going to use traditional financing avenues. To finance those assets. So if you have corporate loans or mortgages, you're gonna sell them into sec. Execution. So ninety percent of your book is gonna stay there for the near term. But there's ten percent which is, you know, your allocation to risk your assets that are harder to get. The the the deal flow is much more sort of status and relationship based. You don't really have access to the right assets or at least not at the right scale. For that ten percent, you're gonna be a little bit more willing to an experiment. So we think, you know, for that five billion or whatever it is of your fifty billion dollar balance sheet. You're gonna look to D defy. You're gonna... It's gonna take time for you to get comfortable, but you're gonna look to the extent these protocols have, like, books of assets for you to pour through. You're at least gonna consider it. That's kind of the big asset managers on the supply side. We also think that, you know, the more nimble specialist origin, what we all fondly know of as Fintech are gonna start to explore this world dogg in twenty twenty three. We think it's gonna be key narrative. So these are groups that focus on particular asset classes, they're data driven, but their balance sheet constraint. Right? And what that means is their access traditional capital, isn't that great because they're not quite mature enough to have access to big credit funds. On the other side, they don't want keep all these assets on their book. Right? This is what we call capital and efficiency. They want the ability to get those assets off the books, so they can go originate more business maybe with existing clients maybe with new clients. Either way, they want great liquidity solutions to get these assets, all their books so they can grow their business. So what we think is gonna happen in twenty twenty three with these syntax is, you know, some of them are gonna look to external protocols like your cent, your gold finishes, etcetera, etcetera, to sell assets into. But the problem with that is these protocols ultimately they give up. Control. These fintech they give up control of the liquidity piece of the value pipeline that their users use. So we think that's something that we've termed the inside out execution will happen frequently in twenty twenty three. So these are fintech that are inc bait proprietary liquidity protocols that they can basically attach to their origin imagination, underwriting and servicing arms. So So in the real world, kinda it's the d defy mu, right? In the real world, they're originating underwriting and servicing these loans. And then they have their sort of liquidity protocol on Ethereum that they sell these loans into, package them up and then distribute them out to investors. Sort of programmatic. So it's the sort of nice vertical integration that we expect to see, especially in the more nimble fintech going into twenty twenty three. ", "start": 2307.685, "end": 2546.6873}, {"speaker": "2", "podcast": "Cj dj what's your hottest protection of this, which... ", "start": 2547.3406, "end": 2550.7007}, {"speaker": "1", "podcast": "Are they come piece... That's gonna do this? Yeah. I mean, I guess, Justin did say that we want alpha and hot takes, so we'll give it a whirl. Yeah. So in the in the primer, laid out a prediction that the freight forward and sort of supply chain logistics mastermind at Flex port is going to spin out a proprietary protocol that basically enhances their financing room and allows them to sec their assets which range from invoice financing to supply chain finance to a variety of others of trade finance assets that their core user base would benefit from. They're gonna spin out this protocol such that they can, you know, access sort of new planes of liquidity that they that they don't currently. ", "start": 2551.8206, "end": 2599.5073}, {"speaker": "0", "podcast": "Oh, that's okay. That's really interesting. So I guess, you know, we've we've talked about the demand and the supply side of this. I just wanna talk about, like, what what types of assets do you see being originated and maybe like the motivation for T to actually participate in these d defy rails. I feel like we touched on that a little bit, but I... Kinda I wanna dig in a little bit more on those two. Yeah. So we visualize ", "start": 2600.0002, "end": 2626.6863}, {"speaker": "2", "podcast": "different types of real world assets with a stack where with like a with tier. So this is both we recall in environment tense movement, which is quote from the Christopher nolan movie, tenant, which military times especially flank the weights, and I think that's what's happened. So From top to bottom, That's all is high quality asset tier, such as treasury bills, money marketing funds. At the bottom is emerging markets consumer credit. And across this tier, we see different companies trying to tackle different assets. Mega mcdowell is looking to onboard treasury bills on its balance sheet there are plenty of companies and protocols trying to bring real estate or mortgages to the Blockchain. There are companies that do emerging markets consumer credit. And trade, finance assets and bring them to the blockchain. And I think we think that we asset adoption gonna be all of the above is gonna happen. And it's gonna be at the bottom up and top down and then squeeze in And this interesting dynamic care, which in my opinion because at the top, for the asset treasury builds you... It's very difficult to convince traditional financing institutions that already hold treasury rebuild go through levels. They have existing relationships, like thirty years, forty years, you know, broker dealers, etcetera. And so bringing new money into the blockchain rails via the high quality asset, it's gonna be part. Conversely, if you're looking at bottom. Trade finance assets, Merger Markets, consumer credit. I think now we're facing this value of death moment. Right, which is that it's also hard to bring institutional investors through the function rail. For with these type of assets because the universe of investors with this type of mandate or this type of appetite, is already fairly small in institutional finance as well. And so simply from a sales business development at, you know, again, from a enterprise software perspective, this kind of enterprise sucks. Right? The sales cycle will be quite long, and it's more difficult to bring on board institutional investors. And so probably the sweet spot will be somewhere in the middle about, you know, what is that sweet spot? Nobody knows. My personal bet is what I'm building. So we're... So we're bringing renewable decks as an Asset class. And renewable debt is interesting because it's inflation proof. It's a sa that in recession, investors will rotate in, So it's a Asset class that appeals to both criminal investments and traditional finance, institutional investor. But, you know, I'm biased. I'm pumping my bags. That's one of the whole takes. ", "start": 2627.4753, "end": 2821.1748}, {"speaker": "0", "podcast": "I like that. I like that hot take. And it looks like we we've got just a little bit of time left, So I wanna make sure we we touch on everything here. What does the current landscape look like? In terms of the Rwa product space? And kinda of what where do you see it evolving maybe like in the intermediate term? Sure. ", "start": 2822.765, "end": 2842.5374}, {"speaker": "1", "podcast": "So as we touched on briefly, in our landscape, we broke down the various ecosystem participants into one of two species. One are infrastructure list, those laying the rails upon which asset specialists run and their assets run. And the other are the asset specialists. These are groups that are focusing their efforts around a particular asset type, a particular jurisdiction, really more on the nitty gritty liquidity side, rather than the picks and shovel set. So for example, in the middle, we have our Oracle or layer ones or liquidity pools, our token factorization protocols as well as our our regulatory or reg tech. Then in the outside, what we really have is all of the various asset classes such as trade finance, synthetic, real estate, physical infrastructure, revenue based finance, etcetera, etcetera, as well as a particular gearing towards certain markets like emerging markets. So the second part of your question, where does this go from here? And we expect to see, you know, fairly dogg competition in kind of all of these categories. I think for the first time yet We sort of have confirmation. Now, there's enough people building. There's enough focus. There's enough money. You know we've boarded enough Tv for people to recognize that this isn't a flash in the pan. And I think over the next six months, you'll see all kinds of builders come out of the wood work, building in both of these categories. So we expect this to be, you know, particularly fiery growth, especially given the fact that the sort of circular reflex speculative games of D defy have for for the for the midterm, you know, kind of soured a bit. People are looking elsewhere and they're saying, well, if this bear market continues, we don't know how long it'll go. If it does though, how do we continue to bring re yields at the system? And the answer is you wanna lend on activities that create wealth. You wanna lend against productive processes, where there's some technological process at play that creates new wealth, and that means learning to real world businesses that are doing things like creating, you know, widgets in a factory or transforming a piece of land into a photo tae farm, something that creates value for the world. So we expect this to be the very, very, very beginning of the secular trends and we're kinda excited to see what sort of ingenuity is on the cusp. Six close of that valor cruise on the two inch. So it's another boat statement halt that I have, which it's ", "start": 2843.3477, "end": 3012.2808}, {"speaker": "2", "podcast": "all of the middle and just mentioned in a dialect, the last section. The second last section on the primer. Well I think that the business model, the sort of avoid investors that if you're listening, here is your chance to hear me out, and this is Your chance to develop a investment thesis on the space, which is that value cruise on the two ends on the spectrum. On the process of railway assets. Origin recognition and liquidity slash distribution and everything in the middle of the middle, so organization custody, clearance slash sat or vest stack is going to be fungi. It's gonna be commodity. And I do I do realize there are contact for that such as you your regulatory recapture, regulatory requirements, things like that. But it's a hot take. So bear with us, maybe gone maybe between us. ", "start": 3012.593, "end": 3067.8125}, {"speaker": "0", "podcast": "Yeah. In before we close out, I've just got like a couple more questions for y'all. But to the both of y'all, what, you know, further readers of this primer, what is the one thing you want the readers to take away after they've read this primer. Each will start with you on this one. Yeah. I'm gonna think it would say it's ", "start": 3069.1692, "end": 3089.7146}, {"speaker": "1", "podcast": "two sides of the same coin. A, you know, to sort of get red pill on why it's important to token and what token punctuation is not. Right? A lot of token thus far has focused on representing assets and has largely ignored the ownership aspect. And I think on the other side is just at the same time that we've red pill readers on being real about what the benefits token are and what the shortcomings are. To recognize that in the long run, we do expect these these assets to come on chain and for it to be significantly more efficient and more trans and in the end, it will drive cheaper cost of capital for more borrowers businesses around the world. If we haven't succeeded, in driving towards that better product for cheaper, than I would say we've largely failed as an industry, but I expect given the entrepreneurial spirit the general general secular trends that we will get there, will just take some time. Hey, Jack what about you? In short, one statement is token organization is hard. ", "start": 3091.3655, "end": 3159.4187}, {"speaker": "2", "podcast": "And it takes many layers of nuances and hopefully reading the primer can inspire will people to think about what to bone and went to bone and go for ", "start": 3160.2295, "end": 3175.6404}, {"speaker": "0", "podcast": "Yeah. Well, I wanna thank y'all for coming on to the poly alpha podcast. I thought the primer was a great read, a slow read for me because there's just so much content. It's it's very dense, but that's that's good in d defy. We need more we need more primer like this. And I thought the name was also really great. An unreal primer on real world assets. But before we sign off here, where can people go to find out more about the two of you and where can they find this primer other than the show notes, which they will be in the show notes? ", "start": 3177.548, "end": 3215.4631}, {"speaker": "1", "podcast": "You can find my rants and rambling on my Twitter at le, l e m p h e t e r, If you're someone who likes a little bit more long form and more substance more rigor perhaps, you can find my slightly more coherent rambling on the maker forum. The unreal primer is featured on both my Twitter as well as Jack's. I think I even posted in the maker forum. And really, I think anyone you hit up in real world asset, Twitter should have a link to it, including us. ", "start": 3216.3528, "end": 3248.999}, {"speaker": "2", "podcast": "And listeners can find my find me on twitter larkin as a baby techno speaking, my twitter handle is or search, jack chung dot eth. You will be able to find you and happy to discuss and argue or talk about the hot takes that's covered and today's podcast forecast. ", "start": 3249.7163, "end": 3270.8357}, {"speaker": "0", "podcast": "Just tweet of us. You heard it here first everyone. Tweet at these people. And give them your hot takes. Yeah, thanks to everyone for listening and watching. So subscribe on Youtube and subs and Spotify and apple. Subscribe to all of them. Why not? And a special thanks again to teach and Jack for coming on the show and we'll see you all next time. Thanks everyone. ", "start": 3272.3438, "end": 3298.96}], "summaries": [{"title": "1. Exploring Real World Assets on the Blockchain: A Journey from Biotech to Crypto", "summary": "In this episode of the Poly Alpha podcast, the hosts interview the authors of the real world asset primer, Jack Chung and Teach Rag. The authors discuss the concept of bringing real world assets onto the blockchain and reducing volatility in the crypto market. They highlight the need for fundamental value in cryptocurrencies and express excitement about the potential of real world assets. The authors also discuss the categorization of real world assets into rebirth assets (traditional asset types) and birth assets (new asset classes unlocked by distributed ledger technology). They also discuss the importance of representation and ownership in determining an asset's value and the use of blockchain technology for asset representation."}, {"title": "2. The Importance of Standards in Blockchain Technology and Real World Assets", "summary": "This text emphasizes the importance of standards in the blockchain industry, particularly in relation to real world assets. The lack of clear standards for certain types of assets creates challenges for tokenizing real assets and hindering the growth of the blockchain industry. The author suggests that establishing common standards for permission, legal, and liquidity is crucial for attracting large investors and unlocking growth for the entire industry. The text also discusses different token standards that can be used for representing and owning real assets on the blockchain, highlighting the need for considering technical, legal, and business needs when choosing a standard. Additionally, the text mentions the ongoing \"protocol wars\" in the cryptocurrency industry and the potential of regulatory technology in real asset protocols."}, {"title": "3. Is Decentralized Finance Going to Replace Traditional Finance? Comparing the Evolution of Traditional Finance and Enterprise Software to Predict the Future of Blockchain and Cryptocurrency", "summary": "This podcast explores the concept of decentralized finance and its potential to disrupt traditional finance. The hosts compare it to the impact of software on various industries and discuss the possibility of decentralized finance replacing traditional finance. They also discuss the significance of adoption and how it relates to focusing on a good jack section. The author draws parallels between the coexistence of cloud computing and on-prem computing in the software industry and predicts that decentralized finance will coexist with traditional finance. They also mention the impact of crypto on underserved sectors of the economy and the importance of developing a two times two matrix to understand asset classes."}, {"title": "4. Exploring the Adoption of Real World Assets on the Blockchain: The Current Landscape and Future Evolution", "summary": "This text discusses the potential adoption of different types of real-world assets on the blockchain, including treasury bills, trade finance assets, and consumer credit. The author suggests that renewable debt may be the most promising asset for adoption on the blockchain. The text also discusses the breakdown of participants in the financial ecosystem into infrastructure providers and asset specialists, and predicts increased competition in both categories. It highlights the shift towards lending on activities that create real-world wealth as a response to the bear market in decentralized finance. The text also discusses the potential adoption of blockchain technology by traditional finance institutions and crypto native organizations, as well as the potential for increased adoption of decentralized finance by asset managers and fintech companies. It mentions Flexport's development of a proprietary protocol to improve their financing capabilities and provide enhanced trade finance assets."}, {"title": "5. The Business Model for Value Cruise on Railway Assets: Tokenization and Challenges", "summary": "This text discusses the value cruise business model for railway assets and encourages investors to consider it. The author highlights the importance of origin recognition, liquidity, distribution, organization custody, clearance, and regulatory requirements in this model. They acknowledge potential challenges but present it as a hot take and invite readers to explore the possibilities. The text also mentions the importance of tokenization in representing assets and the need to consider ownership. It emphasizes the potential for tokenization to make financial processes more efficient and drive down costs for borrowers worldwide. The author provides links to their Twitter and the maker forum where they share their thoughts and provide more information on the topic. They also provide information on how to engage with the podcaster, Jack Chung, on Twitter."}]}