{"podcast": {"title": "Polygon Alpha Podcast", "host": "Justin Havens", "image": ""}, "episode": {"title": "The DeFi UI/UX Wallet Revolution | Giddy | Eric Parker & Ethan Parker | Polygon Alpha Podcast", "number": "20", "date": "OCT 24, 2022", "description": "", "url": "https://www.youtube.com/watch?v=15xrqqAnGMY", "speakers": {"0": "Justin Havens", "1": "Alexander Guy"}, "file": "october24.mp3"}, "transcripts": [{"speaker": "0", "podcast": "Hello everyone, welcome to the Poly gon alpha podcast. Where the poly gon community gathers insights from today's leaders into decentralized finance, Web three and Crypto. I'm your host, Justin Havens, aka crypto. Let's get started. On today's episode of Poly gon alpha, we are joined by Ethan and Eric Parker, c founders of Gi, the Webb three wallet. Thanks for being here on the show with us today, guys. How's everything going? Good. Good. Good. Thanks for having us. Yeah. Absolutely. Happy the yell are here. And worry are all based exactly what the name like Gi up? Well, my shirt says Gi, but the the name of the company is Gi, but we're in Utah. Oh, awesome. Yeah. Well, I'm in Texas, so this is, you know, of course, you would be on Crypto Podcast with the name like Gi? ", "start": 0, "end": 49.164772}, {"speaker": "1", "podcast": "It's it's exactly appropriate. ", "start": 49.80259, "end": 51.397137}, {"speaker": "0", "podcast": "So what is Y'all background? Like, how did the two of y'all your brothers, obviously. How did all get into crypto? ", "start": 51.955227, "end": 58.276653}, {"speaker": "2", "podcast": "Yeah. Yeah. So my career kinda started off in product design. I was studying industrial design as at Arizona state. And then I switched to a very related major accounting. And then I decided... As soon as I graduated that it was time to learn computer science and mobile apps. So that's kind of my head college education anyway. And then I I worked at a company called Outlet. They did baby heart rate and oxygen, monitoring while they sleep, company went public last year it a really fun job. And then along the way of started and sold a couple of kind of small bootstrap consumer products. And then the latest one was a app for money dot com kind of a more B2b b Saas deal. And then but as far as crypto goes, you know, it's like... I think two thousand twelve when we were roommates in college, Eric had this little minor thing that, like, Usb stick hooked up to his computer computers. Was like, what the heck is that? Then in twenty seventeen, it I got to the point where, you know, I was I was string together thirty Gpus and mining ethereum and stuff like that. So that's kind of like my intro to Crypto. Yeah. Background I guess, too. Yeah. Yeah. ", "start": 58.916008, "end": 120.66945}, {"speaker": "1", "podcast": "So I I did computer science in in school. I've been an ios developer for for most of my career. My last job was at Walmart doing their e commerce app. So funny I was there when we had the the big Ps five event. So like historic levels of single minute traffic on on the mobile apps It's kind of a crazy thing. But, yeah. So I got into crypto like he said, I started mining Bitcoin like back in twenty twelve, and only really did it because I like building computers. I thought it was pretty fun to to get into this new interesting thing where it's worth a little something. And What What I mean by that is I was one of these people who lost hard drives that had my private keys on them. And it didn't really hit me until, you know, obviously later, like when they bitcoin at like thirty five dollars. I'm just, like, son of all, I can't believe this. So gotta do it again, you know, my ethereum around twenty sixteen or so, and then again, in around twenty nineteen, twenty twenty, bill more built more miners and more computers. And that that's when I kind of really got into the defy. Being a software myself, I realize like, holy crap, you can write applications and deploy deploy them on the blockchain. Like, this is crazy. So it's like earth shattering stuff. So I a little bit late to the game in terms of, like, writing my own D code. I know, you know, it obviously came out with with Ethereum and some a little bit before that. But Yeah. That's that's kind of like what really hooks me was getting... Going from mining just a ethereum to starting to write some of my own applications on the ethereum network on finance smart chain. And yeah. So it it went from kind of a hobby building computers to just a complete obsession, like, not sleeping. Dicks just because I needed to get on these coin launches and stuff like that. So yep, background and software and just obviously hugely obsessed with D which kinda let us here. That's awesome. That's that's a great story. So no luck in finding those old hard drives with bitcoin on them. Oh, no way. No way they're super gone. We I was a newly married college student at the time. And I would just literally toss them out as we moved. And, yeah, there's absolutely no hope. And then honestly, there's there wasn't that many bitcoins on them, like enough to care about. But It is what it is. Can't you can't think about that stuff too much. Yeah. I think everybody has a story of of losing, you know, several bitcoin or whatever it is. Yeah. That's that's true. That's true. And so both the yellow developers or no? Like, can both you'll write code and solidity? I... So I I have a lot more experience in that I've I've done professional software development more recently than done ethan has, but both of us did Ios at development though in our careers. Oh, that's really that's really exciting. And that kinda ", "start": 121.54175, "end": 280.155}, {"speaker": "0", "podcast": "leads us into, you know, this app that y'all have been building this Web three app, Gi, not gi up, but gi. And so what is app get the app, I like that one too. The answer, what what is Gi which shows Tl ", "start": 280.5476, "end": 293.85535}, {"speaker": "1", "podcast": "on the app? Yeah. There's a couple ways looking at it. It's crypto for Grandma. It's retail D defy. It's blockchain for the masses. We are trying to solve the problem of usability in D defy. That gets broken down into a couple of things. There's security. There's ease of use. There's price to play. There's a lot of things that go on in defy land that are just. Very difficult for most people to do. And so so, yeah, the app the app building is really a one stop shop. It's a native mobile app where you you can manage your private key. It says a non custodial recoverable private key. You can manage your fiat natively in the app you can connect up to your bank account, go back and forth, and you can manage all of your positions. Your swaps and stakes and track their price all in a in a native mobile app. So really the goal is to bring more people into D defy who otherwise couldn't access it because it was just too difficult and and doing that with technology, building our own app, building our own infrastructure and code and obviously, we're, know standing on the shoulders of giants here. There's a lot of work that went on went into this before us. But the way that we're tackling this is by innovating building new systems, building up all of this infrastructure so that we can actually support the user experience that we're looking to do. Yeah. And I actually have the Gi app. I've downloaded it the beta version, I guess, and I've got my ", "start": 294.22916, "end": 378.22797}, {"speaker": "0", "podcast": "I got my free gi coin because of... Yes much obliged. So... But where does the name come from Gi? Yeah. Good question. So ", "start": 378.6009, "end": 388.87943}, {"speaker": "2", "podcast": "for anyone who started a company before or tried to name a product it's hard. You we went over a lot of different names, a lot of different pathways. And one thing that kept coming up is like, you know, we're from Utah, our our our whole founding team has lived here for a long time gone to college here, even if we, you know, grew up somewhere else. And so we're like, we we feel good about something that that says, hey, like, we're we're from the Southwest We're from the desert. And so as we're going through a bunch of different names in and running them past legal and everything and trying to see what, you know, what domains were available, all that kind of thing. We really liked Gi because it kind of... It's, you know, the Gi up is just a very natural consequence of being called Gi, which is very like, you know, Cowboy, Western and all that. But it's also kinda like excited and, you know, like, we're we're pretty enthusiastic people that don't take ourselves terribly seriously. So we... That part really resonated with this. ", "start": 389.4117, "end": 443.2617}, {"speaker": "1", "podcast": "Yeah, we started the naming process really thinking about how to brand it and what you can put a brand on, right? And we really wanted to like... We like to give you a lot because it conveys this notion of, like, an open frontier you know, there's there's land, you can claim, you can kind of like tame these these wild forces to make it your own. So there's there's a lot of reasons that we kind of ended up going with this one, but we really identified with the notion that you can go like you know, tame the wild frontier, which more or less is that that's been crypto over for last couple of years, especially Defy. There's been a lot of craziness that's going on. So that the the idea that you can, you know, grab some of the free yourself as kind of a... Is is one that definitely we fight with. Yeah. Like what you said there tam the wild frontier of crib so because it really is wild and there's a lot of technological hurdles that you really have to get into if you really wanna ", "start": 443.9907, "end": 503.14816}, {"speaker": "0", "podcast": "dive in deep and use D defy, but y'all are making that a lot easier with this app. And what you know, I guess, I as you are developing this app like, what do you feel like are some of the major hurdles that we're running into as an industry when it comes to web three adoption. And like you said, you're making you're making this that for grandma. Right? So... Yeah. ", "start": 503.4585, "end": 524.12573}, {"speaker": "1", "podcast": "I... So so this whole question, this whole topic is really... Is well represented by the founding story of this company, which is... So around twenty twenty twenty one or so when I really got an d really heavy. I figured it out. I was I'm writing my own tokens, I'm having these token launches. And I got lucky a couple times. Try to get some of my friends into it, you know, ethan some other people. And at the time, they're just like, I I don't know. It's too hard. I don't wanna think about it. But So I was like, alright fine. Went back to to to do my thing, and I got really lucky at on this one project just this token latch, and I'm like, dude, I just, like eighteen x to my money and he's, like, a what? How? And obviously, that pee people's interest and it's like, okay. I'm interested now. So I I I teach a couple of people how to do with the hard way and course, it's hard. Of course, we get out, we get rug on some projects. Lessons lessons hard lessons learned for sure. But around that time, I was in this... There's there's another Utah startup called Vale, which shout out to Vale. We love we love Utah startups. It's like a video messaging app for for for professionals. So I was on there talking to a bunch of people about crypto stuff in general and I was totally learning out about permanent loss, like, explaining all these different formulas and, like, how it works and how you strategize around it. And someone reached out to me and they're just like, hey, you... Sounds like you might know what you're talking about, like, can we chat for a second. Turns out this this person had lost a bunch of money and a bad migration on the finance smart. I don't know if you remember Panthers swap or not, but he he had a bunch of money stake and they they migrated away from these smart contracts and completely changed their Ui without really giving him an opportunity to go get his money out. So I had to get in there, had to go look at the Adi of their contracts, I had to call some functions, get it all out. So for, you know, for me, having that experience, I could go help him in that way. But for any regular human out there who doesn't have the time to literally become a computer scientist like a blockchain expert, you're you're toast, You're out of luck. So I helped him recover that money. It was it was just fun for me. Like, it's not like I was like, yeah. I'll do it for a whole bunch of, you know, commission. I just kind of it was just fun. So He told me, like, you know, I have a bunch of people that know that I'm doing this Thing. I have a lot of friends that are interested in getting crazy, crazy yield. And let's let's figure out a way to get it them. So I'm like, oh, sure. So this company, it actually started as Zoom conference coaching. Like, we'd get on a video call someone and teach them how to click all the buttons in Meta mask and do all the Ky stuff in Bin and like do it the hard way in every single time inevitably. We would we would hear, can you just do this for me like, this sucks? This is way too hard. Can I just give you money and you'll do it for me? And we're like, boy, okay. We're aren't we're entrepreneurial, you know, like, we both own little side projects here there. So we're, like, okay. Well let's figure this out. And so we we start talking to legal legal lawyers and kind of brainstorming and one of the early ideas we actually tried was, okay, you can you can do like a hedge fund. You can do a crypto hedge fund. Right? If you only get accredited investors, you can invest money on their behalf. And that's a way to do it legally. And then we're just like, man, yeah, like, there's an opportunity there obviously, and we gave it a shot. But it doesn't really jive... It doesn't really coincided with what I believe, like what drives me what philosophically about the power of defy in the blockchain, you have to be accredited. You basically you have to already be rich to legally be allowed to take on that much risk. Right? And in a reg exempt hedge fund. There's really only a small amount of people that can play. So we're just like, man, I I don't like this. Like philosophically, I wanna help more people And then eventually, the light bulb came on clicked just like, dude we're software guys like, let's build an app. Let's figure this out. And, you know, it's it's a little bit cliche to say, but at a it's at the time we're thinking like, dude, if we could just do what Robinhood did for stock trading. If you can do that for D defy, imagine the implications here. So so so Robin comes on the scene, everybody who was more or less millennial age, you know, back in two thousand fifteen fifteen. Yeah. Fourteen fifty fourteen fifteen How... Well, whenever whenever you could get first get the app you've never bought a stock because it's expensive. It's scary. You know... There's always trading commissions. You don't know what's gonna go up and down. There's all these options and derivatives. Like, it's this huge mess, but Robin comes on the scene and they're just like, look, download the app, put in your bank account and and just like, buy a a friend actual share of apple just let it's easy. Right? So this whole notion of you meet people where they are at a native mobile app. You take out a lot of the risk and a lot of the the confusion by making it simple educating people giving them options of spending a little bit of money. They obviously took out the the the the trading commissions. That was huge But there's so many things that Robin had did exactly right and timed it correctly and had a beautiful Ui that we're just like, if we can emulate that, there's so much power behind the blockchain behind D defy that, like, let's let's just try to capture lightning in a bottle again. So that's that's really where the inspiration and kind of the the the, you know, the passion comes from is like, there's so much opportunity out there generally speaking, D defy really is it's this chance to to capture some of the upside for yourself. Right? Like, if you're not already Uber rich, you can't take as many chances and earn as much yield as rich people. But but the blockchain, defy, it offers an opportunity to do that. So how do we get there? And I guess this is this we're a little bit far away from the original question, which is like, what exactly we're trying to solve, but this all plays into it because how in the world do you make an app that's simple. Right? Do you with the private keys? It's hard, dealing the fiat is hard. Dealing no knowing which protocols are good is hard. The actual act of swapping and trading and staking and keeping track of your portfolio is hard. So every single one of these things needed to be built in a way that's ex. That's automatic that just works that you can put a good Ux behind. And, yeah. So this this whole thing got started with just like this is so hard how do we scale it, and the answer is is, you know, tech, build a really really good platform. ", "start": 525.23834, "end": 883.76105}, {"speaker": "0", "podcast": "Yeah. I think that's a great founding story. And yeah. So y'all are using... I mean, like you said, it's a it's a self custody app. Right? And I I would also imagine that the management of seed phrases or the management of private keys would also be something that you were trying to help your friends with quite a bit. Oh, yeah. Yeah. How are you? ", "start": 884.55493, "end": 906.7249}, {"speaker": "2", "podcast": "Yeah. How are y'all addressing that issue in the... Within the Gi app? Yeah. I I again and your last question made me think of, you know, custodian ship, most certainly. So you you look at the last few months and you're like, well, you know, didn't somebody already make def defy really easy wasn't that celsius. Didn't they make it really easy. It's like, well, yeah, It's easy to put money on that platform. It's also easy for them to not tell you what they're doing with that money and for stuff to crash and for you now Never be able to take your money back out, all very easy. But obviously, the problem there is Custodian ship. So custodial apps, super easy to use, huge, massive, terrible risks under the covers. So what about non custodial apps? Well, you know, there there are a few of them out there. Obviously, the the the elephant into the room is Meta mask. But what's the problem with Meta mask well it's a seed phrase. To to get my... Put on my like Vc Jargon hat. I like to argue that Meta mask has reached its Tam The total total addressable market for a seed phrase is not big. It's not something that most people should be doing and handling on their own. You really need be like a cybersecurity professional to understand the implications of what a seed phrase is and how to safeguard it and what to do. So what we've built at Gi be is proprietary tech that has taken the issue of custodian ship and made it ready for mainstream. And this is one of the most important things that we've built over the last here. So we have the first native mobile, non custodial experience with a recoverable private key dear and so we don't have a seed phrase when you first come into gi, and that's the biggest difference that you'll find between us and anything else in the market. So we're as easy as custodial apps. But we are in fact non non custodial. And and to take it to extremes, if the user wanted to access their private key their raw private key on our platform, they can. They can do that. Moment if they want, if they really want to. ", "start": 907.4249, "end": 1019.88983}, {"speaker": "1", "podcast": "Yeah. So so we can we can dig into however much you want. But at at at a very high level any what our what what the tech does is uses a very well known academic white paper mask. For example, Sham secret sharing, to break up your private key, and encode it into multiple different shares, store those in different places, like, for example, like a social login, Google, Facebook, even just email password. A biometric, a password that you know or remember, And then we also have the ability to guardian shares in databases that are encrypted. And that only you can access and une. So it's a multi sig multi stake off chain, non custodial private key, so many jargon words that also is has Mpc functionality. You can break up your shares and into as many pieces as you want, and then you can change the minimum and maximum threshold. So if you wanna make it really secure, for example, you could have, like, ten out of eleven shares is required to unlock your private key. Right? So that's that's kind of the the the strategy behind it, and then the actual implementation is something that we've worked on last basically the last year. We've been working on this thing. And it runs natively on on a mobile app. So that your private key it never crosses over the Internet. We don't cache it anywhere. It never goes our servers it never gets rid into your phone. Never gets written into, like, you know, Chrome secure enclave. Your private key, it only exists theoretically, like mathematically until you bring all these shards together it it, sign the transaction and then poof it's gone again. Interesting. So I guess what would it take for someone to ", "start": 1020.84985, "end": 1125.6317}, {"speaker": "0", "podcast": "completely lose access to their assets in, you know, using the gi wallet. I I guess... So what you're saying is, like... Without without giving hackers like a step by step, ", "start": 1126.2483, "end": 1136.4655}, {"speaker": "2", "podcast": "I mean, basically, it's N of m shares. Right? So if you had, like, three of five, for example, and you were to like... Blow away or lose lose your physical phone, lose your actual face, lose your Google account, like and and, you know, your Facebook account then... Well, okay. Now you're out of luck, but, you know, we we try to make it smart and go go about it the right way where... Okay. Like, the likelihood of somebody losing all four of those things is kind of low. So that's kinda of weird. You you would have to lose your Google account. And your physical phone, you'd have to forget your password. ", "start": 1137.9907, "end": 1173.0298}, {"speaker": "1", "podcast": "Basically, is if there was... If there was only one share left, you couldn't recover. But that... That's the whole point behind what we built is that you have the option or the the the ability to add more recovery shares ", "start": 1174.4642, "end": 1186.0775}, {"speaker": "0", "podcast": "and then allow other people institutions that guardian them for you. Okay. Okay. Yeah. That makes sense. Yeah. Definitely a lot of... I mean, more secure than just writing your seat face down on a piece of paper and ", "start": 1186.6165, "end": 1197.9818}, {"speaker": "1", "podcast": "locking in which which is where this started is where this started. So many people would like email me the seed phrase or like, text it to their friend. You know, it's just it's just it's it's wild that a lot of people just don't really quite grasp the gravity of that seed phrase of that private key. It's and in in the rest of the traditional finance, you know, there's there's there's always ways to recover. There's there's... You're gonna have records with a bank somewhere. ", "start": 1198.3741, "end": 1222.3861}, {"speaker": "2", "podcast": "But in self custody D defy, yeah. That's that's it. You are the custodian. Yeah. And so, you know, and you're you're seeing some non custodial wallets wallets pop up, part of the reason is because, you know, the whole games stop thing with Robinhood. I I can't trade. Oh, no. And then with Celsius, I can't pull my money out. Oh, no. So that this custodian thing is coming up over and over again. And and like, you know, Coinbase has a non custodial wallet Robinhood hood has one in beta there's a few non custodial solutions out there. But so far, they all have a seed phrase. And, you know, I o, that's that's quite limit. Your audience is very limited if you're gonna do only sea phrase. It's it's not ready for mainstream. Yeah. I I absolutely agree because I ", "start": 1222.8785, "end": 1262.3999}, {"speaker": "0", "podcast": "I was talking to a friend who's working on a project and they were talking to a Vc about you know getting Vc funds and then sending the tokens to the Vc and they said that you know, when they asked for the address, the Vc started reading off the words to their seat phrase. Yeah. Yeah. And after two words, they go, stop. Please kind. There's not I go more. ", "start": 1263.4303, "end": 1285.3845}, {"speaker": "1", "podcast": "Yeah. There's so many stories like that. It's it's it's interesting because there's a lot of pent up demand I think for what what, you know, the blockchain, decentralized finance has not offer, but there's so much education still things to happen. And honestly, I just I just don't really... I think it's too tall of a task offer to educate the world on how to be that crypto expert. ", "start": 1286.5743, "end": 1309.5518}, {"speaker": "0", "podcast": "There has to be other ways, which which which is yeah, which is exactly why we approached it the way that we did Yeah. Absolutely. And I've I definitely consider myself, especially in the bear market, a Ux Ui Maxi, and I I love it when I stuff like this, because this is really how we scale to the next... I guess, yeah y'all say the next ten million users on your website. So this is how we do that. But like what else do see? Like, what else does crypto need to do in order to scale over the next five to ten years two that next ten million users? ", "start": 1310.4261, "end": 1339.6965}, {"speaker": "2", "podcast": "Yeah. Yeah. So priming, first and foremost, you have to address custodian ship. And then it's like private key stuff. So the the private solutions is the first big thing that we built And then next, we addressed gas fees. Another massive Ux problem. If you're on one particular chain like Avalanche or whatever and you run out of the governance token for avalanche, you gotta to on ramp more money. And then likewise, if you're on Eth main net or if you're on Poly or whatever each of these have their own governance token and you have to maintain a a bunch of gas fees to cover at least, you know, five or ten transactions at all times. So we... That that was kind of our second, like major innovation is abstract away the need to hold the governance token for each chain that you're transact acting on. And that's that's live that's that's built ", "start": 1340.1892, "end": 1388.4229}, {"speaker": "1", "podcast": "that's using some E ips that opens Evelyn developed something called the Gas station network. It's actually been implemented for a little while We did our own version. We have own notes. We needed to make sure it was like fast and responsive and maintain. But Yeah. It's this ability to do blockchain transactions without having to worry about owning that gas token. Another thing that we did was we solve the problem of infinite approvals. So if you have approvals, you know, if if you're going to go interact with a smart contract, you have to give it an allowance to spend. And usually, it's infinite because it's really annoying to go do an approval, close the allowance and then and, you know, actually do the staking. It's like three full transactions. So if you're savvy, you can go close those allowances of those approvals, but there's just a lot of people out there with open approvals and we personally know people who who've have lost a lot of money to, approval front running in these kind of approval bugs. So we built in meta transactions into our native token and that's what powers this this one task taking on our platform. So our users don't have to hold the native gas token. They all have to worry about the approval. They tap one button and the smart contract does the approval for the correct amount. It expires that approval in the next block it sends up. So so you can pay for your transaction and for example, Usd dc. And then the the smart contract swaps and stakes into this into a yield optimize that'll automatically rec compound your your rewards for better yield. Anyway, all of these things it really goes back to user experience. So so the question is you know, what do we need to scale crypto and blockchain over the next five or ten years. It's all about user experience. And people are just gonna expect that the the app that they use is a one stop thing. It's gonna have everything I need. Or to worry about doing all this stuff And we're we're at the point now we're just that as a regular consumer, you get into an app, you log in, you swipe a credit card, you push a button and you expect your magic. And honestly, it's it's to the point now where our product really is that. It offers this basically three step thing to get steaks and start earning yield on the blockchain. So another thing that I I get kind of excited about is, like, this five to ten year thing, what what what happens there has to be really use cases for for blockchain for crypto. Your your Web three identity, it needs to be able to do things for you that make your life easier or cheaper it unlocks new opportunities. So there... There's different things you can do with that obviously like, there... There's a lot of conversations in the n t space. For example, events tickets, like you can do these collectible things where your your event ticket is the N nfc, like it would totally potentially anyway, you could get around some of these scalp problems. Right? Where all these tickets are massively expensive. There... There's the this notion of, like, government issued Ids on the blockchain or you you can have like, a trusted source of some some document and send it to your wallet in a in a way that is sole bound, but still dynamic and and from a trusted issuer. I all this to say that utility like really uses use cases for for blockchain tech. We we need more of that before we really, really scale. But the problem is it's kind of this chicken and egg thing. Who are you building a utility for, Right? If nobody has access to the blockchain, if if the vast majority of people can't really manage their own private key, how do you know who to who to, you know, build for. For example, if you wanna do, like, whatever your driver's license on the blockchain, And if the vast majority people in your state can't access the blockchain, why in the world would you spend time doing it. So I'm I'm really excited about our wallet because I believe it can solve that that problem, like you know, the the last mile problem, getting the power and you know, the vast of blockchain infrastructure into people's hands, you really have to have a good wallet system to to do that. So I think it, you know, ease of use, utility, use cases, all these things are super important, and it all starts with the fundamental tech and the user experience. Yeah. I think I think that's really easy. And ", "start": 1389.0497, "end": 1639.4354}, {"speaker": "0", "podcast": "wanna dig in a little bit on something that you you talked about where you said that, you know, you approved the permissions to access the the asset in the wallet. And then you revoke that assess on the next block. Would that not get expensive on something like Ethereum like on Poly gun, it's probably not a big deal, but our are y'all extracting away that that gas? And I I think you talked about that as well? ", "start": 1639.7943, "end": 1660.6985}, {"speaker": "1", "podcast": "So there there definitely are some savings in overhead. The actual operations, the fundamental operations, they still they still have to be done and just cost a little bit of gas. But you... So so you save a little bit in overhead, it does it does make it a little bit cheaper. But honestly, to me the bigger the bigger win is is the user experience. So you get the maximum amount of safety for just one interaction. So yeah, on even, obviously things are going to be more expensive. At the moment, where we we've deployed everything to Poly on, the Poly on network because fast transactions is cheap. We can really, really scale up and get we can get a little bit messy before we get, really, really, really cheap with all these gas fees. So, yeah, there's there's still the the cost to pay to get your transaction done, but there are definitely some savings when you when you bundle things up into Meta transaction. ", "start": 1661.4156, "end": 1714.3977}, {"speaker": "0", "podcast": "So that's so interesting. That's such a great way to do it too. Love to get the gel and Poly. Obviously, I knew that. Yeah. In the poly yes. But which which Protocols have you all integrated with into your app on the Poly network? And how are you using them? ", "start": 1715.0502, "end": 1730.5983}, {"speaker": "1", "podcast": "Love it. So there there's there's kind of a couple things on this topic. One of which is that we So we're not like a broker or not like an investment advisor. We're not R. Right? Well, we're not taking people's money and running it for the mess point of being non custodial. So we're kind of walking this tight rope between integrating with really good protocols versus giving them our full you know, endorsement, like these are these are these are the ones, take this as as an investment advice. So what we do is we have a lot of criteria that we go through and we audit these protocol based on how long have they been alive? What's their performance were their token economics? What does their team look like, how what's the business structure? Is it is it a Vc funded whatever. So we take all these different things... All these different criteria. It's it's more or less what I would do when I invested in a new Project. And we surface those into the app. So everybody who chooses to stake into a protocol. They have all the information that they need to make an informed decision. And because we're non custodial, our users are literally turning the key to put their money into this protocol. So it's this this this relationship where we wanna empower people with the knowledge and the means to get stake into Defy, but not like force you down this one very specific path. So all that being said, we are currently working on a lot more integrations, but we have ave curve balance her, I'm probably missing a couple. Quick quick swap is on there, you know, sushi is on there. Pretty much the big protocols with a lot of liquidity with a lot of history who have been audited and kind of been through it. ", "start": 1731.8032, "end": 1829.8755}, {"speaker": "2", "podcast": "And even then, one thing we're doing is I guess you could compare it a little bit to Robinhood is, we're offering up third party information on some of these pools to say, like, look, like, this is what other people think about it. This is not our opinion. Here's their website. Here's some general information, do your own research. Just like Eric was saying. So we we are not putting our sample approval on any of these protocols, but we know, because we have to start somewhere. We might as well start with the most ones. Whereas maybe, you know, some other non custodial apps, you're literally just high and dry. You have no idea what's what, if you're new to Defy. And you're just going to find the first thing that comes up and it may or may not be a rug. So there's kind of a balance to strike. So when ", "start": 1830.6904, "end": 1873.6255}, {"speaker": "1", "podcast": "we sort of stumbled across this notion of real yield before it kind of became popular in crypto Twitter, know. We really focus on protocols where you are sharing in revenue that they generate. So providing liquidity to a dex is a really good one. Lending protocols like Avi, A really good one. Curve and balance. We like those... We like those a lot. So because we have to integrate, you know, basically one to one with these with these protocols, we're avoiding the ones that are that we think are gonna be a flash on the pan, they're gonna be highly inflationary. So even though their yield is really enticing, you know, go get eight hundred percent or whatever. We wanna avoid those because the the, you know, the the market share, the users that we wanna bring in are not hardened dijon who understand the risk and can can afford it. We we wanna offer people as much as we can, stable, well backed high liquidity yield on well known protocols. ", "start": 1874.0005, "end": 1926.943}, {"speaker": "2", "podcast": "And we're and we're kinda like at least offering the basic information of, like, hey, this is a stable coin. This is not a stable coin. Mh You know, this is a Lp pair. Two different cryptocurrencies sm together that offers this yield. So we're offering kind of basic information and inviting everyone to learn more and then do their own research. ", "start": 1927.8353, "end": 1944.5032}, {"speaker": "0", "podcast": "Yeah. That that makes sense. And You also mentioned something in regards to like, one tap staking for the network. As well. Have you all integrated that yet? And how do you plan on integrating that? And how does that work? Maybe even like on a smart contract level? I'd be interested to hear? Sure So it's it's all based around meta transactions. So ", "start": 1945.8743, "end": 1963.663}, {"speaker": "1", "podcast": "I don't know how louise we we wanna get on this necessarily, but for for the most part in E twenty contracts. There's this notion of the sender and the receiver. A lot a lot of what happens on the receiver side is based on the the sender address. Right? You can't really do a lot of really interesting operations if you if you're if you're locked down to that level. So what Meta transactions allow us to do is bundle in a bunch of information into a transaction. One of those things being this all important, really crucial sender. And then and then do multiple operations with it. So that's that's that's a very a very brief very rough cut rundown of how many transactions work and kinda why they're interesting. It's it's this simple simple simple notion that everything turns on, but they empower a lot of a lot of amazing things. What what it means for us is that when our users go you download the app, you, you know, either send yourself crypto or on ramp with some fiat whatever. So you have some money that you wanna spend Let's say, you like Avi, and you wanna go earn five percent. So as soon as soon as the user finds a protocol they like, they input whatever I wanna put it in fifty bucks and then they they swipe they swipe this button that says I want a stake. What happens at that point is we use our our private key management, you know, basically Sham secret sharing to rec reconfigure your private key. We have a transaction that's ready to go that we sign with your private key and then poof your private private key goes away. What that transaction is, it will send up for example, Dc to the protocol. This meta transaction gets opened up on the other side on the receiving end. This smart contract knows who's sending it, it knows what protocol is supposed to go to it knows what token to swap it into and knows how to stake it. And then every single one of these things is signed by by by the sender. By by their by their private keys so that on the on the receiving end, there's no notion of, like, front running or injecting bad information or whatever. We made sure that it was secure on that level. So basically, I guess at a high level, what meta transactions allow us to do is perform multiple complicated well not complicated, but multiple multiple different transactions that normally would require, you know, multiple discrete transactions, but we can do it all at once, because we can use your identity multiple times in on the execution side of Smart contract. So I don't know I don't know how much all that makes sense. I'm I'm struggling internally how deep I wanna get into this. It's a continuing thing it's like a software developer It's like, Well, I I know all these details, but I don't know who else does. But anyway, it's just... It... What's exciting about it is that we can do multiple steps that normally take multiple transactions, but we can do it once, save a little bit of money on gas on the overhead and and the real real key here is that for the user, what you experience is you tap one button or in our case you slide something in the app. And it does all of this for you and and it's fast. It happens immediately, it gets it gets committed to the chain and you're and you're off the races. ", "start": 1964.8413, "end": 2149.2827}, {"speaker": "0", "podcast": "Yeah. I do. I think meta transactions are like truly fascinating and we do have a lot of developers listen to this podcast as well. So we try to like we try to like, hit all the levels Right? So Totally totally I think you're doing great. And so when you're auto compounding the rewards, ", "start": 2149.9353, "end": 2162.895}, {"speaker": "1", "podcast": "is that also in, like, meta transaction? That's that's just your typical yield optimize. So I don't if you're familiar with, like Auto farm or Beef feed shout out to them. Love Beef. Yeah. Beef team is amazing. There there's a handful of different protocols out there who's the product that they offer is they'll receive your rewards and automatically restate them so that your yield is higher. So on that on that part, it's it's a pretty typical smart contract that just auto compounds rewards. The the really, really, really cool stuff is in the meta transactions and how we... Stake and un stake. Yeah. That's... And so so have you integrated that staking, like, for for mad network? ", "start": 2163.854, "end": 2200.601}, {"speaker": "2", "podcast": "Probably. Really cool is all every last thing we've talked about is our is live in your hand right now. In fact, we just onboard a whole bunch more private beta users Today, So we've got... Yeah, a nice chunk of people using the Gi app every single day. And what's what's crazy is what the one swipe taking thing Yeah. Like Kirk was saying, there's like, a ton of stuff happening. There's there's private key stuff. There's, you know, a gas under approval. Approvals, gas amount, this, we like to call it like a port c, like the whole castle gate thingy, like opens, ", "start": 2201.239, "end": 2236.035}, {"speaker": "1", "podcast": "approves for the right amount, closes the door behind you. So you're not infinitely approved as it were as with most of your stuff happening on Meta mask. So that... It's just it's just really cool in it and it works and it's live and it's kind of a miracle when you experience it for the first time, honestly, If you've done def defy the hard way, like, I guess most of this listener group has... It it's funny. We we get this question sometimes when when people getting in the app and experience it and they're just like, so this is this is custodial. Right? And we're like, no, It's it's non custodial and they're just like, I don't But but you stake and you did the thing and the what and that was that was always the vision from the beginning, like being a hardcore d defect I guy myself. I knew that we needed to accomplish every single step that you take in this fifteen step process with Meta mask and on ramps or whatever. We had to literally do all of those and commit them to the blockchain for real because that's how we get away from all these different risks of being custodial and it's how you really keep control of your money. It's also how as a business, we are able to do what we do. Our our users... They don't have to be was the word I said earlier, Rich? Credit accredited investors. Because we're not we're not spending money on their behalf, like our users are not taking any risks that we haven't spelled out for them very plainly. You are interacting directly with the blockchain with our app. And it's just it's just a lot of tech that we've a lot of time and brain power that we've poured into making that experience possible. Yeah. Just thinking about send an email and, like, I don't know, nineteen eighty seven. I I think it was possible. ", "start": 2236.674, "end": 2331.3152}, {"speaker": "2", "podcast": "Technically, if you knew the Ip address, and you typed it in and all this crazy stuff. Built your own modem and whatever versus like you know, nineteen ninety seven, and you had like Nets scape browser and you navigated it to Yahoo and you were using Yahoo mail. We... I like to think of us another kind of like tech comparison I like to make is like Nets scape. There's the there's Aol, which is like very walled garden, you know, this is this thing on the internet. This is that thing and we made the content. But net Nets scape is just literally a tool for you to experience the Internet at large And as we onboard more and more protocols and and more and more blockchain chains. And there's numerous numerous taking opportunities across, you know, half a dozen do a dozen chains or whatever, will be more of a nets scape where you can really kind of go anywhere and do anything on the blockchain. Hold Entities, view n entities exchange in whatever you want. But, yeah, We'll kinda grow into that role. But I I like I like that analogy and that we're we're just technology, ", "start": 2331.7942, "end": 2388.0671}, {"speaker": "0", "podcast": "to access something that's otherwise nearly impossible to interact with. Yeah. I think Are making a lot of good points to too and a lot of these points are resonating with me, especially on the custodial non custodial part because I did have friends in the recent bull run that had money in voyager, and I advised against it I don't give financial advice, but I I do try to call the shots as I see them from time to time to help out a friend. And I think yeah, they there was definitely a big misconception during the bull run where people thought that Celsius was D defy or voyager, d f and and they're not. And when it comes down to it, like, Bin and coinbase. Like, those aren't D defy either. Like those are those are entities that hold your assets for you. And if they go under so to assets. And they ultimately have a say and when you get those assets and what you can do with them, But in Defy, the power is in the hands of the user, and you do have that self sovereignty. And, yeah. I don't know if if you also wanna elaborate in general on just the importance of ", "start": 2388.461, "end": 2452.9915}, {"speaker": "1", "podcast": "non custodial wallets and like users having that. Self sovereignty and what that really mean. Let's talk about the numbers for a second. You mentioned Coinbase, they... And they they might have updated this as they rolled out some of their proof stake. But for a long time, they offered a ethereum ethereum staking service. Right? They they locked it up. They're just, like, whenever Eighth may net goes proof of mistake we'll do something bad it. But their terms of service says that they charge a twenty five percent flat fee upon withdrawal. What that means is like, even if you didn't make any money, They're just gonna take twenty five percent. But it also means they could end up taking a lot more than twenty five percent if your money has grown like crazy over some amount of time. It's... Crazy. It's wild to me that we were in a place when they wrote those terms that this really wasn't even available It wasn't even a product. It's like, you don't even have anything to compare this to. So sure let's just take twenty five percent when people withdraw. So just looking at it from the numbers, if you give your money to a custodian and let them just kinda play around with it, they have the upside and you don't. Like, less you know, you can talk about it in terms of traditional finance in terms of regular banking. You give money to a bank to keep track of and know, it's Fdic insured. Good luck, I guess, making a a claim with that. But they immediately will lend that money out. You they'll they'll make a bunch of money off of it and then give you back whatever the whatever the lending rate rate is for the government. Right? You'll you'll you'll earn some tiny fraction of a percentage on on on your dollars, when they're out there earning, you know, twelve or eighteen percent, like, pretty good stuff depending on the market, obviously. So even just based on incentives, even just based on numbers and money only. If you have the capability of being your own custodian of your funds, you have all of the upside. So that that's what that's one of the things that really... I think it's why defect captured beat my imagination so much was once I got rug, my first ever, like losing three B I was just like, man, this is completely and solely up to me and nobody else. And it was it was so freeing. It's is this weird we we we've noticed this a lot too. When when we explain to people with with the Default app, it's non custodial, you take all the risk. You'd make all the decisions. They're just like, wait, is my money's safe and it's like, no. It's always at risk and it's like, well, is it backed up by anything. It's like, no, It's it's always a risk. And they're like, but I get to choose. Yes, you get to choose. And There's something that unlocks at least in my experience and I've seen this in other people where it's like, I want nothing more than have control. I'm so tired of other people taking risks with my money and they don't tell me about and and receiving all the upside and giving you back some tiny amount. So that's that's And it's kind of a different topic, but, you know, how we end up ended up monetizing our company, how we make money is like fractions of transactions. Right? We're not we're not gonna go take eighty percent of your yield. We're gonna say, now this is like point one percent or something to stake. We'll obviously like a Fiat roof. Fiat rails will will... That that... That's something that ", "start": 2453.604, "end": 2634.689}, {"speaker": "2", "podcast": "obviously, revenue source or whatever. Yeah. We have we have less control over fiat rails. Big for for a lot of reasons. But yeah. We're we do have control over in Defy land. What you'll what you'll find is our fees are just gonna be less than what's out there in the market because we're still vertically integrated. We've got like six revenue sources, whereas everybody else has one maybe two And so and for me, Guess on like the highest level kind of most macro... At least, I feel like that's kind of part of your question, like, what are some kind of macro thoughts. Right? For me, like one of the most macro things about what we're doing or what's happening right now, what regardless of whether we crack it first or not. Is the democrat of of liquidity providing, which kind of big weird fancy words kind of go over most people's head, but But, you know, when when, like farming was democrat when, like transportation was democrat, these are really big inflection points in society, And like, finally, information was democrat. That was like, you know, the web boom. And and then like social stuff, mobile. And I think I think we're to a point now in just society at large one. First off, liquidity providing is not something that most people think about every day. But Like, let's provide liquidity to exchange. Like, how exciting is that? It's like, what the hell are you talking about. But I think that that is what D defy is is actually being able to take advantage or, you know, capture the true value of your money and where it sits and when when, I think that's gonna be a huge inflection point. And we're just we're just barely scratching the surface. I mean, what we're like, barely ten percent of America owns any crypto at all because sodium and non custodial is like less than one percent. And you talk about how... On on the... At the world at large... You're like, yeah. Let sodium there's tiny tiny percentages of the population are exposed to crypto. And I think when we make that easier and when when people are exposed to the power of the democrat of liquidity providing. I think we're gonna see just just an explosion in usage and excitement over the whole thing. ", "start": 2635.2278, "end": 2759.5144}, {"speaker": "0", "podcast": "Yeah. Absolutely. And... Yeah. I was just kinda thinking, like, when I first got into Crypto, like in twenty seventeen, and I bought my first little bit of bitcoin on coinbase, and I was like, oh, yeah, This is it. I'm I'm in the crypto now. And I really didn't understand until I got a, you know, a ledger I gotta let your like, pretty early because I I had someone who told me I needed to get one even though I had, like, right, hundred dollars with the bitcoin or whatever. And then, like, I I remember representing a transaction for myself to another wallet that I had from myself to myself and thinking this is amazing that this actually works. And, yeah. And and I love just like... And, like, if you have a ledger, like, it's it's it's so like cyberpunk and like, clunky and like, difficult to use sometimes and a little bit annoying because as I'm getting older, I've got a sq to make sure that the numb on typing. Correct. ", "start": 2760.2466, "end": 2810.9604}, {"speaker": "1", "podcast": "When you have to use Wall connect and and it's... Right. If you're gonna with with a ledger holding your private key. Yeah. You can do it. Is definitely upside, but I think the vast majority of people aren't gonna be able to do d fire with a ledger or, you know, self custody obviously difficult. Yeah. ", "start": 2811.8357, "end": 2828.5535}, {"speaker": "0", "podcast": "Yeah. And so, yeah, When I when I download apps like Gi, and I I just think, man, Like, this is so much easier than what I was doing four or five years ago. And it it's amazing. And something else I I wanna ask y'all about is when I did sign up for the beta. I got some gi coin. So do you wanna talk about that? Like, what's going on with Gi, the token and what what like future utility do you foresee with that? ", "start": 2829.4297, "end": 2853.987}, {"speaker": "1", "podcast": "Yeah. Love it. So ", "start": 2854.64, "end": 2855.857}, {"speaker": "2", "podcast": "little bit of it. Well, that the the utility is a is now utility. True. And we... There's there's light paper out there that we invite anybody curious to please go read. A coin launched ged dot c was something that we released back in April. And so the link to the light paper is right there. But My my favorite thing to say to investors and customers and everybody is as the Gi coin is infrastructure. ", "start": 2856.3127, "end": 2878.595}, {"speaker": "1", "podcast": "Yeah. All these this discussion we've been having about meta transactions. We realized really early that we needed to make that a reality. We needed to use make a meta transaction, basically, write our own E. Right? Needed to have a a standard interface for these transactions that tokens and smart contracts can communicate over. But there wasn't a token already that So we had to make our own and we're like, okay, how do we deploy this thing and the best answer was make our own token. So we started from this this user experience thing, we want this one tap staking with meta transactions with a gas station network with approvals. How do we do that? Let's put into a token. And as soon as you start excuse me. As soon as you start talking to a legal team about launching a token. It gets hairy fast. And for good reason, we don't have all the rules like the government won't tell us exactly how to do this correctly, all they're doing is enforcing old laws and and kind of picking and choosing what's what's battles and fights. So knowing that launching a token is difficult, we set out to make it as simple as plain as possible, practically no token economics So that it's a fixed supply this a capped supply. We can't mint or burn the token. It's on the Poly chain. And the the the purpose that the token... The the reason the token exists, the purpose behind it is to empower one tap taking in the app with is via meta transactions the way that we deployed that code to the blockchain is via this token. And then so after that, we kind of figured out how to make that that tech work with the Dc token as well. We had to do some some interesting things to figure out that the guts of the that smart contract, but we did it. And now an app, you can stick with Gi or with a stable coin and use those as an input to any smart contract out there. So the token is on the poly network work right now. It's only on this on Sushi swap. We're we're planning on adding more liquidity elsewhere. It's just hasn't really been a high priority because the the token is not... We're not using it to capitalize the company. We didn't even do an investor distribution with this token. We just... We we launched it, put it on this da. We we sorted to this hybrid staking da. Do you remember the Ox Dow, when they they brought on another Dow and they had this like limited staking to get this new token. I don't if that rings a bell or not, but we kind of we kind of did a hybrid version of that where over over a twelve year period, you can... Month. Twelve months, not twelve years. Over a twelve month period, you can state, you know, if bitcoin or Or Gi and receive free tokens. So like, we were faced with this problem of how do you get a token on the blockchain that it's not a pump and dump. It's not crazy token economics. It's it's accessible to everybody and its main purpose to drive one time staking in the app. It's a tough problem. We worked with the legal team, the entire time on it. But and this is where we ended up is this token that after the staking period is done, it'll be a cap supply. Its whole purpose that you can use it to interact with smart contracts in the app. And, yeah. So it's it's something that is it's interesting. It's definitely be part of the platform. Some of its utility is staking some of it is you you can provide liquidity to the Gi to earn some fees, ", "start": 2880.1926, "end": 3088.5198}, {"speaker": "0", "podcast": "but it's meant to be kind of part of the infrastructure like ethan can said, sort of a... It's it's like one of the supporting players of this broader vision of being defy to everybody. Yeah. That that makes perfect sense to me. And, yeah. Like, I'm just... I feel like we've got this huge issue in the D defy space from an adoption standpoint in it's and I've said this a lot on the podcast already, but it's Ui ux. And it feels like y'all solving that. And, yeah, I I just think that also the name Gi for the token is just just love the ink Gi. Thanks. ", "start": 3089.317, "end": 3121.6628}, {"speaker": "1", "podcast": "Yeah. It's tim. It's stuck with us too. ", "start": 3122.463, "end": 3124.0627}, {"speaker": "0", "podcast": "So maybe just what we've got, like, seven more minutes But... Something I just wanted to touch on because Eric you and I were kinda talking about this in a private chat was just like, you know, just recent news and and things that have been going on related to regulatory issues, thinking about like privacy and tornado cash and then, like Ky Am, what are your thoughts on that in general? And like, how are y'all navigating those waters and complying with those regulations. And and also just like what type of regulations does a non custodial wallet even have to do. ", "start": 3124.8628, "end": 3159.5815}, {"speaker": "1", "podcast": "Yeah. Huge can of worms, huge kind of worms. And not in a bad way I'm just saying there's there's about ten different things you just said that I wanna comment on. So Here we go. I I think that this whole topic of how do we scale the blockchain, how to get more users, the user experience has to be very good. And if we're going to get regular people into the block chain, you have to meet them where they're at. And for the most part, what that means is that people are gonna expect an app to just do everything. So we're merging two interesting worlds here of totally non custodial d fight and Fiat on ramps. And that's that's where that's where I think ideological, most crypto users start to have a lot of heartburn. So they they really butt heads because on the blockchain, you can basically be... I like to call it like pseudo anonymous. At the end of the day, if the government wants to find out who you are, they'll find you. Like There's no there's no real actual hiding. If you're doing something bad if they want you, they'll get you. So it's like living in the real world, you have to realize that some point, you're you're not gonna be anonymous to the government. But there's a high high level of privacy that's to be expected. Like don't necessarily want. Let's say let's say that some website comes out for e commerce, and I wanna go buy a t shirt. I don't really want that site to know all of my purchase history. Right? They're gonna know all of the things I like to eat and wear and do that that sucks like we're trying to get away from this Web two world where all your data is not yours and it's being sold and it's it doesn't taste good. Right? Doesn't it feel very good going down. So So so you have this web three world where native crypto users are used to this level of privacy, and then you have the rest of traditional finance where at the moment where the rubber meets the road most of the time is fiat on and off ramps. If you want, you crypto to b useful, you have to be able to get it in and out of your bank account to pay for stuff. Right? And I think there's soon, I think there's gonna be more payment rails where you can pay for things natively encrypt. Really looking forward to that because I think the Gi app is gonna have a big part in that and just... It's ease of use. But we have this traditional finance arena that is highly highly regulated. I think there's a lot to be said about the reasons why and there's some good things and some bad things. But in our app, we wanted everybody all of our users to be able to do everything natively in the mobile app. So the D stuff and the F stuff. So the way that we've approached it is we're going to comply with the rules that we need to comply with, when we need to comply with them. For the most part, it's fiat. So in our app, if you wanted to do a native a fiat on ramp at that point in time, you'd have to do some Ky stuff with whatever bank is dealing with it. But the rest of it, everything else is not Ky seed or identity verified. If you want to just do staking, if you wanna just send yourself crypto or send it back out you don't have to do any kind of like document upload or face scan or whatever. But if you're gonna interact with the fiat rails on our platform that does require some identity verification, So it's it's really this this kind of a ideological battle, I think, that is not helped by not having a lot of clarity from the government on like, how to even classify all these assets and who's a good guy and who's a bad guy I think that... And this isn't precisely exact the question. But in my mind, the role that regulation plays is in crypto is similar to like, in regular traditional finance, if you see credit card ad and it's like whatever, zero percent for the rest of your life and you can spend there's infinity money with us and and nothing bad ever happen. We swear. You see that and it smells. You're just like, okay, That's clearly a scam or like a bank. You know, you you can tell who's legit news and not. A lot of this is because of regulation. There's rules about advertising. There's rules about... How to how to, like, go about branding and stuff? Oh, yeah. Like, anytime... ", "start": 3160.3757, "end": 3401.3333}, {"speaker": "2", "podcast": "So in my accounting degree when of my first classes is a professor was like, you know, here at here at By accounting. We don't walk away from guaranteed high returns. We run. Yeah. You know, when you see, like, you know, Celsius quote unquote was guaranteeing eight percent. That's kinda high to guarantee and there's other apps out there that are, like, Oh, sixteen percent on a stable coin, twelve percent on a stable coin. Guaranteed. It's like, I don't know about that. And so, like, what you you just won't find that at Gi. It's like, no. This is the blockchain. You make your own decisions. It's it's up to you cowboy or cow girl or whoever to make the the, you know, to make the decisions. So so where where we land, ", "start": 3402.292, "end": 3441.5845}, {"speaker": "1", "podcast": "it's it's a really interesting combination of all this because The actual D fight tech is non custodial, we literally cannot stop you from doing what you're gonna do, where where the government starts care is when it crosses over into fiat land. We do have to comply with the fee side of it. But as much as we possibly can, we want to stay true to the idea of the philosophy, and ethos of what it means to to move on the blockchain to have decentralized technology. So it's an interesting battle. We found ourselves smack in the middle of it. Spending a lot more time resources on the legal side of it over the last year that we probably would have expected. But we are trying to navigate it in a way that is safe. It's cheap. It's easy. It's scalable, And again, this all goes back to to what drives us is the core user experience. I think if we're gonna get the next hundred million people in Be fine. It just has to be easy has to be kind of a no brainer. And we also need to be responsible with how we develop this tech and what we choose to comply with. But I just... I view it as as a matter of practicality. If you're gonna, you know, build a business that's healthy, and is safe for people to to put their money in, you just... You have to find a balance between those those two worlds. So anyway, I think there's there's so many things that be said on this topic, but for the most part, what we found is that dealing with fiat sucks there's so many rules and regulations and and but but the good news is we've we've really really leveled up as a company. Our Cfo, Dave Le. He joined us from Price water Cooper. So he's he's a Cpa. He was a senior senior director there and he's also our chief of compliance now. And he and I work a lot. We spend most of our days dealing with these issues, but what it what it means is as a company, now we we we're we're able to show everyone else Google and Facebook and whoever, that we are trustworthy that we can play that we're compliant in these ways that we're required to so that we can can't can grow the business and continue to provide these services. Anyway, yeah. Like I said, big topic. There's a couple of things I wanted to comment on that I can't think of right now, but ", "start": 3442.2205, "end": 3570.0723}, {"speaker": "0", "podcast": "It's it's it's an interesting. It it's an interesting hybrid, you know, approach. It really is. Yeah. And a little unfortunately that we're running out on time right now because I could probably dig into the regulatory side for another thirty minutes, but We. We don't have time for that. So before before we head I just wanna say, you know, is there is there anything that maybe we didn't touch on specifically that y'all just wanna make sure to address right now before we head out? ", "start": 3570.671, "end": 3593.1658}, {"speaker": "1", "podcast": "Get the app. I think we said that before, but we just barely ended our private beta, which was an invite only kick the tires kinda try to scale the thing a little bit. We're moving into our open beta really, really soon, which is we're gonna take we're gonna take everybody off the waitlist list that's currently on the waitlist list. And really let people start doing this defy their own way. So there's referral programs. You'll get free crypto for referring your friends there's loyalty stuff. You'll get cheaper fees in the app for engaging and everything. But we're we're ready to rock and roll. It's not gonna not very anymore. Weeks before we really started to scale this thing, and we're just... I'm really, really, really excited to get more people on the platform because I'm I'm such a junky for product and for user experience. I I wanna get all the feedback I can so we can make it precisely what people are looking for ", "start": 3594.2932, "end": 3644.843}, {"speaker": "2", "podcast": "in in easy retail crypto for grandma. Yeah. So you'll find us at gi dot c o or just search gi in the Apple App Store or on Google Play. Awesome. Awesome. Yeah. We definitely covered a lot today. Self custody, meta transactions, ", "start": 3645.5564, "end": 3659.2046}, {"speaker": "0", "podcast": "regulations, recoverable wallets, Ui ux, And, yeah, this has been really great guys. I I really appreciate y'all coming on. And for those of you listening and watching, Thank you for listening and watching. Spotify, subs, Apple, subscribe and on Youtube on Poly Tv. Right there as well. ", "start": 3660.157, "end": 3679.2893}, {"speaker": "1", "podcast": "Eric Ethan really appreciate y'all coming on, and I'll catch you next time. Thank you so much. Wanna huge fans of Poly gun, Poly on all the way Thank you. Thank you. Go poly. ", "start": 3680.1628, "end": 3689.314}, {"speaker": "0", "podcast": "Alright. Bye everybody. Thanks, See. ", "start": 3690.9062, "end": 3692.976}, {"speaker": "2", "podcast": "Trivia. ", "start": 3702.0376, "end": 3702.5132}], "summaries": [{"title": "1. Exploring Gi: The Webb Three Wallet", "summary": "This text discusses the development of a native mobile app called Gi that aims to make decentralized finance (DeFi) more accessible to the masses. The app focuses on solving issues of usability, security, ease of use, and price to play that often hinder individuals from participating in DeFi. It allows users to manage their private keys, fiat currency, and positions, as well as track prices, all within the app. The goal is to bring more people into the world of DeFi by providing a user-friendly experience through innovative technology and infrastructure."}, {"title": "2. The Importance of Sleep for Mental and Physical Health", "summary": "This text emphasizes the importance of non-custodial apps in managing seed phrases and private keys in the cryptocurrency market. It introduces Gi be as a non-custodial app that offers a secure experience without the need for a seed phrase. The text discusses the risks of losing access to digital assets and highlights the need for precautions to protect personal data. It emphasizes the significance of safeguarding seed phrases and private keys, as they hold the key to accessing and protecting one's digital assets. The text also discusses the increasing demand for non-custodial wallets and the need for more education in the crypto industry to attract a larger user base."}, {"title": "3. The Background of Two Brothers in Crypto", "summary": "This text covers various topics related to stable coins, LP pairs, meta transactions, and yield optimization in decentralized finance (DeFi). It discusses the integration of one tap staking for the network and the benefits of meta transactions in simplifying and streamlining transactions. The text also highlights the importance of user experience, gas fees, and practical use cases in driving adoption of blockchain technology. It mentions the Gas station network and the problem of infinite approvals. Additionally, the text discusses the cost implications of revoking permissions on Ethereum and the integration of protocols on the Poly network. It emphasizes the need for unbiased information on DeFi protocols and the focus on generating real yield in the cryptocurrency market."}, {"title": "4. Introduction to Crypto and Background", "summary": "The text discusses the advantages of non-custodial blockchain transactions and the importance of self-sovereignty in decentralized finance (DeFi). It highlights the potential for blockchain technology to become a versatile platform and compares it to the Netscape browser. The text also discusses the concept of liquidity providing in DeFi and its potential to revolutionize the financial industry. A crypto investor reflects on their early experiences with Bitcoin and the importance of using a ledger for secure transactions. The text concludes by mentioning the difficulty some individuals may have with self-custody methods."}, {"title": "5. Getting Hooked on Crypto: From Mining to Writing Applications on the Blockchain", "summary": "The text discusses various topics including the convenience of downloading apps, the challenges of climate change on food production, the creation and utility of Gi Coin, the importance of user interface and user experience in decentralized finance, regulatory issues with non-custodial wallets, challenges of scaling blockchain while maintaining privacy and compliance, risks of high guaranteed returns in the blockchain industry, challenges of maintaining decentralization while complying with regulations, and the features of a new app called \"gi\". The text concludes with a brief mention of regulations, recoverable wallets, and the importance of user experience in wallet design. The speaker expresses gratitude and encourages support."}]}