{"podcast": {"title": "Polygon Alpha Podcast", "host": "Justin Havens", "image": ""}, "episode": {"title": "Unsecured Institutional Lending in DeFi | Clearpool | Rob Alcorn | Polygon Alpha Podcast", "number": "13", "date": "SEP 9, 2022", "description": "", "url": "https://www.youtube.com/watch?v=15xrqqAnGMY", "speakers": {"0": "Justin Havens", "1": "Matt Hougan", "2": "Ryan Rasmussen"}, "file": "september9.mp3"}, "transcripts": [{"speaker": "0", "podcast": "Hello, everyone. Welcome to the Poly gon alpha podcast. With the Poly gon community gathers insights from today's leaders in decentralized finance and crypto. I'm your host, Justin Havens, a aka crypto. Let's get started. On today's episode pause on Alpha, we are joined by Rob from Clear pool. Rob, thanks for being here with us today. How's everything going? Everything's going well. Thanks, Justine. Thanks for inviting me. Thanks for having me. So let's just get started very quickly on your background And, you know, just what is your background and how did you get into the Defy space? ", "start": 0, "end": 36.351063}, {"speaker": "1", "podcast": "Yes. So my background is mainly in traditional finance? So I started out as a broker in fixed income markets. I did that for about five years, and then I moved into banking. So I joined the bank in twenty fourteen. The bank took me on a bit of a journey. Just in terms of, different locations, Us, Middle East, Asia. But also, I moved from sort of starting out in fixed income through a journey took took me through sort of money markets, asset liability management, And then ultimately into a trading side, whereas as a repo trader and the money markets for for the last four years. Whilst I was doing all of that, I got into crypto in around two thousand and fifteen. So at that time I was I was in my own time, I was I was developing a a robo robot advisor, it's like a digital wealth management platform. And I realized that there... Although they have this kind of like, you know, digital facade, everything underneath that is just traditional clunky financial infrastructure, very expensive and very slow. So I started looking at blockchain as a way to improve on all of that. That got me into crypto and yeah, that was it really. You know, once I once I I started looking into that. I never really looked back over. I continued to work at the bank right up until two thousand twenty one, but it was it was at that point when I decided that it was time to to get out of banking and and into into defy. So came up with the idea for Clear with with an next colleague actually, who was also working at the bank back then who left in two thousand eighteen to start digital asset custodian called Hex trust. Ceo is Ale lesser K, him and I ex colleagues and friends and yet together, we we teamed up to to come up with the idea for people. Yeah. Thanks for that background. Yeah. And Clear is a decentralized marketplace for ", "start": 37.145752, "end": 168.81914}, {"speaker": "0", "podcast": "unsecured institutional capital But what else can you tell us about Clear And what is what does all of that mean? Unsecured institutional capital? ", "start": 169.19804, "end": 178.2737}, {"speaker": "1", "podcast": "Yeah. It's it's quite a mouthful. Yeah. So I think the the the the the the main thing to understand about Clear is is the marketplace part. It it is a marketplace. So I'd like to run the parallels with another protocol call which I'm sure your listeners will be familiar with, which is Ar. And so when you connect to R, As you know, you will see a marketplace for assets. But when you collect to Clear paul, you'll see a marketplace for borrowers. So the difference with with all of that is that when you lend on Huawei, you know that the the borrower is providing collateral for that loan. And in fact, the collateral will be worth more in value than the loan itself. So you don't really need to know who that borrower is, you can you can loan into the protocol and when you wanna get your money back, you can do so. And be pretty safe because, you know, the all of the borrowers on of are providing collateral or basically those loans are over collateral. And so the difference on clear is that you do know who the borrower is. And the borrowers are actually borrowing based on their credit reputation. So there is no collateral on Clear. So that's the main difference. And because of that, the yields are very different as well. So right now, if you're want lend stable like Usd dc on of, I think the yield is well below one percent On Clear paul, to lend to top tier institutions, the yields are more like ten percent to twelve percent. So there's a big gap in what you receive for lending on of a to what you receive for lending on Clear paul. And yes, that is basically there to compensate you for the additional risk that you taking on by lending to a borrower that is not providing collateral. But having said that, and the borrowers on Unclear Paul have to go through a very strict onboarding process. This involves due diligence. Involves Ky Ky b procedures and also involves the borrower obtaining a credit score from one of our partners, which is Cr dora So once they've gone through all of that, I've provided a significant amount of information to be able to do that, of course, we're able to verify them. And at that point, then they can stake some of their native token, c paul and launch all. It's at that stage end that the poor can then be seen by anybody who connects to the protocol and then they can lend. There's a lot of information that is available on the borrowers, who they are. What they do, what they would be using the borrowed funds for etcetera. There's that credit score which is provided by Cr. And then sort of as as you go further on, through the process of lending, lenders on people also have the ability to to manage risk. And one of the the most simple ways that they can do that which can't be one other lending protocols is decide who they want to lend to. So in example, we have the single borrower pools. So if you want to lend to borrow a, but not to borrow a b, you can do that. Whereas on some other products calls, all of the borrowers are grouped together in a single pool and if you lend to that pool then effectively, you might be lending to all of those borrowers. So that's a sort of a key difference between Clear and some of the other un collateral lending protocols out there. ", "start": 178.92377, "end": 405.22067}, {"speaker": "0", "podcast": "And I think that makes sense to me too. I I also have a traditional finance background specifically in the commercial lending space. And, yeah. On All, you don't care who the borrowers are because they're providing collateral for those loans that will get liquidate data, should they fall below that threshold. And from an under collateral or unsecured lending standpoint, yeah. I think that you would be a lot more picky about who you are lending those funds to and who the borrowers are. So all of that makes perfect sense to me. And and are all these loans, Are they unsecured or are they just under collateral or is it a mix of both? ", "start": 406.42902, "end": 442.52002}, {"speaker": "1", "podcast": "So they are all or unsecured? So the borrowers right now don't have to provide any collateral at all. So there's a possibility in the future with the way that the protocol has been built for us to introduce collateral. But the demand in this space really is from borrowers for completely unsecured loans. So this was something that we identified very early on, of course, we started looking at this kind of at the end of twenty twenty. And we started doing a lot of research back then in early twenty twenty one. And realize that this huge demand from market makers, high frequency traders, those type of borrow profiles are in defy But they're really sort of constrained by by what was available back then, which was really did the over collateral protocols. And they're not really served by sort of traditional finance either. So we know that there is huge demand there for un And that was the problem that that we really wanted to solve initially, you know, with Clear. But we wanted to to build something that also gave, you know, lenders the ability to to manage and monitor and hedge the risks that they would be taking on. By lending unsecured and that's what clear is all about. ", "start": 443.32004, "end": 526.4274}, {"speaker": "0", "podcast": "And I have heard of other, I guess, under collateral lending protocols that will take off chain collateral sometimes or also have, you know, paper contract agreements off chain. ", "start": 527.222, "end": 542.7643}, {"speaker": "1", "podcast": "Does clear pull, do any of that? No. We don't right now. Like all of the all of the lending is done and un collateral. So but the the protocol is bill looking in a way where, you know, we can we can introduce all of any type. So, you know, if we feel like there is demand for, you know, under collateral or even fully collateral then you know, we're we'll be able to do that, but right now it's it's all purely unsecured. ", "start": 543.4813, "end": 570.9179}, {"speaker": "0", "podcast": "Okay. Yeah. And I remember there was a time about, like, a month or two ago, maybe that there was this pig big push in the d defy space of, you know, maybe rem naming from going from under collateral lending or rebranding from under collateral lending protocols more towards the term credit protocols. What are your thoughts on that push and does it really matter? ", "start": 571.79675, "end": 593.37604}, {"speaker": "1", "podcast": "I don't think it really matters. I mean, if you look know, in in the traditional financial markets, you don't really have that that distinction. You it's just lending and borrowing. It could take the form of, capital markets, instruments like bonds, or money markets, unsecured loans or repo of course is does have collateral. But you don't really have this distinction of collect lies or un collateral. So I think you know, that is just something that emerged because the early defy protocol like compound of a maker, for example, they are all over collateral. So then, you know, as protocols like clear start to come on the scene and offer un loans, the term, I guess, you know, un collateral, defy you know, was born. But I think, you know, credit protocols is much easier to say. And as I mentioned, you know, the borrowers are relying on their credit reputation, so it kind of makes sense. But ultimately, you know, lending and borrowing, I think is really, you know, a term that so we'll probably eventually include, clear pool and those other protocols calls that are either also unsecured, under collateral or fully collateral like Larvae and compound we'll probably just refer to them all within that sort of lending and borrowing segment of Defy, but they'll will still obviously be the distinction between the protocols that are concentrating either on either collateral or un. ", "start": 594.49475, "end": 698.23016}, {"speaker": "0", "podcast": "Yeah. That that makes sense. And what is the issue with over collateral lending? I mean, it's obviously an probably an inefficient use of capital, but I don't know what what other issues do you see with that specifically? ", "start": 699.10516, "end": 711.98346}, {"speaker": "1", "podcast": "That that's the main thing really. So it's it's a very inefficient use of of of of capital. So if you, you know, if for for for smaller retail or is it's, it's probably not so, you know especially if you're holding long term, some bitcoin some ethereum or some other assets, you, you're quite happy to put that up as collateral to borrow some small amount of stable coin. So up to a certain size bar, I think, that this is fine. But For the type of borrowers that we have on Gl, you know, they had their business strategy, their model is actually very capital intensive. So they're basically making markets on all of the major exchanges and charging inefficiencies in the markets for very sort of small amounts. And generally speaking, they are sort of delta neutral or risk neutral. So they're not taking a huge amount for risk. So they need to have more capital to be able to to maximize the the the the profits that they make through those those small inefficiencies that they that they that they arbitrage. So So it's quite a capital intensive. But if you think about it, you know if they wanted to borrow, let's say, ten million dollars If you wanted to do that on, you know, on Compound, you would first have to provide probably depending on what asset you were providing is collateral, that might have to be like fifteen million or even twenty million dollars worth of that asset in order to be able to borrow ten million dollars of stable coin. So... And and actually, you know, in some cases, the the factor can be higher. So So you can see that, you know, that that that is a problem for those type of borrowers, and that's where the demand came from. So I think that that, you know, that inefficient use of capital is the main problem. But I think also clear and un loans gives those borrowers the opportunity to build their own credit reputation in defy. So again, if you're borrowing one of our compound as we said earlier, nobody knows who you are. Right? And nobody needs to know who you are. Whilst, you know, you can refer people to your wallet address, and it still doesn't really give you that sort of reputation that you can build if you run a pool on Clear pool. So we have borrowers like W butte, for example, now that they've have, you know, had pools open since we launched in March, those pools are being very well managed. And over time, you know, the longer that quarter remains open, the the the higher than the sort of credit reputation that that Winder me is building in this space. And and I think that's, you know, what those guys want they want to have control over their own pool, but they want to have that ability to to build their own credit reputation as well. So I that's something that's very important. ", "start": 712.78107, "end": 892.39667}, {"speaker": "0", "podcast": "Yeah. I've definitely seen the idea of, like, an on chain credit reputation being a trend. I mean, even for like, the past two years, it's it's been something that the space talked about, but I think we're actually starting to see it come to fruition, which is pretty exciting. It's kinda like the next step for D defy in my opinion. But what when you are approving an institution like Winter mute to be white listed. Right? Because you have to be white listed as an institution to borrow when Clear pull, And I assume this is done by the community or or the Dow or maybe it's just like the core team right now, But what is the criteria that the community is looking at. And are are they being white listed for a specific amount or a specific borrowing limit? ", "start": 893.12854, "end": 933.9108}, {"speaker": "1", "podcast": "Just I guess that whole process. Yeah. That that's a great question because that's probably gonna evolve over time. So right now, I mean, our Ikea is still relatively young. We decided that boarding of new borrowers should initially, we've done generally speaking by the core team We wanted to, you know, be very careful in the early days to make sure that you know, we have very good quality borrowers, of course. And and I think this decision was was the right one because, of course, you know, shortly after we launched, we had the volatility that came from initially the the Terra luna, collapse. And then of course, the whole three arrows and then celsius and everything else. So. So I think that that approach that's sort of more cautious approach in the early days is the right one. But the borrowers is essentially what they have to do is, first of all, they will make a proposal to open a pool. In some cases, we've actually reached out to some of the borrowers in some cases their they're investors. In most cases they reach out to us. So initially, the core team will make an assessment of that borrowers. So we'll have a meeting with them and we'll do our own due diligence and ask a bunch of questions. And if we feel that after that, that they would make a good fit, a clear We then pass them on to our partner, Cr. Cr does further due diligence. They do the Ky c Ky b onboarding procedure. And then they move on to the the credit scoring. And this is where, you know the borrower really has to sort of provide quite a lot of detailed information, financial statements. And some other information, which gives Credit, you know, an insight into their financial situation. But also they have to provide read Api keys, for all of the exchanges that they have accounts with. And then that what that allows credibility to do is then visualize you know, where the balance sheet is being deployed, pull the data from those Api feeds, and then contextualize what they're seeing with the financial statements that they've already analyzed. And through that entire process, they're they're able to sort of build a very solid picture of the financial health of of that borrower. And a large portion of that is is real time. The data that's coming from from the exchange Api keys. So this is something that's monitored continuously. And it it gives lenders kind of a real time look under the hood of, you know, how healthy the borrower is. So this is something that doesn't really exist or hasn't existed in in in the past. And that's an innovation. You, that our approach with Cr brings to our lenders to have that ability to see to see the credit in in in real time. So they have to go through that entire process. And once they've done that, you know, if they get a score, which is above a certain level, then the final final part of becoming a borrower is to stake some sequel. There's a calculation that we use for that. Once that's done, the pool would then be live on the on the approach column can be seen by anybody who connects with their wallet. ", "start": 934.4045, "end": 1130.3131}, {"speaker": "0", "podcast": "What is the purpose of having the borrower stake some sea pull tokens before they actually borrow those funds. ", "start": 1132.7803, "end": 1139.7236}, {"speaker": "1", "podcast": "So it's really, you know, we kind of view it as a little bit like a membership fee. So of course, it it brings some utility to the token. And it means that, you know, the more borrowers that we have, the more tokens have to be bought from the open market. And those tokens remain stake for the duration that the pool remains open. And because the pools don't have any maturity date, they're basically perpetual as long as the borrower wants keep it open, and it will remain open. Even if they completely repay the loan, they can keep the pool open in case they want to start borrowing again in the future. So those people are being blocked up for long periods of time. So it adds, you know, quite a lot of utility to the token. And also, I guess, you know, from from a from a borrower perspective, of course, they know that that that Sea is there. And, you know, if if they were to you know, act in any sort of un unfavorable way towards the protocol, try to gain the protocol or the system anyway. Then know, the pool can be closed, three governance. And those Sea would then be not returned which is also the case in the b default as well. So provides you a few few different reasons for that estate Sequel. ", "start": 1140.5204, "end": 1228.0112}, {"speaker": "0", "podcast": "Yeah. And I think it'd be interesting for our listeners to hear, you know, just how common are under collateral or non collateral loans in the traditional finance world. I mean, I could think of credit cards as one that probably everybody has and you don't really think about it being an unsecured or un collateral loan. ", "start": 1228.902, "end": 1250.109}, {"speaker": "1", "podcast": "Yeah. Absolutely, you know, from a sort of a more retail perspective. Yeah, credit cards, student loans, I guess people can, you very easily think of the type of lines that are commercialized and, you know, a mortgage on a house might be one. Or a carly in most cases, I guess. But when you actually get into sort of institutional finance, majority of the loans are unsecured. So that could be anything from banks, lending to each other overnight. Or to write, you know, right the way through to sort of long term bond issuance. You know, there's a lot of corporates that issue bonds anywhere from five to thirty years and beyond, in fact, there are perpetual bonds as well. And generally speaking, although there can be slightly different structures to those. So those instruments, generally speaking there they're unsecured. In some cases, that, you know, they can be secured by by some revenue streams from from the business model. But but in between, you know, there's there's many different forms and I would say that, the majority of of them are unsecured. So I think, you know, this is this is not something new. You know, what the the the core concept of, you know, unsecured lending is is nothing new. It's just that Clear you know, takes that concept and then using the using the blockchain technology and and the concepts of decent, we've actually, you know, innovated something, which is far more efficient than the the incumbent system. And I think what that means is that as, you know, as more institutions start to pay attention to this and realize, you know, that, you know at some point, debt is going to be originated on chain. Whether that's stable coins or whether that's central Currencies, that this is an area where you know, they're going to be operating. And you know, so I think, you know, Clear paul is is really, you know, having built something that's very innovative it will make it very difficult for those for those sort of incumbent institutions in the traditional world, not to be able to move. You know. So I think if you take, you know, that sort of traditional financial concept and just lift it and put it, you know, on a blockchain, you'll get some improvement, but you probably won't get a ten x improvement. So then it's gonna be difficult for you to, you know, attract those those users. But with Clear, I believe that we've we've built something that is, you know, so innovative they we does really give that ten x improvement and therefore, you know, I think we can attract those users from traditional world quite easily. ", "start": 1251.2278, "end": 1420.6646}, {"speaker": "0", "podcast": "Right? Because I think another things just to for the audience, Like one of the things that you do focus on on retail standpoint, like mortgages and car loans is the collateral. The collateral pay plays a pretty big part in getting that loan approved. But And then when you... You know and I've made my fair share of unsecured commercial loans. And what you're relying on more there is, you know, number one you're, like the character of the institutional borrower in the sense unclear, which can refer to the just like the reputation within the space, but also your credit score or your credit history three is define your character, and then focusing on the capacity that they have to repay those loans. So that's like projected future revenue streams and the capital is another thing that you focus on, which is like their balance sheet, which you said in clear sk is governed by an Api key that is connected to all the other brokerage or or exchanges that they're operating on, which is which is very, very. Cool to me just to have like a live feed into the balance sheet of that institution. Seems really interesting. And then the main thing, the other thing that you focus on is the conditions, which is like the terms of the loan, the interest rate and and other factors like that. And you're not you're just not really focusing on the collateral as much. And it's just taking another thing that we've had in the traditional finance space for a very long time and converting it over into the Deep device space. And I think this is this is really exciting. ", "start": 1421.8646, "end": 1508.745}, {"speaker": "1", "podcast": "Yeah. I think, you you mentioned pretty much, I think all the fight sees there of ", "start": 1509.461, "end": 1513.476}, {"speaker": "0", "podcast": "the credit under underwriting statement europe. That goes back to my credit rating background right there at the five seas credit. ", "start": 1514.0883, "end": 1519.9846}, {"speaker": "1", "podcast": "But you're absolutely right. You know, the the one that that, you know, we we don't really need to focus on so much is is the collateral. And everything else is taken into consideration, know, through the due diligence and onboarding and the credit rating process. And as I mentioned earlier, that that's the way that it's done right now. But I think, you know, as we progress, you know, we want to try to decent decentralized that. Process as much as possible and bring the community into that. But one of the things that we're introducing very soon is our Oracle system and this is part of the this Sql staking mechanism on purple. And basically, oracle in the beginning, they will be tasked with providing the inputs that will price and shape the interest rate curve, which is integral to those permission as pools. But later on, you know, we do see this oracle system as potential to be used in the onboarding of new borrowers. So probably, you know, in a sort of two step process, initially, you know, that job that is currently done by the the the core team which is, first of all, making the assessment of a new proposal would be step one. So we can get a consensus decision on that part. And then the borrower would probably still follow a very similar process of obtaining the white listing and the credit score from from from Cr or one of one other the partners in that space. But then the the final white listing decision, you know, can this borrow now actually open a pool will also be can put back to the oracle. And, you know, as as a as a Sequel holder, you'll be able to to stake and delegate your vote in power to an oracle. So if you you know if you if you see the list of articles and you you know, you trust one of those names then you can delegate, you know, your token to them and trust that they'll be making the the decision that you that you would make yourself. So, you know, there's all sorts of things that you could, you know, you could talk about around that, like, you know, slashing if bad decisions are made and things like that. So these are all, you know, governance models and and parts of governance that we do think about a lot and, you know, it's something that, you know, we are we're working on and we wanna we wanna make sure that, you know, when we when we do start to to centralize these processes, that you know, we've we get it right first time. Because I think you know, governance is extremely important. And I'm not sure that, you know, there is a governance mechanism out there that has, you know, truly really sort of nailed it. And of course, it's gonna be different for each protocol call as well. So, you know, that's something that that we're that we're looking at. You know, we take our time on. Clear is is already very decentralized in that, you know, the pools are essentially purely driven by the supply and demand, market forces of supply and demand. So you know, all that really sits between borrowers and the lenders on Clear is a smart contract. There's nobody else in the middle making decisions on, you know, or the interest rate should be, what the tenor of the loan should be, what the size of the loan should be, None of that. You know, it's purely driven by by the market. So already we have, you know, a very, very decentralized protocol. But when it comes to governance, you know, which will further decentralized some of those processes. We're really focused on getting that right And the first step of that will be the Oracle system, which is going to be launched very soon. ", "start": 1520.5447, "end": 1736.9326}, {"speaker": "0", "podcast": "Yeah. That's really interesting leveraging the power of oracle to kinda I guess nail down that interest rate curve as it pertains to each specific borrower in pool. But I also feel like there's other opportunities in regards to maybe like, an interest rate swap or have you ever... Have you seen any demand or opportunities related to something like that? Or like, a credit default swap even? ", "start": 1739.9685, "end": 1766.5762}, {"speaker": "1", "podcast": "Yeah. Absolutely. This is one of the things that, you know, we had on our our road map from day one actually. So as I mentioned at the bidding beginning, we wanted to to build a protocol that solve that problem for the borrowers, but also gave lenders the opportunity to manage and hedge risk. So some of the the ways to do that is to provide interest rate swaps and that's gonna be something that will come very soon in two different ways one of them will be that will be introducing an index pool, which will be a a pool which will spread the liquidity amongst all of the other pools based on the weighting of the index. And then when you provide liquidity to that pool, you'll also be able to to hedge your interest rate exposure by taking an interest rate swap based on the blended rate from from the index. And then beyond that, also, we're looking at token stripping. So here, potentially, we'll partner with with other protocols whereby... When you lend to to the to the pools on unclear, you receive a token called Cp token. So those Cp tokens represent the amount of liquidity that you've provided to the pool they accrue the interest rate for that pool and they also represent the the risk profile of the borrower. You'll be able to take those tokens and strip them into the underlying element and the yield element. And then you can either monetize your yield up front or use that mechanism to essentially take a floating to fixed interest rate swap. So interest rate swaps are something that that's that's gonna gonna be coming But the big one you mentioned is the credit default well. This is something you know, that we've been building basically from the beginning. This is I think gonna be a game changer. It's gonna take a little bit more time. We have the staking coming next. We've got them automatic pools coming after that with the index pool I talk talked about. But ultimately, the... When we introduce the the credit default swap, I think, you know, this is really gonna be a game changer, really allow lenders, you know, give them that further ability to hedge their exposures. And, you know, potentially, you, within Defy, you know especially with the type of year, it's that can be available depending on the utilization of the pool, it's possible that know, lenders would be able to use all of these things and and structure, you know, even in like a risk free return through through playing those derivatives So, you know, this is all coming, and I think that level of sophistication is really what a lot of traditional firms that are looking to get into this space. That's one of the things that they need to see. You know, they're... Of course, they they they need to to think about, you know, compliance and regulation. But one of the other things is is the sophistication of the product offering. You know, they need to be able to to hedge risks. And so I think, you know, when when these sort of products are are finally built and introduce, there's gonna be a real game changer for Defy. ", "start": 1767.2914, "end": 1964.3696}, {"speaker": "0", "podcast": "Mh. And I do have a question about the Cp tokens. Right? So I I would assume that they're pool specific. So I just kinda given the fact that there's different borrowers, different rates and I guess, each pool has a different risk profile in general. So if I provide liquidity to the winter mu pool, versus the three hours capital pool that's actually a bad example. But you know you get what I'm saying. They would be different tokens per each pool. Correct? ", "start": 1966.2897, "end": 1996.6775}, {"speaker": "1", "podcast": "That is correct. Yeah. So there the the cp tokens are pooled specific. The way it works is... It basically works on an exchange rate mechanism. So when you lend to the pool, you're probably getting one for one Cp token for every Usd dc that you learned that you loan. And then over time, the interest that accrue changes the exchange rate. So when you want to redeem your Cd tokens, the the exchange rate has changed. So let's say you loaned a hundred dollars and six months down the lane, you want to withdraw that amount, you'll get, you know, the the hundred dollars plus the interest that has accrued during that time period. So the exchange rate basically adjusts over time. So that the Token is the part of the the protocol, which is effectively acc the interest for lenders. So... And then on top of that, we have Sql rewards. So if you look at the pools now, you can see I haven't checked today, but I think let's see for Winter butte, we used the example earlier, that Pool is ten point eight percent. If you click on that and then hover over the Apr, you can see that the the Apr that's paid in Usd see is seven point six five percent and then there's three point one five percent, which is paid in Sql. So whilst the Us dc interest accrue to the Cp tokens, and the Sea pool is occurring separately and can be claimed at any time. But the the Usd interest be would be paid when you redeem. So when you decide to withdraw your liquidity, that's when you get the Usd interest. ", "start": 1997.3285, "end": 2113.64}, {"speaker": "0", "podcast": "That was actually my next question, so you beat me to it. And that's... You know, just because that's another trend that we're seeing. We're a new or a narrative that we're seeing in the Device space is, real yield instead of, you know purely token yield emissions that are being paid for drafting. But... So you're providing you're providing both. And I I think that makes that makes perfect sense. And another, like, more recent topic that I want to talk about speaking of three Arrows capital. As we saw in the three Arrows capital bankruptcy, where, you know, they had to pay back their debt to the compound protocol first, before they filed for bankruptcy, And in my mind, as a banker, a former banker, recovering banker, that essentially means that the compound protocol had a perfect lien on those assets and or like a first priority lien in regards to the three Arrow capital assets. Which kinda got me thinking, you know, are those type of loans secured bi collateral on the blockchain, the most secured that you can have them? And then I'm kind of wondering, you know, where would the deposit for clear fall in that type of situation. We could probably only speculate right now, but I just wanted to get your thoughts. ", "start": 2116.3674, "end": 2191.6558}, {"speaker": "1", "podcast": "So I think the reason those lines got repaid is because, you know, the probably the value of the collateral that was being provided was worth more than the loan. So, you know, it makes sense that that that those loans would get paid off first. I think when it comes to, you know, un loans on on Defy, They're very much out in the open. So, you know, if if three hours, you know, we know that they were borrowing from the likes of Celsius, for example, but until it really or blew up, and nobody really knew that or certainly up the extent to which Celsius and some of those other centralized lenders were where we're lending to three hours. So... But if if it's on clear pool, it's very much out in the open. So our pause are you know, one hundred percent transparent, everything can be seen on chain on the block Explorer. So every single lend transaction, every single withdraw, every single borrow, every single repay. All of those transactions can be seen on the block explorer. And if and if and when it came to a default, of course, you know, everybody, you know, in Defy would would know about that, especially all of the lenders in that pool. So I think, in a sort of unsecured environment, you if a borrower is starting to struggle, you know, probably a loan that they have on Clear is something that they're probably gonna repay first. Because it sends a signal to the market that, you know, they're okay that they're not actually in trouble. Whereas, you know, something that is know, bilateral between them and some of the centralized lender, which is kind of behind the closed doors. You know, it's it's not so So, you know, it's not so public and therefore, you know. So I think that's a factor to take into consideration. If there is a default, then all of the lenders in Unclear are equal. We have something called an insurance account in each pool. So the interests on purple is generated every block. And from their interest, a percentage is diverted to the insurance account for each of the pools and also some of it goes to protocol revenue as well. Those insurance accounts build up over time, And in the event of a default, whatever is in the insurance account is available to the lenders. But first of all, once we hit default, there would be a auction whereby a white... Any white list of bidder would be able to come in and bid for the debt of the pool, what they're essentially bidding for is all of the Cp tokens of that pool. So if we think, you know, If we have a default and we have an insurance account, which equates to, let's say, twenty cents on the dollar, then we have an auction process, at the end of that, the winning bid equates to sixty cents on the dollar. Then the Lps in that pool have a final vote they can either accept the winning bid. And if so, they would they would get their sixty cents on a dollar, but they would re their legal rights to pursue to the borrower. Or if the consensus votes to reject the winning bid, they would then get their twenty cents on the dollar from the insurance pool sorry insurance account. But they would retain their their legal rates to pursue the borrower. So this is really, you know, obviously down to to the the type of lenders that are in that pool. But the the the concept here is to try to get Lps you as much compensation as possible without actually having to go down the root of a long run and our legal process. As I mentioned earlier, you know, with the other products that will be building on top of clear pool you know, it's possible possible that you can use all of that would, like say a credit default so, for example, to to protect, you know, fully protect yourself in the event of a default. Now we have a... All of that, by the way, is kind of under... By a very robust suite of legal documents. Which we developed with a global law firm. So whilst it's, you know, a very unique default mechanism it's unlike nothing, from sort traditional markets. It is actually under by solid legal documentation. So we're actually very very proud of of the, you know, the innovation that we have, you, in in in case of black swan events. You as well as, of course, the the innovation, which is easier to see, you know, which is part of the the the single bar pulls and the interest rate mechanisms. ", "start": 2192.5483, "end": 2472.2039}, {"speaker": "0", "podcast": "And what is the jurisdiction of choice for this type of litigation or or recourse? ", "start": 2475.0828, "end": 2481.0347}, {"speaker": "1", "podcast": "So right now, it's Hong Kong. That's where our legal team is based and Hong Kong law is is based on British law. So it's it's quite common place for that that type of that type of thing. ", "start": 2482.3994, "end": 2498.7847}, {"speaker": "0", "podcast": "Okay. And just in general, like, what are you seeing like like, where are you seeing the most demand? Like, are you seeing it more on the borrower side or the supply side right now. And are you just doing Usd dc at the moment for supplying and borrowing? ", "start": 2500.4731, "end": 2514.3447}, {"speaker": "1", "podcast": "We're just doing Usd dc at the moment. Again, the protocol you know, is able to support multiple different assets and we'll just basically see, you know, where the supply and the demand is for different assets. There's definitely some demand for other types of assets. I'm sure we'll see that change. Over time. I think right now the demand is probably more on the borrower side just because, you know what happens in the markets recently, it kind of dried up liquidity, A lot of lenders were very much risk off. And a lot of liquidity was kind of sucked out of the market. Which left you know, the type of borrowers that we have right now, you know, hungry for liquidity and you know, we saw interest rates rise on the back of that. So there is a lot of demand you know, from those... The type of borrowers that we have right now, which is the frequency trading firms and market makers. We do have a, you know, strong pipeline of of similar borrowers as I mentioned. And we're looking way beyond that. So, you know, we see demand coming from other sort of crypto native firms like minors. We've been talking actually to dow You know, there's sort of beyond crypto, there's opportunities with Fintech lenders, And then Clear paul also has permission calls. So everything that we spoke about up to now has been regarding the permission list pools where anybody can be a lender. But we have a number of sort of more traditional financial institutions that are coming into D defy. Right now, because, you know, because they're kind of coming from that more traditional space and they have risk and compliance departments and also sometimes regulatory issues. They have to know who are the lenders in their pool. So the permission is pulled as well as they love the the concept and the innovation there, they need to have this ability to have a visibility on who are the lenders. So So the commission pause are for those type of institutions and the first one we launched was for Jane Street. They're borrowing fifty million Usd dc from blocked out right now through Clear. And we have a number of other sort of similar profile borrowers gonna be opening permission pools soon. I think there's there's also gonna be one actually coming up very soon. And, you know, this is this is another area where, you know a Clear can really scale. Because those guys obviously you do much bigger size. You that a particular loan is fifty million Usd but it's potentially those sort of institutions can do much much bigger sizes. And we're building a more sophisticated product solution on the permission side as well, which which will come later this year. And what that will allow is for these more sort of traditional style institutions you'll give them the ability to be able to interact with each other in a more of a decentralized way, but within this permission ecosystem where everyone knows that each other has has gone through that exactly the same process to to be there. ", "start": 2514.9846, "end": 2714.8293}, {"speaker": "0", "podcast": "Another question I have is related to what your borrowers are doing with the proceeds of these loans. So, like, what what are they doing with the proceeds of these loans? Typically? And are they used to proceeds for the loan something that is also taken into consideration, for or white listing a pool. So it's one of the questions that we'd ask, ", "start": 2718.8389, "end": 2738.282}, {"speaker": "1", "podcast": "the borrowers when they when they first, you know, make a proposal to open a pool. Generally speaking right now, it's very easy for us to to track that. Because of the type of bar profiles that we have, the majority of those guys are simply using that liquidity to make markets on centralized exchanges. So these guys, you know, they're they're they're they're the guys providing liquidity in all of the tokens that you trade on central Exchanges. That's anything from from Big bitcoin and ethereum through to, you know, to all different old coins as well. So what they're doing is that they're they're literally taking the the liquidity that they borrow, and putting it on an exchange using that to provide liquidity on the exchange. As I mentioned earlier, the that strategy can be in most cases delta neutral, market risk neutral. They're really kind of, you know, just providing liquidity both sides. And taking advantage of small inefficiencies within those pricing models between different exchanges, So... And that could be tracked. Right? So we can see, you know, if you wanted to, you can really, you know, delve into the block explorer and see when a borrower removes liquidity from the pool, where is he sending into? You know? And, you know, you can you can track all of that if if you want to. Of course, it doesn't... You know, there's nothing to stop the borrower from using the liquidity for something else. But if it's not being picked up by the Api keys that have been provided to Craig au then it potentially could affect their their credit rating. So again, as we talked about that kind of moves in real time. So if all of a sudden a borrower you know, removes a lot of liquidity from the exchanges, but doesn't repay into a clear pool, then Cr will not have visibility on a lot of the the balance sheet where it's been employed and that will have an impact on the credit rating. ", "start": 2738.92, "end": 2864.7441}, {"speaker": "0", "podcast": "Yeah. That that makes sense. And you've touched on one of the revenue streams for the protocol being you you've got Cp tokens that go towards the insurance fund, and some of those also go I guess, the protocol treasury, But what are the revenue streams are there for the protocol? Like, how are you driving funds to the treasury? ", "start": 2865.6223, "end": 2887.2288}, {"speaker": "1", "podcast": "As in Usd dc and and the revenue is generated in Usd dc as well. So all of that revenue is is used to buy back Sea. So we have a buy back mechanism. So all of the all of the the revenue basically are crews in each of the pools. And then once per quarter, I will remove the liquidity from the pools. Sorry, we'll remove the revenue from the pools. And all of that in Usd dc will then be used to buy People on the open market. And right now one hundred percent of the buy backs are being burned. So we executed the first one. Just last week. Other forms of revenue will be... So by the way, the revenue is also the same from the permission pools. So there's a percentage of interest, which is diverted to revenue from the permission pools. And then we also have The insurance if is is closed, entirely by by by a borrower or for any other reason, other than default, then the the insurance account is also used for for is it's basically diverted to to revenue. So so it's it's it's insurance if there's a default in any any other scenario when the pool closed, it becomes revenue. And then the third one is well, there's going to be several other ways in which the price call will be generating revenue in the future. So we talked about the derivatives that that are gonna be built on top of clear like Cds, interest rate swaps, you know, anything like that where and also them pools. So them pools are... I mentioned the the index pool. So we'll have we'll have other pause that basically distribute liquidity based on some mandate, and then what we know right now is that a lot of Lps are distributing liquidity amongst a number of pools. And, of course, to do that, they have to do an individual transaction each time. So the them pools will allow them to do that with only having one transaction. So we know there's gonna be demand for that and that will generate fees. In again, which you know, will accrue to revenue. So there's the fees from them informatics pools from derivatives. And all of that, you know, will come in the future. So they'll... The revenue streams will grow. But even, you know, as it as it is now as long as we... As long as the protocol continues to grow in terms of, you know, the number of borrowers and and the size of the pools and the amount of pause and so on. Then the revenue will grow with it. ", "start": 2887.802, "end": 3046.4646}, {"speaker": "0", "podcast": "Yeah. And you've kind of already touched on this, but I just kinda want, you know, we're kinda running up time. And I just wanna just kinda get a sense of there's... If there's anything else you wanted to touch on that we didn't get a chance to address and just what... What's next on the road map? For Clear pull. So yeah. The next thing is ", "start": 3047.1045, "end": 3063.2278}, {"speaker": "1", "podcast": "we're we're about to launch our native staking mechanism So I think we we spoke a little bit about it or. So this is this is where the articles will come in. So we'll be be announcing a number of articles. There'll be the Genesis articles. They will be providing the inputs, which will be used to to shape and price the the interest rate mechanism. And everybody will be able to to stake Sea paul on the protocol and delegate their voting power to one of these oracle And this is where, you know, the the sort of the the highest yields are gonna be available for for staking Sequel. But not not only that, it also means that you are participating in securing that that pricing mechanism for for the interest rates, which which are paid by borrowers and received by lenders. And this is important because interest rates move, and we want rates on clear to to reflect the the current rates in the market. So the the articles will be incentivized to provide those accurate rates that they see in the market, because if they fall outside of the that the the center part of the distribution if you like. When we... When we take all of the inputs from the oracle, will have a distribution and the tails will be cut off. Then we'll have a t catered distribution, the medium will be used to to price the curve for the following epoch. So if you're falling you outside of that that zone. As an oracle, you won't receive any of the emissions for that epoch. And that's the staking yield So as a stake, you wanna be staking to the... And del into the articles that have the best record for for providing the most accurate rates. And this incentivize those articles to do that. So so not not only will you be able to, you know, to generate yield on your Seat paul, you'll also be be participating in in sort of securing that pricing mechanism, which is a very important part of the the protocol and it provides a real utility for the token. So that's something that that's coming next to very soon In fact. And we've got new pools coming, so there's number of borrowers lined up. So we're gonna be seeing new pools both on the permission side. And on the permission side. The permission product, as I said, we'll evolve later on this year, we'll introduce some more sophisticated products, it'll will be rebranded. So something very exciting to look look out for there. And, yeah, I think we really touched on all of the other things that kind of in the in the pipeline, them dramatic pools, you, credit derivatives and a secondary trading environment for Cp tokens all of these things you know, we're working on at the same time as obviously trying to continue to grow and scale the protocol. So Yeah. It's it's it's exciting and and busy. ", "start": 3063.602, "end": 3244.0383}, {"speaker": "0", "podcast": "It sounds like Lf comes so far, but you just keep adding things to the road map. To where this is never gonna end. And it's it's... Yeah, we we we're still only what I think like, five months ", "start": 3244.5156, "end": 3255.8503}, {"speaker": "1", "podcast": "since we launched in March. And we've we've delivered so much in that five months. I'm really proud of of the team and what they've what they've done and what they've delivered. But there is such that we can do and, you know we've really kind of only strict scratched the surface of where this this could all go in the future. There's there's just so much that can be done in this So I think we're still very, very very early on, you know, in this in this part of D defy and it just has massive potential to attract, you know, hundreds of billions or even trillions of dollars of value from from Traditional finance. ", "start": 3256.544, "end": 3294.6357}, {"speaker": "0", "podcast": "Well, this is where the the meme from twenty seventeen of the institutions are coming finally comes to fruition and clear pulls doing it. So... Yeah. It's it makes sense for for them to come in, you know, Defy in in this space. ", "start": 3295.2737, "end": 3309.0803}, {"speaker": "1", "podcast": "And there a lot of people out there that probably would have preferred them I'm not have got involved in Bitcoin, which now has a much higher correlation with traditional risky assets like stock. And you can, you know, see the outcome of that, I guess, at the moment with with how Bitcoin trades. But when it comes to to Defy and and in this space, I think it absolutely makes sense to to attract those institutions. Yeah. ", "start": 3309.797, "end": 3334.3625}, {"speaker": "0", "podcast": "Well, final question for you, Rob is where can people go to find out more about you and clear pull? ", "start": 3335.2534, "end": 3340.5154}, {"speaker": "1", "podcast": "Yeah. Best place is the website. Sorry that's clear pool dot finance. There's a link on there to our documentation section. And that explains absolutely everything that you need to know about Clear Paul. And the team, we have a very transparent team. You can find out that is there. You could also check out medium much link from there and twitter post, everything is linked from the website. So staff there and do your run research. ", "start": 3341.3125, "end": 3371.1821}, {"speaker": "0", "podcast": "Amazing. Well, thanks to everyone for listening and watching. If you're watching on Poly gong Tv of scribe, Apple podcast and Spotify, Poly alpha podcast and Rob. Thanks again, and we'll see you next time. My pleasure. Thanks a lot ", "start": 3371.978, "end": 3386.6743}], "summaries": [{"title": "1. Exploring Decentralized Finance and Crypto with Rob from Clearpool", "summary": "In this episode of the Polygon Alpha podcast, host Justin Havens interviews Rob from Clearpool about his background in traditional finance and his entry into the decentralized finance (DeFi) space. They discuss Clear's digital wealth management platform and its transition into decentralized finance. Clear specializes in providing unsecured institutional capital to small and medium-sized businesses, allowing them to access funds without collateral. Clear's lending structure differs from other protocols, as borrowers are evaluated based on credit reputation and do not provide collateral. Lenders on Clear have the ability to manage risk by choosing who they lend to. The text also discusses the difference between secured and unsecured loans in traditional finance and clarifies that Clear focuses on unsecured loans in DeFi."}, {"title": "2. Understanding Unsecured Institutional Capital in DeFi", "summary": "This text discusses the use of under collateral lending protocols in off-chain transactions in decentralized finance (DeFi). The author explores the rebranding of these protocols as credit protocols and discusses the distinction between collateralized and uncollateralized lending in DeFi. The text also examines the inefficient use of capital in DeFi borrowing and the challenges faced by larger borrowers. It highlights the growing trend of on-chain credit reputation and raises questions about the approval process for institutions to be whitelisted for borrowing on platforms."}, {"title": "3. Clear: A Marketplace for Borrowers in DeFi", "summary": "This text explains the borrower onboarding process for Ikea, a platform that assesses potential borrowers and conducts due diligence. If approved, borrowers must stake tokens as collateral and provide financial information. This system helps mitigate the risk of default and provides lenders with a guarantee of repayment. Borrowers in borrowing pools are required to purchase tokens, creating a sense of membership. The text also discusses Clear's efficient system for unsecured lending using blockchain technology, which is expected to disrupt traditional financial institutions. It highlights the shift in focus towards considering borrower characteristics and loan conditions rather than solely relying on collateral."}, {"title": "4. Understanding the Difference Between Secured and Unsecured Loans in DeFi", "summary": "This text discusses the importance of decentralizing governance processes in the financial protocol Clear. The author mentions the introduction of an Oracle system to provide inputs for pricing and decision-making. The text also discusses the potential opportunities in utilizing financial derivatives in the protocol. It mentions the upcoming introduction of interest rate swaps and credit default swaps in the Defy protocol, as well as the concept of CP tokens and their relationship to different pools. The text also discusses the trend of real yield in the Defi space and the significance of transparency and default mechanisms in decentralized finance lending."}, {"title": "5. The Demand for Unsecured Loans in DeFi", "summary": "This text discusses various aspects of borrowing and lending in the decentralized finance (DeFi) space. It explores what borrowers typically do with loan proceeds and how this information is considered when evaluating investment pools. The text also discusses the tracking of borrowers who provide liquidity on centralized exchanges and the potential impact on their credit rating. It highlights the revenue generation mechanisms of a protocol, including the use of revenue to buy back a specific asset. The text also explores factors that determine the preferred jurisdiction for international litigation. Additionally, it discusses the current demand for borrowing in the DeFi space, particularly in USD stablecoin loans, and mentions the introduction of permission pools for institutions with risk and compliance requirements."}, {"title": "1. The Current State of Lending Protocol in DeFi", "summary": "The text discusses Clear Pool's upcoming launch of a native staking mechanism and the introduction of new pools for borrowers. They are also working on developing credit derivatives, a secondary trading environment for Cp tokens, and scaling the protocol. The speaker believes that decentralized finance (DeFi) has the potential to revolutionize the financial industry and attract significant value from traditional finance. They also discuss the increasing correlation between Bitcoin and traditional risky assets and the importance of attracting institutions in the DeFi space. More information about Clear Pool can be found on their website, Medium page, and Twitter."}]}