{"podcast": {"title": "Polygon Alpha Podcast", "host": "Justin Havens", "image": ""}, "episode": {"title": "The Web3 Connectivity Problem | API3 | Dave Connor & Ashar Shahid | Polygon Alpha Podcast", "number": "16", "date": "SEP 23, 2022", "description": "", "url": "https://www.youtube.com/watch?v=15xrqqAnGMY", "speakers": {"0": "Justin Havens"}, "file": "september23.mp3"}, "transcripts": [{"speaker": "0", "podcast": "Hello everyone, Welcome to the Poly gong Alpha podcast. With the Poly gong community, gathers insights from today's leaders in decentralized finance, Web three and Crypto. I'm your host Justin Havens, a aka Crypto. Let's get started. On today's episode of Poly Alpha. We are joined by Shah Shah and Dave Connor from Api three. Hey, guys. How are you y'all doing today? ", "start": 0, "end": 26.56165}, {"speaker": "1", "podcast": "Good. Good. How are you, Justin? ", "start": 27.213678, "end": 28.888638}, {"speaker": "0", "podcast": "How Poly gun treating you? Poly guns. Poly gun treated me very well. As S. Thanks for asking. Dave how that yourself. Yeah. I'm good. Thanks, Justin. Thanks for having us on. We're looking forward to this. Yeah. We're excited as well. So we just like to start these off with just a little bit of back around. Dave, we can start with you. If you just give us a little bit of background on yourself and how you came to be into Crypto and Api three and then Asha s will move on to you afterwards. ", "start": 30.164799, "end": 56.06564}, {"speaker": "2", "podcast": "Okay. So I've been kind of involved might say involved in Crypto. I've been in encrypt this is about twenty thirteen what originally got me in was Do Quinn before it became cool. I didn't really by a huge amounts of it, but it was enough to get me interested in the technology and then kind of following how kind of Do coin and Bitcoin at the time introduced something called Colored Coins, which was almost like a Pro token before full smart contract functionality was available. Watching that appear and then kind of be d replicated, made me interested about if blockchain could do things more than just moving units of accounts around. And then seeing ethereum peer, made me realize that actually you can start to build things on the blockchain, but the final missing piece of the puzzle was the ability to interface with the real world. So it's around twenty seventeen, twenty eighteen that I decided to get more involved in blockchain, start working in the space. So with a few other people that we've met through various different online communities, we launched a data marketplace that we built using Chain Oracle. And some of the lessons that we learned using that and developing this marketplace are what led to us realizing the need for a different type vertical and creating Api three. Just the kind of Tl the heart anyway. Yeah. Thanks Dave. Thanks for that background. Jar, what about yourself? ", "start": 56.86393, "end": 138.34584}, {"speaker": "1", "podcast": "Dave looks like an Og, he's been in for... From two thousand thirteen, whereas I started on two thousand seventeen, year on the first Bull run where bit bitcoin went twenty k. I joined around, like, the beginning of the bull run. I to. And then, like, the whole bear market happened, and I sort of kept up with the scene that wasn't really that invested. Until I saw Uni of V do launch. And when I saw what Uni of we could do on chain, I became bullish on, like, crypto development as a whole. Before this site was working as a developer for a Web two company, But as soon as I saw, like, the possibilities that D defy enabled in the web three space. I started learning solidity and also running smart contracts of my own. The first thing that I realized was that for D to scale beyond just on genes stuff, you need ten data as well. And then I started looking into what Oracle projects there are. Unfortunately, there weren't many, just one. So I felt like there needs to be more Oracle solutions and that's how I stumbled upon Api three and help them build the Oracle ", "start": 138.99757, "end": 223.1702}, {"speaker": "0", "podcast": "space. Yeah. Oracle definitely provide. A huge need within the defy space specifically, which is what my what I focus on at the Poly gon team. But Dave, I think you might be a good person to ask this question to since you brought up colored coins. And if you're bringing up colored coins and you know what you're talking about. That means you're an Og. So I would like to know just kinda you I think the Oracle problem was the issue that everyone was trying to solve for a while. Do you think you could go back and kinda tell us the beginnings of the oracle problem and what actually is the oracle problem trying to solve? ", "start": 223.7033, "end": 259.98914}, {"speaker": "2", "podcast": "Thanks, Justin. Yes. So the Oracle problem is about not trusting a single third party to put data on chain. Smart contracts can't natively see data that isn't contained on the blockchain itself. So in order for a smart contract to use external data, it needs to be brought on chain and the entity that does that is called in Oracle. So the problem with Oracle were is that if you're a big off chain data provider, and somebody wants to use your data on chain. You're entirely reliant on whoever operates the Oracle to relay relay that data on chain correctly. So you could have the best data source in the world. But if the Oracle decides to tell you smart contract the Bitcoin is one dollars, all of your people on your protocol call are probably going to be liquidate. And the data source can't necessarily do much about that. So one of the problems that we're addressing with Api three is the Oracle problem. But we've approached it with the point of view that the oracle problem is miss post. The Oracle problem historically is that you don't want to trust a single third party to put data on chain. And we think actually that by assuming you have to use a third party the problem is poorly phrase. And historically, this is because Oracle software is pretty difficult to operate. So Coinbase used two full time blockchain developers to maintain their own internal oracle that people can use. And if you're a big data provider, maybe that's okay for each to do. But if you're well, the majority of Crypto price data providers don't necessarily want to hire two full time blockchain developers, so you end up with these specialized companies that run our calls call Api data and put it on chain. And I think the first of those really was Oracle or the first that I'm aware of anyway. And they were kind of this single oracle provider would put data on chain, charge per call. And that's one of the I think it's one of the examples Chain it used fairly early on as being a centralized oracle that's subject to the Oracle problem. So with Ap three, we realize that actually the core problem isn't not trusting a single third party. The core problem is using third parties at all. So we've created oracle that data providers able to operate themselves, so that data can be relayed directly chain without this third party layer that can mis report data. Right? So, I guess that's the difference between ", "start": 260.95816, "end": 401.20602}, {"speaker": "0", "podcast": "a first party Oracle versus a third party Oracle. And that's what Api three provides is a first party oracle if I understand correctly. And I would like to know like the differences between the two and I guess most people are more familiar with with chain link obviously, because that seems to be the most popular oracle provider at this time. And is that a third party oracle or how would you describe them in compared to Api three? ", "start": 402.06442, "end": 428.96}, {"speaker": "2", "podcast": "Code described chain as being a third party Oracle by design. There are some more advanced data providers that are able to operate chain link nodes as a first party oracle. So calling them just a third party of Oracle would be doing them a disservice. But it's not designed primarily for that use case. So oracle is designed to be easily operated by any data provider without them necessarily even needing to handle cryptocurrency or any tokens or anything. So it's designed from the ground up for that purpose. Whereas chain isn't you have to top up gas wallets you have to use link tokens to call it So for a lot of big Web two companies in regulated spaces, that might be a significant roadblock to preventing them running it in a first party use case. ", "start": 430.08972, "end": 472.892}, {"speaker": "0", "podcast": "Okay. And then, you know, typically with the oracle, well, just with blockchain in general, I guess, like, there's always these incentive mechanisms to make sure everyone all the players are operating truthfully. Right? So can you shed a little light on what are some of those economic incentives that I just make sure that everyone using the Api threes data feed and providing that data is acting truthfully and inappropriately. ", "start": 473.54352, "end": 501.81903}, {"speaker": "2", "podcast": "So this is a pretty good question and stop me if My is getting too involved. So Api three has an approach to economic incentives designed around incentivizing the Dow, because Api three itself is a Dow. And with Dow, you want to make sure that the incentives are structured to create the outcome that you want. So the Tl it is that Api three, Dow members, guarantee that the data provided by Api three when we launch our data feeds will be within a certain percentage and there's a risk coverage protocol that's used to back that up. And the reason why this makes a lot of sense for us anyway, is that we've designed the incentives to make sure that Ap three is governed for the long run. Is governed around not providing bad data and is governed in a way that the people choosing how the data goes on chain and what data source are used are the ones who back up their choices with their stake. So in order to participate in governing Api three, you stake through Api three tokens into a staking pool. This staking pool is used to collateral and we coverage service. So while you're staking, if there's an event where data that's incorrect or too high deviation or not the real value is pushed on chain and people lose money, the affected protocols can claim through the risk coverage service. And they can have up to an agreed maximum paid back and that comes directly from the staking Pool. So if Ap three governs feeds badly, it's not the protocol users who lose out as a result. And to kind of counter balance this people who stake into Ap three pool, they get governance rights. So you govern how the feeds are created and how the products are created. But you'll also get paid percentage reward in effect for staking and that vests for a year. So that means that if you're governing, you're incentivized to govern the protocol in a way that will retain value and build on it. Over a year or over the long term, but also not create mistakes and create bad products in the short term. So I guess the way you guarantee that the the product is good is by putting the people who build it on the hook. ", "start": 502.29758, "end": 648.682}, {"speaker": "1", "podcast": "I think one thing you miss Davis is that we also pay part of the revenue of each That subscribing to a data feed to the Api providers themselves. So they have an incentive to provide the right data? ", "start": 650.61, "end": 663.89764}, {"speaker": "2", "podcast": "Yeah. So that's true The other side of that is that if you think about other Oracle projects, incentive models. So ones that are designed around third party node operators staking and the minorities of the node further so from the median getting slashed which is meant to incentivize the correct data being provided. If you successfully gain a fifty one percent share of the third party notes and bear in mind, data operators or data providers generally big companies, it's quite hard to gain control over them a lot have been in the real world for longer than bitcoin has been around. Compared to node operators, the generally quite small businesses, some won't even have identified team members on their website. So if you get fifty one percent of node operators, you can push bad data to chain. And in most Oracle operator staking models, you wouldn't be penalized. Because you're the majority. So how do you get around that kind of problem where the majority can still be wrong? Is you have this kind of, like after the time, risk coverage protocol. So that kind of attack would punish Api three for not doing successful due diligence on the Api providers that are chosen to make up a feed. So it's kind it's a different incentive model, I think to the majority of our call providers. And one that means people don't lose money as a result. ", "start": 664.8563, "end": 748.44745}, {"speaker": "1", "podcast": "Sure. Do have anything else to add to that? I think I think Dave card did pretty well. I think it's... If the the key thing to point here is that if everyone acts in like in the right way, it's a plus model for everyone, where that you have cheaper feeds. You have more transparent feeds and this is also more I would say just because of the transparency, it's more secure because the aggregation, everything everything happens on chain. So you know where the data is coming from, and you know who's pushing the data. And because of that you have a job, should entail a feel more secure about using Api three, especially because you know now also have risk coverage. Right? So I see this model as being like the future of Oracle ", "start": 749.4971, "end": 805.16595}, {"speaker": "2", "podcast": "where you have transparency over where the data comes from. Rather than now where like you don't really know where the data comes from. Yes. I think this is a pretty important point. So I'm just kind of elaborate very slightly on it. So one of the other differences that's implied in the difference between first party and third party, but maybe not completely apparent. Is that the data source is putting it on chain directly. So and blockchain is an any immutable record that will exist probably forever. So if you're a big real world data provider, putting data on chain. If you try to attack a data feed, that's visible and audit and you're directly accountable for that. If there's a third party node layer in the meantime, if you try to tech the feed, it probably would be assumed that it's the third parties, or you certainly would have a bigger degree of and it would be more ob in the event of for third party Oracle protocol. So you tie data providers real world accountability much better into data feed and you can also tell the number of sources. If you have a data feed with twenty one third party Oracle on, how many sources are being used? It doesn't really give you any information about that? Because they could all be using the same Api. Whereas, if you have five, six, seven ten, however, many different first party sources, you know that you're using different individual data sources. And you know exactly who these data sources are and their O addresses will be link to different websites for the companies. So you can tell exactly how feeds are constructed. And also the governance of this what sources are used is all decentralized as well through Dow. Whereas with existing Oracle projects, you have centralized company choosing which third party nodes are used. So we try to make everything is decentralized and open as possible for the whole thing and we think that that gives people the ability and a better ability to look at a data feed, inherently assess like how risk it is, how reliable it's likely to be And then we will source Dow are doing that and we're willing to guarantee that by putting our own money on the line. ", "start": 805.62476, "end": 935.9498}, {"speaker": "0", "podcast": "Okay. Can you go into a little bit more detail about the roll of the dow? And what exactly do the dow or the I guess, Api three token holders have governance power over? Or where are they voting on within the Dow? So currently, Api three token holders are voting ", "start": 936.759, "end": 954.62}, {"speaker": "2", "podcast": "So ar Dow is an Oregon fork, which uses the percentage of tokens that you have in the staking pool as your percentage of your government's rights? And currently the main role and the main voting activities are around the Dow appointing teams to serve for various periods to build out parts of the protocol. So there's for example, a S on the core technical team, which is building the main smart contracts for the data feeds, which had also built out the main smart contract for the main da itself. I'm on the business development sub team. So we have various different roles and responsibilities to the in business development. There's various different sub teams can also apply to deliver a specific product. So there's a sub team that's built out that's exploring kind of Me tactics around Oracle at the moment. And there are other sub teams with very specific responsibilities. So in terms of how this looks, it's almost like the Dow giving grants to teams to fulfill specific objectives. If they fulfill that objective and deliver the deliverables, they'll then normally, if they're looking to continue being given Grants by Api three, they would then come up with deliverables for the next proposal. If they delivered the previous ones successfully then that tends to look good with them. We see people and teams are not delivering, then it's likely that they probably wouldn't have success proposals past The overall aim is to try to tie these along what tie these kind of milestones together with what we expect Ap three to be. Using the kind of the white paper as a guideline for what votes are or for what votes what people are voted for to try to get towards which is kind of fully decentralized dow government data feeds with risk coverage. Yeah. And Dow do tend to be very horizontal, ", "start": 955.0891, "end": 1064.3999}, {"speaker": "0", "podcast": "and it can be very slow to get things done. I worked with a dow for a while or for a dow. However you wanna say that, the index coop op. I was with the index coup for a while. Yeah. And so I don't know, like, what, you know, operating a protocol like this in Oracle. It's does Api three does seem to be very dow focused in horizontal by design in that regard, Like, what kind of struggles have you seen comparative to operating in a more centralized fashion for protocol development. ", "start": 1064.7, "end": 1094.108}, {"speaker": "2", "podcast": "I would say it can take longer to make decisions, because there's no one person at the top saying you have to do this. There you need to have a kind of consensus between different sub teams in order to work at how to move forward with something. We're not the kind of doubt that has a snapshot vote over everything. So our votes are all on chain and designed to move tokens for grants for teams to deliver certain things. So a lot of the decisions are made by teams that the dow has voted as taking on a certain duty. Or teams that have come in to deliver a product, the teams then have free reign within their proposal over how they plan on delivering it. And obviously, if the doubt doesn't like that proposal, it will be rejected. They'll will be word it, come back and then the proposal explaining how things should be done, but that passes is what we expect them to do. ", "start": 1095.866, "end": 1143.2261}, {"speaker": "1", "podcast": "S, do you have any comments as the core protocol developer? Yeah. Just to add to that. It's not that Like, within the teams, there's definitely hierarchy, like who handles what, who is in charge of doing more, there's usually a team lead who in, like designing the structure and then del tasks to different individuals. So it isn't as horizontal as say, one would think. It's usually more like the different teams are horizontal and within the teams there like a hierarchical structure. I would say. Yeah. I was hoping to see, you know, in the bull market, maybe a lot more ", "start": 1146.2744, "end": 1183.9135}, {"speaker": "0", "podcast": "innovation related to dow structuring and I don't really think I've seen a whole lot of that. But I do like the concept of pods or sub teams or sub downs, and it sounds like that's kind of the structure that you all have been implementing or have implemented? Would you say that's fair? ", "start": 1184.4465, "end": 1201.2216}, {"speaker": "1", "podcast": "Not in code, but in, like, Like, if you would think of a though, it's its own governance on chain that does stuff. But it's not in code. We do it internally. But we we do think that for every chain that we launch Api three. At some point, there is gonna be a sub for them so that they do their governance for that chain there. And, like, Api three as a whole is just like a mean governing body for the protocol itself. Oh, that makes sense. Chain specific dials. Yeah. That makes sense. ", "start": 1202.4918, "end": 1238.6223}, {"speaker": "0", "podcast": "But let's talk a little bit more about, I guess, the tech stack related to Api three. I know you have something called an air node Can you describe for our listeners, what exactly is an error node and how ", "start": 1239.6742, "end": 1252.4886}, {"speaker": "1", "podcast": "is that involved in Api three's protocol? So The is basically a very lightweight node that pushes data on chain and also listens for requests on chain. It's a bit if anyone here is somewhere with Aws or Gcp, it's a server function that's hosted on the crowd. And it could be run by basically any run with Aws account or Gcp account. And once they run it, they can just let it run basically perpetually and it would listen for request for your Api. And then fulfill those requests. So having set up this infrastructure that makes it so seamless for the data providers to run such a such a node makes it possible that these data providers or Api providers they don't need to deal with the technicalities of running blockchain Oracle mode. All they have to do is run the one command. And they're they're done. That's it. Everything else, like, the the dealing with the blockchain tokens or things like that. They don't have to worry any... About any of that. So this is what like, air mode enables. You as a user, do need to suppose you you're using Adapt that uses a end node as a blockchain article. You as a user don't need to, like, communicate with the blockchain pro node operator ever. All you have to do is just top up the gas wallets on your own, and you can make your request. So It's a pretty, like great... As a as a even as a third party node, it would function pretty well. But for a first party mode, it's like the ideal solution. ", "start": 1252.8667, "end": 1370.3915}, {"speaker": "0", "podcast": "Yeah. And also included that tech stack you know, I think it's helpful we'll also to just kinda lay this framework of, like, how Api three's data feeds are constructed from a response request to the beacon and then the beacon sets as well, S, if you can answer that as well, that'd be helpful. Right. So the request response protocol is basically like after ", "start": 1371.1852, "end": 1393.3522}, {"speaker": "1", "podcast": "name suggests you make a request on chain, and then it calls the picks up that request it calls the Api, gets back the response. And then the A node delivers that transaction launching with the data of that Api. So it's a simple request and response flow. As far as Beacon score, they are a continuous feed of data that is streamed on chain. And this is like one particular type of data. So this would be relevant in price feeds. Where you just won the price of say usd. The beacon of Usd would exist on chain and the earn would be streaming down the price every. So like every interval or at a threshold so say, you can define threshold, say one percent So if the price of it goes down by one percent the end would then stream the data to the blockchain. So that's what a beacon is. The thing with beacon is, it's only single force. So you can only make a beacon auto something from one air node. So that that air node is the single source. A beacon set is just a combination of beacon. That you aggregate on chain to get the final value. So now instead of one error learn you're getting the data from, like, let's say, five nodes. And then you get the aggregated value and then you push that not pushed was already on chain. And then you aggregated and then you store as the final value for that beacon set. So that's basically how, like all these three different products work. We're in the process of launching Beacon sets pretty soon. So, yeah. Look forward to that. ", "start": 1393.7429, "end": 1507.3762}, {"speaker": "0", "podcast": "So as big that's just a way to get an average of data or ", "start": 1508.1904, "end": 1512.9304}, {"speaker": "2", "podcast": "should you could swing. It's the median ", "start": 1513.2305, "end": 1515.4705}, {"speaker": "1", "podcast": "Five values. So ideally like the median value. ", "start": 1517.0044, "end": 1520.1918}, {"speaker": "0", "podcast": "Okay. And that's just specific to bright the price data. Correct? ", "start": 1520.8292, "end": 1524.0963}, {"speaker": "1", "podcast": "Correct. So you can only do beacon sets of things, which are, like, have a range of value. Right? You cannot Like, if it's something definite, like say a word, you can't really do a beacon set of that. Right. Exactly. ", "start": 1524.828, "end": 1539.8065}, {"speaker": "0", "podcast": "Well, and what happens if one of these error nodes submits a non truthful set of data? And how do you even determine what is non truthful. Right? Because if you say bitcoin price is twenty thousand seven hundred and fifty, But in a... But an error note it's twenty thousand seven hundred and sixty. It's not that big of a difference. It's probably close enough depending on the use case. But how would you determine that it was someone's acting malicious? ", "start": 1540.6184, "end": 1571.432}, {"speaker": "1", "podcast": "So this is a good point and this probably ties into the risk coverage thing where, like, you cannot ideally say that this is the wrong value. It might be the value that's coming from the exchange or whatever, the notice is posted on. The gap using this data feed can make a claim that this value was wrong? And then we at Three would then look in and check that and see that if this value was truly wrong or mis reported. And then the da would claim coverage and basically they would get the coverage amount as as compensation for the wrong data being pushed. So we do our due diligence before choosing a data feed, like we have internal tests that go through the Api and see how like how much it deviate from the median in historical values. So before we choose our data provider. But there might be instances where this does happen. And if it leads to funds being loss loss for debts, then there's always the coverage. So yes. ", "start": 1572.3827, "end": 1649.1569}, {"speaker": "2", "podcast": "Just to add to that as well it's we think that in order to have a reliable risk coverage protocol, trusting just Api three to always make these payouts could be seen as a potential vulnerability because Api three might not want to pay out. So we also use the third party arbitration services kind of a layer of appeals above that. Because if it's pretty obvious that it's Api three fault and we'd have to pay out anyway, we can pay out But if we say, no, we actually think this is the correct value, because As Charles said, there can be levels of subject around this. Then there's a third party arbitration service that we're working with Cla to provide where they can appeal to Cla and go through the Cla procedures to basically to keep escalating this if they want to try and claim. And we if they pass through if they win at Cla then that's paid out from the Ap three stake in Paul anyway. Yeah. Interesting. Interesting. Yeah. I ", "start": 1650.3539, "end": 1707.031}, {"speaker": "0", "podcast": "I saw a lot of talk around those third party arbitration dow or third party arbitration protocols. A couple, a few years ago, but it just never felt like it took off, but this is y'all have found a use case for this from, I guess, just making sure these error nodes are providing or these Apis are are submitting truthful information, I guess? Yeah. What kind of did you did you explore any other third party arbitration systems or how ", "start": 1708.2855, "end": 1738.5654}, {"speaker": "2", "podcast": "how did that partnership come about? So we've been speaking with Cla for quite a long time. It seems a lot of the initial arbitration systems that came about especially Arrogant Courts were just Cla Forks anyway. And Cla team were pretty helpful in when we were initially looking at the design all of this. And we think that their crypto economic incentive structure around arbitration is amazing. Well, I do. So I guess Can't speak for. But I like the way they've struck at everything and they're by far away the arbitration service that's had the most usage and hasn't seen any problems with it so far as well. Yeah. Absolutely. And what about the cost to ", "start": 1739.3197, "end": 1784.1068}, {"speaker": "0", "podcast": "da or developers when they want to I guess, pull data from Api three like, how does that compare to other, I guess, competitors in the space, like chain link or or teller ", "start": 1784.5619, "end": 1797.641}, {"speaker": "2", "podcast": "Yes. So one of the other advantages in using first party Oracle to construct data feed is around the cost involved in creating a data feed. Third party oracle aren't charities. So if they're putting data on chain, they want to be paid for it, like they need payment for the services. So you're in effect paying the data provider and a third party node operator, and then you also have the gas to put the data on chain. With Ap iii data feed construction, the data provider gets paid and the data provider puts the data on chain. So you cut out a layer where people could be putting full data on chain as a third party. You make it more secure, but you can also construct data feeds more cheaply. Because there are fewer parties to incentivize in all of this. So we think the cost of us providing data should be cheaper. Obviously, we can't share any figures with everything about that with you right now on this call? ", "start": 1798.1897, "end": 1857.3702}, {"speaker": "1", "podcast": "So There are us... There is a service called q g that we launched, and that is completely free to use actually. So just to demonstrate how efficient Anode is. Q is produced, the only thing you pay for is the actual gas cost for the transactions themselves. And that does... Like, that isn't, like asking for any tokens or anything like that. You you just pay for the transaction gas cost. And you can use it yourself on poly. I think it costs like zero point zero zero zero zero five Mat or something like that. So this is a way to like request very cheap random numbers. And in essence sense, like any request response protocol, especially on a L two chain like mat would be very cheap. Almost in significant amount. And we have people on Poly gon and other chains building perpetual protocols using R p and our data feeds. I can't name them yet because they don't wanna come out. But So they essentially use R the request response protocol for opening and closing the perpetual positions. Which has its own advantages and disadvantage. Just one of them being, you don't need a constant data feed. So Looking forward to, like, when that happens. And the other thing the the cost for running a data feed is Again, on an l to chain, it's for us one person percent deviation threshold is pretty low. But the actual cost the user, I think we haven't determined yet what we're gonna charge like the da. It's still being worked on, so we can't share it. We have some figures in mind. But... Yeah. It's gonna be pretty cheap. It's gonna be more cheap than most of what people expect. The only thing that would add to, like, the cost is the premium itself, which would cover the coverage. So the premium amount you can... It's a very... It would be a variable amount, depending on the amount of coverage you want. So, like, if you want a very large coverage one. You pay an extra premium. ", "start": 1858.3303, "end": 2000.1053}, {"speaker": "0", "podcast": "Are those the D apis, the the service coverage? Well, I guess on that note, well... Before we get into that, actually, I wanna talk a little bit more about q r and g and Could you also just define q r and g for our listeners? And maybe, like make a comparison to chain links B in? ", "start": 2001.1453, "end": 2022.4783}, {"speaker": "1", "podcast": "So, yeah. Q stands for quantum random number generators. They are basically, we partnered up with Australian National University and their quantum department. And we asked if we could use your machine apparatus to, like, serve random numbers on chain. And they've at first they were confused, like, what? But at second year, like, okay, we see the use case the flu sound cool. And we partnered up with them and they set up an air node in their in their lab, and we basically use that to stream like random numbers launching. The reason why we made it completely free is because we believe, like random numbers shouldn't cost so much. On all of these chains. So basically, it's of free utility service that anyone can use. And the comparison with Vr would not be fair because we are to to its credit offers a degree of assurance that the random number that's pushed is, like, actually comes from a seed. So you can verify the random number. In this case, you can't really verify the random number. But view you it's coming from the quantum machine directly and that has to, like, push like a real the number. The one way we are thinking of making this more secure is providing a service on top of q called D q g, which is decentralized conference number generators. And we are partnering up with a bunch of q and g p providers, one of them who we recently partnered it up with was Qui, which is a pretty big player in the random number space in the quantum number space. And the reason why q d q g would be more is that if you have just one random number, you... And if you make, like, I'm getting into a bit of math here. But if you just have one random number out of five, you just take the xr of that one random number with the five. Even if the rest of the four are compromised, you would still get back random number. So that's a very easy way to make this more secure. And also more ", "start": 2024.8007, "end": 2173.7695}, {"speaker": "0", "podcast": "cheaper first particular land as well. And who was the individual that Joe worked with? At that university because I think I interviewed him on Twitter spaces. Yeah. I think it was Aaron, ", "start": 2174.1497, "end": 2183.8882}, {"speaker": "1", "podcast": "Me and Aaron gave that interview together. Yeah. I remember that. Yeah. He was talking about quantum entanglement and all those other things. Yeah. We got a little off topic. Glenn. Maybe we'll try to stay a little bit more on topic ", "start": 2184.9204, "end": 2196.4907}, {"speaker": "0", "podcast": "on this interview. But, yeah, and in that regard, going back to Da apis and service coverage, can you get into a little more depth on what is service coverage and how does service coverage in relation, the Apis change the incentives behind those operating ", "start": 2196.8665, "end": 2215.0596}, {"speaker": "2", "podcast": "oracle networks in general. I guess the main thing is that it makes the people who are choosing the data that's supplied responsible for choosing the data well. Whereas you see the other Oracle projects that I'm aware of, don't do that and where there been errors and people have lost funds, there's no recourse for them. So there's no compensation that I'm aware of. ", "start": 2215.7598, "end": 2241.625}, {"speaker": "1", "podcast": "Right, the there's been case of especially on like Salon and stuff where like bit report mis report price when, like, things were crashing down and stuff. So I guess the... That's what Dave is getting at. It's, like, with with oracle services like these, you don't really if there's no risk coverage in place, there's no guarantee that the organization or the Dial or whatever, choose the right data provider. For the service. And I think that's why having risk coverage is so important because without risk coverage, and Oracle is does not have any liability. To solve the right data. ", "start": 2243.9597, "end": 2288.3455}, {"speaker": "2", "podcast": "Like in case it serves the wrong data? I guess the other question is why don't why can't you make data to provide a stake and have it slashed if they provide the wrong data, which is a good question. The short answer is that they would say no. And it would be hard to get big names on board. The other side to this is effectively because they're providing data from a first party point of view. They stake their real world businesses on it. And these data providers aren't worth small amounts of money. I mean a few years ago, coin market capital bought by Finance for four hundred million dollars So that was a few years ago before Oracle and before data provision for blockchain was as big as it was now. So I think you'd see bigger evaluations now and having a approval record of putting full data on chain would pretty significantly impact that. I think there's one more thing to add That that really take consideration as that for a lot of data, there's only a single source. ", "start": 2289.1428, "end": 2346.2468}, {"speaker": "1", "podcast": "So like, if you consider things like metal prices or stock prices or things. It might be the case that it's only coming from a single source. And that data actually originates from just one source and everyone else just use that source. So if you have a data provider, that's let's say, some big stock index fund or whatever. And it's running air note itself. You can't get any better source than that. Right? Everyone else is just calling their Api within their own Api to get the data. So in essence, the the the only way to make sure an arc words is that the source themselves host the data, in case of these instances where there's only one source. ", "start": 2347.046, "end": 2404.1}, {"speaker": "0", "podcast": "Yeah. That makes sense as well. And can can app developers requests specific data feeds, like let's say, if they wanna get information from Acc weather specifically, or if they want the coinbase price for Bitcoin, Can they request ", "start": 2404.6602, "end": 2419.9248}, {"speaker": "1", "podcast": "that specific data feed? Yeah. It's pretty easy for Ab developers to, like, use in node, like, just use Da node address. And within their Da or smart, and then they can make a request to any of the air notes that have been deployed. So it's a pretty simple process. I actually walked through with staff from the Poly gon dev team a few days ago, and I explained to her like, I think that'll also go up on your pitch at some point. And it's just me walking through explaining how you can deploy an air node and then call the Api and how you can call any Api like that and any air node. So It shouldn't be too hard for any data developer to just basically start using an node right now. And if they are interested in learning more, they can head over to our docs our docs are pretty extensive for the for da developers. And also they can ask for support in the discord chat where, like I am usually online, most of the are. ", "start": 2420.3777, "end": 2490.1628}, {"speaker": "0", "podcast": "So what what teams are using Api three right now on Poly gon, if you can think of any. I I know that I know that you're your data feeds are still on test it right now. But, yeah, who who's using it right now? And when do you think we're gonna go to magnet net or is that alpha that can't be leaked yet? ", "start": 2492.4133, "end": 2511.0298}, {"speaker": "1", "podcast": "It's sort alpha. Can't be leaked. I think for there's two projects that I'm closely working with on Poly, and I can't name them yet. That one of them is a up and coming lending platform. It's not it's not live yet. I can give you that much. It's not live yet, and I'm working closely with them for a very interesting use case that they will share pretty soon. Because air notice so versatile, the use case. The second gap is the one I mentioned, that's you building the perpetual protocol, which I also can't name, unfortunately. There's a problem with, like, having being in the building phases that you can't really name all of these. Gaps there are gonna be used. Because we don't have our data feeds out live yet. And if we had them out live, we could, like, get apps on board to users and then we... The I could tell you oh this app is using us, but they can't use us because we're not live yet. Right? So The other... I I know ", "start": 2513.408, "end": 2588.9614}, {"speaker": "2", "podcast": "I think Game knows that if there are q g dots that use q g. The... I know that at least one on Poly. I'm not sure of others because our monitoring was down and still is down. I think Aaron look into for that. Right. So because Q g is a decentralized free to use protocol. We don't make people speak to us or do anything in order to integrate with it, which is great when it comes to having an open protocol anyone can use, but bad when it comes to me giving you a list of names. ", "start": 2589.3389, "end": 2619.1938}, {"speaker": "1", "podcast": "Unfortunately, just so sorry about that. I know I've received, like at least ten or twenty request on how to use Q on the discord chat. And I think a couple of them were Poly on. But I haven't really took the time to, like, learn who they are. Yeah. That is kind of the funny thing about building ", "start": 2620.47, "end": 2637.196}, {"speaker": "0", "podcast": "completely open source and permission list protocols is that you have a lot of teams that are building and using your protocol and you might not even know that they are doing it. Unless you're just looking looking at some analytics, I guess. But what are some other, like, interesting use cases that you could project for Api three and some kind of unique data feeds. It's like maybe something in the insurance or in the D defy gaming space, what kind of ", "start": 2637.9905, "end": 2663.8784}, {"speaker": "2", "podcast": "Da have on that. I think one of the best things about the request response protocol and having so many different data providers. So we have one hundred and eighty odd probably more by now different Api providers who are running or going to run Air node in order to be able to supply data to Web three. I think there's huge potential for para insurance in that, because para insurance by its nature needs like will benefit from having lots of different data types to crypto price data because although would be nice to ensure against prices going down that doesn't seem to be a use case. So but things in the real world like ensuring crops against drought, ensuring houses against floods, these are all things that need data that would be very specific, very local and you wouldn't have a constant stream for being fed on chain. And you'd probably only need to query once at the time the policy finishes or if somebody wants to say I want to make a claim. So and that kind of product benefits U from having the data available to create it. So I think that's the case where you have to make the data available to create the products. So I think the request response style works very well for that. We have as a use case, the kind of highlights of request response, so I think it's on main net where people are using it, there's adapt that's being built to and it uses sections dot com's Api. I think to query if your wallet has been sanctioned. And you come commit into sell bound N if it hasn't been. So this would be a way that Protocol that are looking to limit users to people that haven't been sanctioned, could you do that in a way that's I want to say more decentralized in a way that's more Web three than just blocking front ends. So And whether or not that's a good idea on what I agree with necessarily is beside the point, it's a different use case and something that's not crypto price data. So ", "start": 2664.505, "end": 2780.3362}, {"speaker": "1", "podcast": "Okay. I think one more thing is, like, ties to what you said David. It's like, the identity layer of D five, which will given the current political political climate might come into play where we have d five being segregated into two. One is that is permission And the other that is non permission. And for permission To work, you need identity verification on chain and that would only be possible through first party Oracle is what I believe and And so, like, what you can have is someone like the bank running an air note and people basically whenever they want to make a trade, they have to, like you or their notes for permission. Before making any sort of trade or like, after they make the trade they make a request to the bank that I've made this trade and that that goes there. So I I see a lot of use cases or maybe you can hold the bank and nlp that allows you to participate in this school that's wouldn't be possible unless you have the first party oracle system. Right? Because there there's been a lot of, like, rumors around Uni swap and how they're in big trouble with the Sec, the Whatever. So I... I've talked to a bunch of folks regarding D fire and what the future holds and I I see, like, even though a lot of them are bullish, they do see this divide happening soon between permission, and non permission. And ", "start": 2780.8516, "end": 2882.4255}, {"speaker": "0", "podcast": "I think that's where Oracle could play a big role. Yeah. There are just so many untapped use cases for the Oracle technology and the Oracle protocols that are out there because it is still fairly new. I mean, I think, you know, the oracle problem has been presented for... It's been there for a long time. But I think once D defy really started ramping up, is when people really started to pay attention to the potential use cases of Oracle technology. But something else I wanna touch on is just kind of some misconceptions related to Api three. Like, what are some common misconceptions about Api three and Oracle that you feel yourself constantly addressing with maybe developers or just educating new users to the Api three protocol. ", "start": 2883.2148, "end": 2933.0266}, {"speaker": "1", "podcast": "I think the biggest two one is that to use any of our products, you don't need the Api three token. So I think a lot of people assume that to use a q g or the data feeds or anything else you need the token whereas that's not the case. The only thing you need is for especially for your request response at the moment is just gas, the gas of the chain. You're working on so for Poly and Dramatic? ", "start": 2933.5066, "end": 2960.136}, {"speaker": "2", "podcast": "I feel like one of the other one of the other misconceptions that we see quite a lot is that off chain data equals crypto price data. And that's is the innate assumption among almost anyone when they start talking about Oracle calls they just think crypto price data. And it's kind of understandable because if you look at the state of data feeds at the moment most of them are price data there's a few Forex feeds, the odd T asset. But people haven't really gone down the like the traditional asset, traditional market routes. To any great degree. So I think even within the kind of the limited scope of D defy, there's potential to make it a lot more interesting by adding more assets and more types of assets. ", "start": 2961.493, "end": 3004.9138}, {"speaker": "1", "podcast": "Right. Yeah. I definitely agree with that. I think a lot of people are fixated on crypto prices. Whereas there could be many other use cases that the could enable. But just on topic of like the first misconception, then you do subscribe to a data feed, the money that is used to, like, you buy in Usd dc c, Right, are the native token. That's the only to be supported at the moment. Usd dc are the native of token for data feeds. And the data... The money is then used to buy back Api three and then burn it. So that's how we sort of ensure that like, that the token retains its value instead of just being a deflation token. In safe inflationary token through taking. So the buy back mechanism sort of offers a deflation mechanism, which helps cure the value within the Api three token. A lot of people don't know this about about it Api three as well that there's d. I think I can't think of any other misconception people have. I think the name makes it pretty clear. Api three, what Api three does, which is probably a good thing. Like it brings Apis is to web three. And I think that sort of for four group the surprising deals, it's easier india to explain to ", "start": 3005.633, "end": 3102.2546}, {"speaker": "0", "podcast": "non Web three users than it is for Web three because in Web three, mind people think of Oracle, they think of crypto process. Right? Like, as Dave said. But, like, if you talk to any the two people or web two providers, they'll usually understand what we we meet... What we trying to do. Yeah. And I'm I'm glad you touched on the name Api three because that is a question that I have started asking my guests is why did you... Why is the protocol named to the way that it is, but I also felt like Api three felt pretty self explanatory. But I'm glad you touched on it anyway, Sure. So we are running up on time here, but before we go, I just wanna kinda give you all the opportunity. You know, is there anything else that y'all wanna talk about specifically or any topics that you wanna touch on that we didn't get a chance to address ", "start": 3103.1077, "end": 3144.023}, {"speaker": "1", "podcast": "I then from my side. Nothing for me. I think I've covered everything I wanted to. Alright. Well, I really appreciate you y'all being on the show. And before we sign off... I think... Oh, you got one. Sure. Yeah yeah. So I've been working on a of, like, guides and demo projects. And if any of the developers are interested, they can hit me up and we can like, probably we can schedule something together and have, like, a workshop or demo session. That's something that we are exploring more and more at Api three in creating these guides, general purpose class not even related to Api three. So that like the Web three ecosystem as a whole expands. Because at the moment, what I see is there this, like, a surprising lack of guides and tutorials for web three. Like, I'm not talking about, like, the basic guide, I'm talking about, like, end to end guides. Like, if you try and look and see, like, how to build a a uni swap b two da. Right? You're not... You maybe you might find something about the contracts, but you will find nothing about how to focus up the into the contracts and stuff like that. So I'm trying to bridge that gap so that people can quickly join web three and start building really cool things. Because I I think the biggest barrier to that at the moment is not the lack of money or things like that. It's just the lack of resources. As particularly in the tutorial of and guide section. So if anyone wants to work with me on that, I'd be happy to, like, collaborate. ", "start": 3146.4822, "end": 3242.1665}, {"speaker": "0", "podcast": "Yeah. Developer, talent and dev resources are an incredibly scarce asset in the blockchain space. So But, yeah, before we sign off, I just wanna give you all a chance to let our audience know where can people go to find out more about the two of you and Api three. You can follow me enter ", "start": 3242.6614, "end": 3262.6182}, {"speaker": "1", "podcast": "Ash sure do Head, and I... I'm not usually posting stuff there, but I usually do post things when there there are my guides are out or Api three has a significant update. You can also find me on discord on the Api three of the discord. So if you have any debt related questions, you can ask me there. ", "start": 3263.0745, "end": 3286.4583}, {"speaker": "2", "podcast": "But yeah, I'll pass it on, Dave. Yeah. I would suggest for people looking for general information about Ap three. Our websites quite a good place to go just to get links to most of the resources. That's just Ap three dot org. This discord good for any kind of development resources, I'm in the discord and in telegram well. So if you've got any questions about how your protocol can use data, any requests for certain data types, you're welcome to message me about it and I can transfer you out with that. Otherwise, not even worth falling my twitter around barely active. To be honest. I I would go with the shots for that, but also the official Api three twitter is a good resource. ", "start": 3287.6555, "end": 3325.6274}, {"speaker": "0", "podcast": "Awesome. Thank you for that. Yeah. And this has been a really enlighten and intriguing conversation for me. And for everyone who's listening and watching, Thank you for listening and watching. Youtube, but Poly Tv, Apple, spotify, Please like subscribe, follow, hit the bell, all those fun notification things that you do for podcasts. And thanks again. As are and day, and we'll see all next time. Thanks everyone. ", "start": 3326.5994, "end": 3353.5806}], "summaries": [{"title": "1. Exploring Decentralized Finance and Web Three with Api three: A Background on Crypto and Api Three", "summary": "This text discusses an episode of the Polygong Alpha podcast where Shah Shah and Dave Connor from Api three are interviewed. They talk about decentralized finance, Web three, and the crypto industry. The participants share their experiences and how they became interested in cryptocurrency and Api three. The text also discusses the author's journey in the crypto space, their interest in Dogecoin and Bitcoin, and their discovery of the potential of blockchain beyond financial transactions. It highlights the importance of Oracle solutions in decentralized applications and Api three's approach to solving the Oracle problem. The text also explores the differences between Api three and Chainlink as Oracle providers."}, {"title": "2. The Importance of Oracle Solutions in Crypto Development: Addressing the Oracle Problem in Blockchain", "summary": "This text discusses the importance of economic incentives in ensuring truthful and appropriate behavior in the use of Api Three's data feed and blockchain technology. Api Three uses economic incentives to ensure accurate data feeds and effective governance. Members of the Api Three Dow guarantee the accuracy of the data provided by Api Three, backed by a risk coverage protocol. By staking Api Three tokens in a staking pool, participants can govern the protocol and have a say in how data is chosen and used. The text also highlights the significance of transparency and accountability in blockchain data feeds, emphasizing the use of first-party data sources and decentralized governance through a DAO."}, {"title": "3. Comparison of First Party Oracle and Third Party Oracle Providers: Understanding the Differences between Chain and Oracle", "summary": "This text discusses the role of the Dow and API three token holders in governance, as well as the challenges of operating a decentralized protocol. It emphasizes the importance of meeting milestones and aligning with the goals outlined in the white paper. The text also discusses the presence of hierarchy and structure within core protocol development teams. It mentions the concept of pods or sub teams/sub downs as a potential innovative structure implemented by Dow. The article also explains the concept of an air node and how it functions within the API3 ecosystem, providing a seamless solution for API providers."}, {"title": "4. Incentivizing Data Accuracy and Governance in Api Three: The Future of Oracle in a More Secure and Transparent Model", "summary": "This text emphasizes the importance of selecting a reliable data feed and conducting internal tests to ensure accuracy. It discusses the process of constructing data feeds and the request-response flow in Chainlink. It introduces Beacon scores and sets, which provide real-time updates on asset prices. The launch of Beacon sets is mentioned as an upcoming development. The text also mentions the benefits of regular exercise for physical and mental health. It highlights the importance of accurate price data for businesses. Additionally, it discusses potential issues with inaccurate data in blockchain systems and the difficulty in identifying malicious behavior."}, {"title": "5. The Role of Dow and API Three Token Holders in Governance: Decentralized Decision-Making in a DAO", "summary": "This text discusses the potential vulnerability of relying solely on Api three for payouts in risk coverage protocols. It suggests using third party arbitration services as an additional layer of appeals. The text also discusses the use of third party arbitration protocols in verifying the accuracy of information provided by error nodes and APIs. The partnership with Cla, a third party arbitration service, is highlighted. The text compares API data retrieval tools and emphasizes the cost advantages of using first party Oracle for data feed construction. It also mentions the cost-effectiveness of the QG service for requesting cheap random numbers on L2 chains. The text discusses the concepts of D APIs and service coverage and mentions a partnership to provide free quantum random number generators on a blockchain."}, {"title": "6. The Importance of Data Feed Selection and Risk Coverage: Ensuring Accurate Data in Blockchain", "summary": "This text discusses the importance of affordable land and collaboration in higher education. It emphasizes the need to stay focused on the main subject, quantum entanglement. The text also explores the concept of service coverage and its relationship with APIs, highlighting the importance of accurate and reliable data in making informed decisions. It discusses the challenges of ensuring reliable data in blockchain and the limited availability of certain types of data. The text emphasizes the value of relying on a single, reputable source for accurate data and mentions the ability of app developers to request specific data feeds."}, {"title": "7. The Importance of Third Party Arbitration in Risk Coverage Protocols: Partnership with Cla and the Benefits of their Arbitration System", "summary": "This text discusses the use of Air Nodes in data development and the transition to MagnetNet. It mentions the lack of live data feeds for projects on Poly and the challenges of monitoring a decentralized protocol. The benefits of open source and permissionless protocols are highlighted, along with potential use cases for Api three in the insurance and decentralized gaming industries. The text also discusses the potential division of D5 into permission and non-permission categories and the importance of a first-party Oracle system for identity verification."}, {"title": "8. Staying on Topic During an Interview: The Importance of Reliable Data in Blockchain", "summary": "This text provides information on where to find general information and resources about API 3, including their website and Discord channel. The author also offers assistance with protocol data usage and suggests following the official API 3 Twitter account for updates. The text discusses the untapped use cases for Oracle technology in the decentralized finance (DeFi) industry and the need to address misconceptions about API 3 and Oracle. It also discusses the potential for expanding the scope of off-chain data in the DeFi space. The text highlights the use cases of API 3 beyond cryptocurrency prices and the differences between Web 2 and Web 3. The speaker emphasizes the need for comprehensive guides and tutorials in the Web 3 ecosystem and invites collaboration from developers. The text also emphasizes the scarcity of developer talent in the blockchain industry and provides an opportunity to learn more about API 3."}]}