{"podcast": {"title": "Polygon Alpha Podcast", "host": "Justin Havens", "image": ""}, "episode": {"title": "Importance of Oracles in DeFi | Tellor Oracle Protocol | Nicholas Fett | Polygon Alpha Podcast", "number": "15", "date": "SEP 16, 2022", "description": "", "url": "https://www.youtube.com/watch?v=15xrqqAnGMY", "speakers": {"0": "Justin Havens", "1": "Matt Hougan"}, "file": "september16.mp3"}, "transcripts": [{"speaker": "0", "podcast": "Hello everyone. Welcome to the Poly gon alpha podcast. Where the Poly gon community gathers insights from today's leaders decentralized finance Crypto and web three. I'm your host, Justin Havens, a aka Crypto. Let's get started. On today's installment of Poly alpha, we are joined by Nicholas Pet. Nicholas is the Cto of the teller or the tele oracle protocol. Teller is an Oracle system where parties can request the value of an off chain data point and minors compete to add this value to an on chain data bank. Hey, Nick. How are things going? ", "start": 0, "end": 41.69301}, {"speaker": "1", "podcast": "Thanks for. Great. Yeah. Thanks for having me Justin. ", "start": 42.33233, "end": 44.33021}, {"speaker": "0", "podcast": "Yeah. Thanks for being here. First, we wanna get started on your background, Nick. What is your background? You do have a pretty interesting background and how did that bring you to the crypto space specifically Oracle? ", "start": 44.969532, "end": 57.47353}, {"speaker": "1", "podcast": "Yeah. I mean, it was kind of a long winding road, I guess. But the the background, so I I got into Crypto early on, I was out soon. I know some people know I was on working with, like, the Ron Paul campaign, and this was back in twenty twelve and Got into bitcoin. And kinda stayed in for a while started of day trading it, like most people, and then I actually got a job working at the Cf ftc. Like any good libertarian working for the government is as a regulator here in the Us. So I was I worked on futures markets derivatives markets. As a researcher there And part of my job there was doing crypto stuff. So I In twenty seventeen, I left there to do a decentralized derivatives protocol. So I was going to be doing we were calling a Dax beck then and basically, you needed you needed away to how do you make these long short tokens, which is what we were trying to do. So it might sound simple now, but this was like twenty seventeen and you wanted to be able to bet on, like, if you wanted to go short bitcoin with a token or long long bitcoin. On some sort of leverage basis. And it what we realized in twenty seventeen is that this is a super cool, easy to build sort of system that a lot of people are doing now, but there was no way to get off chain data in. So you to our example, if you wanted to bet on the price of at bitcoin, How do you know what the price and bitcoin is? A smart contract can't just go read an Api. So you need some way to do that And that... That's what we call the Oracle problem is. How do the blockchain or specifically a smart contract? Know about some specific off information. Namely, you know, most of the cases are pricing events or, you know, you could you can imagine an events, like, if you wanted to bet on who won a sports game or something like that. How how does the blockchain or a smart contract? No. Well you need Oracle to do that. There were no real good protocols around them. And so we decided we would deep dive into the problem and we thought we came up with a pretty cool solution and that became teller. So yeah, here here we are. We launched Teller in twenty thousand nineteen, and ", "start": 59.00365, "end": 189.81999}, {"speaker": "0", "podcast": "we've just kind of been iterating on it and trying to grab some some usage ever since. Yeah. And you've you've already touched on some things that I definitely wanna dig into a little bit more. Like the idea that block can't necessarily pull data into the blockchain, it has to be pushed from an outside party or or a different party to get that information. And But actually, I think before we talk about that, can you just kinda walk us through the history of Oracle and maybe dig in a little bit deeper on the Oracle problem and why those workers are important? ", "start": 190.43999, "end": 222.74944}, {"speaker": "1", "podcast": "Sure. I mean, the history it it doesn't go back much farther than that. You know, some people have talked about like, oracle on Bitcoin, like on some reddit posts way back in the day. But usually, know, people started talking, you know, once you start building these smart contracts, you need ways to interact, you wanna be able to read an Api and have the smart contract release some sort of funds or do some action based upon some external events. So the question is always like, how do you get that information. You know, so to our example of if we're betting on the price of Bitcoin, you and I, we can place some money into a smart contract. On Poly gun. And this more contract will say pay out you know, all the money to you if the Bitcoin price goes up in a week and all the money to me if the Bitcoin price goes down and And so there... There's not really whoever gets to say what that bitcoin price is at the end of the week. Basically decides who wins or loses all of the money. And this is the problem. So you can... What are sort of the various oracle that you could do? Well you could use a centralized oracle, So we could just say, like, Okay. Me and you who's somebody that we trust, You know, like, our our Ceo Brenda, like, maybe we both trust her. She can be our oracle. We'll just may maybe that works for you. The problem is is maybe I know her better and maybe she she'll, you know, swing things a little bit my way. I don't know. The other solution would be... Well, okay. Well, we don't trust one specific third party, Maybe we could use a multi sig. So you have two... We we can each pick three three or four people and and then everybody places a price of bitcoin in. And and that's that's a little bit better, but this is still it's sort of corrupt entities. And then there's lastly, you know, like, how how we started thinking about it? Is like, how do you actually make something in a decentralized fashion. Like, what does it actually mean for something to be decentralized? So there isn't this sort of centralized point of failure in the system? And in our minds, the way that we looked at as well, a, anybody should be able to participate and there should be some sort of crypto economic sort of security there. So, you know, this is how blockchain work. In general, you have, you know, proof of work as people spending energy and spending hash power and whoever spends the most it to say what what the right way is and same with proof of stake, you know, you if you lie. Based on some consensus mechanisms you lose money and how could we build oracle on that? And this sort of goes into some of the earlier kind of back to your history. Question. You know, some of the early oracle designs were were things like prediction markets, which you could use as is oracle designs. So you can think about, like Au was one of the first Oracle as a prediction market. The way that A would work is somebody would come up with a question, so you could say, I don't know, like, let's say let's say is Joe Biden, president. This is an easy one. And then we we could all... You would take your ether or in their case, it was called rep, and you would place it on yes or no. And so you you if if Joe Biden his president, you believe it you would place it on the yes. And then at the end of some period, if you were on the side with the majority of the money, you would basically that that would be considered the answer. Side with the majority of the money. And anybody on the other side would lose all of their money and it would get distributed to the people on the majority side. And that's that's a very simple Oracle. Of course, it's slow and it takes some... You know, a lot of human inputs and and questions, but it's sort of that basic concept of like, let's just put money on the right answer that people have been iterating on ever since and it's something not teller sort of has continued to do. Yeah. It sounds like it's just a way ", "start": 223.46294, "end": 457.32236}, {"speaker": "0", "podcast": "to determine factual data in a trust minimized way factual actual data that's off chain in a trust minimized way. Otherwise, you would use the graph for indexing information, on the blockchain. But like you said, like the price of bitcoin or the price of Ether and Usd the ethereum blockchain doesn't necessarily know that answer. It has to be pushed to it. It only knows that guess, like, you could you could use Usd dc or like a uni swap t swap. And I think that might be good to explain as can you explain exactly what a t w is and how it complains to... Or how it compares to a ", "start": 458.09616, "end": 500.16998}, {"speaker": "1", "podcast": "decentralized oracle like T? Well, so the t ups, you you could also make the argument they're decentralized. A t up is just a time weighted average price. So the the t ops on on uni swaps swap. So this was back to the the question of, like, how do you get a price. So this is basically just for price oracle. You know, if you wanted to an Us dollar price. The easiest way that you would do it is like a better of teller or a trade link would do is they would go grab the price from Say Coinbase based Api or coin market cap Api and then they would put it on chain for you. The other way to do it, as you mentioned is uni swap, so you could look at what's the current price on Uni swap as far as the Dc price and that's a valid price. That was like the Uni swap v one Oracle. In v two and v three, they've sort of made it more robust. To be T w oracle. So this would be like what's the current price on uni swap, or you would basically now take an average of the last thirty minutes of prices, and that is your price. So what if you look at what's the average price over the last thirty minutes on a Uni swap price, that would be your Dollar price and that there's pros and cons to doing it. That way, it is decentralized in that sort of open for anyone to participate, but there are reasons that you probably don't wanna use ", "start": 500.71, "end": 582.35}, {"speaker": "0", "podcast": "that as your oracle. I guess, like, from a from an asset that has a little bit lower liquidity in a uni swap pool, there's the chance of ", "start": 582.9466, "end": 590.3844}, {"speaker": "1", "podcast": "manipulation of that t walk price potentially? Correct. Yeah. I mean, if you have very little liquidity, it's super easy to attack. You know, it's just... You can easily... As people know, you you can easily... If you have enough money move the price on uni swap pool to what it shouldn't be. But even so I actually I I did I did a recent podcast with another with To, who's who's a researcher in the space and he was researching uni all Oracle and The more there's like deeper attacks that you can go to. So there's like simple like just market manipulation trading. But like, the ones that you really have to worry about are like these Me related ones, to like a minor we'll get two blocks in a row, and basically, for those two blocks, he can, like, just throw the price to whatever he wants. And then back down to his act... The actual price and then that that is included now in the average. So if the miner can get those two blocks together, he'll be able to basically throw the Uni off price to whatever he wants. In the T ops, and it can be very, very dangerous. And this is a problem that even still exists in proof of steak. So, you know, this is... People are still figuring out how to use Uni swap Oracle correctly. What we actually recommend people doing if there are people thinking about it. Like, the benefit of using a swap Oracle is actually that it's very, very cost efficient. So, like, you're just reading something that's already on the blockchain. Nobody needs to pay as two put said information on Shane. It's already there. But at the same time, it's easily manipulated. So a lot of times what you can do and we've seen this structure is you can use the swap price. And then as long as it's within, say a percent of the teller price or a percent of some other oracle price. And then you know, like, okay. So you have up to date oracle price within a little range, and then you sort of have the fall back to... Okay. Well, nobody's gonna manipulate it really far because it's it's sort of peg in a way. Yeah. Almost like a sanity check. Yep. And just even those those, like, best practices or something that, you know, we we we try and help users do, like to you know, have other oracle checking things, even if you wanted to to have something a little bit faster or, you know, on change. Absolutely. That makes sense. So let's talk about Teller specifically. Like how ", "start": 591.40265, "end": 742.9149}, {"speaker": "0", "podcast": "does the teller validation process work and how do you align because that there are a lot of different parties involved in Teller? And, like, how do you align the incentives of all these parties to act truthfully? ", "start": 743.2949, "end": 755.4699}, {"speaker": "1", "podcast": "Yeah. Well, this is, you know, this is like crypto crypto economics like one zero one? Like, how do you incentivize people to act truthfully fully and honestly. And To be honest, like, you you basically just assume that everybody is this like neutral actor that cares about money. This is, you know, how you sort of map out all. Maybe maybe it's just life in general. Right? But this is sort of how you map it all out? Do you assume that people just care about money and they don't wanna lose money. So if if you... The the way the teller works, just to give a sort of a high level overview, care we have what are called reporters. They come and they stake T tokens. They will stake. Right now, it's about two thousand dollars worth of teller tokens. In a smart contract, and then they're allowed to be reporters. So then if you wanted say the Bitcoin price on Jane, you would come and you'll say, hey, reporters. I'll pay whoever puts the price of bitcoin on chain five dollars. Just this is just an example. Now all of those reporters are going to erase to basically submit set bitcoin price on chain in order to grab your five dollars. If that price is... Now what happens is everybody can see what price whoever whatever reporter. So let's say it was me, I I placed the price on chain. Everybody can see it. Everybody looks at it. And if it's a good price, it just stays on chain, you can use it and read it. If it's a bad price, you or probably one of the other reporters who's monitoring it more closely we'll dispute it. So they'll pay a small fee and say, hey, this is a wrong price. That price will get pulled off chain. The next reporter, you... Your five dollar still hasn't come to me yet. So the next reporter will place the hopefully valid price of the bitcoin on Jane, and you'll just use that one next. As far as what happened to me in my bed, value that went over to our governance contract, So that's what happens during a dispute and will have a vote basically. So the teller system, which comprises of users who get a vote. So the people who paid that five dollar tip, the reporters themselves, they get a portion of the vote, and then the token holders, they vote on whether this was a good value or a bad value and whether or not I should lose my two thousand dollars. And that's a simple way of how tele works. Anybody can participate. Anybody can request data and Yeah. It's a nice little simple crypto economic system. But I think as you said, like, how do you incentivize people to to do the right thing. You you would basically assume that reporters don't wanna lose money, and you assume that you as the user also ", "start": 756.2038, "end": 918.79846}, {"speaker": "0", "podcast": "want good data and don't wanna lose money by disputing things that shouldn't be disputed. Well, it's like they also have the risk... Not only do they have the risk of losing money, but they have the risk of... It's like they can lose part of their stake. Correct the reporters can, and then they also miss out on the financial incentives of pushing that accurate price on change. So it's kinda like you hit it from both sides. You you hit their wealth and you hit their wet revenue, I guess, at the same time, potentially. But I guess like, where are these reporters getting that price speed from? Because there there can be a lot of ambiguity in those prices? Like like like we're saying with a big bitcoin price, Like, if they're pulling that data from coinbase base versus bin or maybe like a a lower liquid exchange. There's gonna be some, I guess, like, differences. In the prices that could be reported. So how do you determine which one is ", "start": 919.17566, "end": 979.0644}, {"speaker": "1", "podcast": "the accurate or the truthful price in that sense, Well, this is a super tough question for Oracle in general. Because, like, there is no way to know programmatic... On chain. What a correct price is just because if you knew what the correct price you wouldn't Oracle obviously. So there there sort of has to be some sort of subject to in it, and it... It actually comes down to how the user defines the question. So whenever you asked for... What is the price of bitcoin? That's a very vague question. You know, like, we could agree, like, you know, let's say the price right now is twenty thousand dollars. If you put on twenty thousand dollars and fifty cents, that's probably just fine. Nobody's what is gonna dispute you over that. If you put down twenty one thousand dollars, maybe there's a little bit... Maybe it was fine on some exchanges. And there is sort of that a little bit of ambiguity. However, what what we tell users is if you want more specific data, you have to request it. So you know, like ample fourth is one. They're they're one of our users on on Ethereum and they have a specific... They want a twenty four hour T w from these specific exchanges, and that's how they define the data. So you know you know, that they can tell if if you're off by half a percent you can tell pretty easily on the data. Whereas, you know, most people, if if you just wanted... What's the price of ethereum? It it may be more open to I guess subject. But it's also a good thing. So there there there comes a trade off in it. Because if you wanted the more sort of specific you get, actually, you increase, I guess the ability of your data to be censored. So if you if you would say, like, what's the price of Bitcoin app on coinbase or according to the Coinbase Api. The problem with that statement is now the coinbase Api could potentially shut off or they could potentially say, you know, if your report... The Coinbase based Api cannot be used in teller contracts or something like that and there could be regulatory your risks. There... And you basically just centralize your entire. Data feed processed by relying on this one single entity. Whereas if you say what's a valid bitcoin price, although it's more vague, if coinbase shuts down, I have plenty of other ways divide develop bitcoin price. So ", "start": 979.8332, "end": 1136.9036}, {"speaker": "0", "podcast": "trade offs for sure. Yeah. And I guess the... One other thing is... So let's say, like, I... I'm a developer and I need the price of Bitcoin for my app and I wanna use the tele protocol. And so I I pay these five dollars, you know, theoretical five dollars. However much it cost to get that feed. Is it just whoever submits the price first? Is it the reported that submits first, that gets the reward? ", "start": 1137.2759, "end": 1162.85}, {"speaker": "1", "podcast": "Yes. So the it's as simple as that a lot of the reporters now have Me bots going where they're literally front running each other. To submit it. So it gets very, very competitive. So the issue comes down and... So the way that teller works is you can stay multiple times for an ad. Risk. So if if you have two thousand dollar stake, you can report once every twelve hours. If if you have four thousand dollars, now you can report twice every twelve hours. And so the more that you have stake, the more that you can report and do the competition. ", "start": 1163.65, "end": 1202.1727}, {"speaker": "0", "podcast": "That's it's really interesting. So what what are the name uses for teller today that you're seeing? I would assume that prices of assets would be number one, and but then you what other I guess, unique data feeds are getting sent or requested, I guess, through the t protocol. ", "start": 1203.1292, "end": 1219.3307}, {"speaker": "1", "podcast": "Yeah. So the biggest one is price feeds, I think that's just Oracle in general. The other thing we're starting to see is some cross chain messaging. So If you didn't know bridges, so anytime that you talk from, you know, from Avalanche to Ethereum, that's off chain information on each of those systems. So, like, they they don't know, you know, it might as well be the coinbase base Api. So those need Oracle. So anytime there's a bridge that's an Oracle as well and you're starting to see some people pass message data back and forth. You know, other things besides prices. It's sort of a price like we saw somebody somebody recently is during the gas price on chain. So if you want like, historical gas prices. You can you can get that so you can compensate users for how much they paid in gas on something. Other cool things are so more flexible question. So we're working with Diva protocol and Poly gun, they're a prediction market over there. So they let you bet on token prices, but then also on any arbitrary event. And you can use dollar for that system as well. And then yeah, I think those are some of the fun ones. Where we're starting to see some... Build some stuff with some privacy things as well. So you can past zero knowledge proofs of pieces back and forth from chains. So you can add in some some privacy ", "start": 1220.1443, "end": 1302.2172}, {"speaker": "0", "podcast": "inside of bridging applications and and those are super cool ones. Yeah. I did kinda wanna touch on z tape Z k tech and how that might have a potential future within the tele protocol because I I think the way that you described it previously is, you know, you've got a reporter that submits this price information on chain, but then it can be disputed and then it goes to I guess, a vote by token holders or other reporters. I'm not really sure about that. But that seems to me like, a in optimistic Oracle. Yeah. But is there... So gosh I got a lot of questions there, actually. First my first question is gonna be like, how does that voting work? Like, who gets the votes on? You know, was that a fair accurate price that the reporter pushed to the blockchain. And so... Yeah, who votes on that? First, that that'll be my first question. So it's... ", "start": 1304.0276, "end": 1355.9849}, {"speaker": "1", "podcast": "So we actually have the vote right now, so we'll use Poly gong because that's a Poly podcast. So the way currently where some Poly gun is is you have twenty five percent goes to the token holders. So Tellers open holders on Poly gun. Then twenty five percent goes to the users. So every time so you tipped five dollars. You have five dollars worth of vote power. If somebody else has tipped a hundred dollars, they have a hundred dollars worth of V power. So it goes towards the users. Just sort of pro rat based on how much they tip. And then it's the reporter. So every time somebody reports on Poly gun, they get extra sort of vote weight in the system. And then the last piece that we still have over on Poly is the team gets part of the vote. So ", "start": 1356.7849, "end": 1398.6788}, {"speaker": "0", "podcast": "the teller team just just balancing it out over there. That makes sense. And so okay, kind of what we're talking about, like, optimistic versus Z k Yeah. This does seem like a more of an optimistic design because I guess, it feels like you've got prove that the price was fraudulent. And then on the Z k side, And this is something that I've talked with talked about with people in the space, like, if you have optimistic oracle, can you also have zero knowledge or and I think you deal with the issue of, like, validity proofs? And I'm I'm... I don't really understand, like, who are you validating that information two. I guess if that makes sense at all? Like, is there a room in the space for Z k Oracle or does that even make sense with this type of technology? ", "start": 1399.5488, "end": 1441.2465}, {"speaker": "1", "podcast": "It it depends on what you're actually doing, You know, because that's... It makes it really hard for so what are you signing? As far as, like, what what's the specific piece of information that you're proving actually happened. So, you know, because you could if if you... People have talked about, like, you you could probably do Api requests that way. So you you could have, like, you know, something to do with, like, You you can prove that this specific value came out of an Api. But like, we we can do that. And and then so, like, you could put that on shane, and then you know with a hundred percent proof that like that value came from that Api at this time. And that would be really cool and helpful to put on. The problem is that doesn't necessarily mean that's valid bitcoin price because we know Apis spit out weird things. So is it a good may maybe it could work in conjunction with a lot of other pieces, but it basically just pushes the trust. It could push the trust to, say the ", "start": 1441.8734, "end": 1507.2926}, {"speaker": "0", "podcast": "Api provider, which maybe you want to do that there would be pros and cons to doing that. Yeah. And I also wanna talk about and you mentioned this earlier how oracle are being used more and more for bridge security. And it it kinda of reminds me of kind of the example that you said earlier in the sense that you know, you and I are using Brenda as our oracle to determine the price of Bitcoin that reminds me a little bit of what happened with wormhole. Right? Like the wormhole bridge that got hacked was like, it was very centralized, but well, and not that the reason that the wormhole bridge went down, or was split, had anything to do with centralization. It was just a bug in the contract but it it was a very it is a very centralized team and that has risk, but there are ways to do, I guess, optimistic Oracle with with bridges, which is becoming a trend. So how how can Tele help with the security of bridges? It's actually a shame almost in the space, like, ", "start": 1508.0824, "end": 1566.0845}, {"speaker": "1", "podcast": "all these bridge hacks and very few of them actually have to do with the fact that they're all just completely centralized You know, it's all just normal smart contract hacks, and it's like, no. Like, we actually just need some some decent centralization in here too. But, yeah. Like, the the way that tele good help with bridges is, right, right now, most bridges run via just multi six. There a handful of people who are controlling hundreds of millions of dollars bridged across these protocols. And it's just not... You know, it's it's not safe in the sense that these few people could run away with a whole lot of money. And it's just not safe and if they're not gonna run it, just from a hacking perspective. The way that Teller could sort of help with this is if if you wanna pass information from chain to chain, you could just use teller. So tell her on each side and could move information back and forth, or you could as you you could even use a farther optimistic approach to where you could use a multi sig to move information, but then you you have an option for if anything goes bad, you pause the system and fall back and Now tell is your bridge. So Teller has to push the stuff back. Back and forth. And that could... It would slow it down, but at the same time, you wouldn't have some of these issues that that we sort of talked about if if these keys are compromised. So a lot of different things you do. I think one of the big problems with bridges right now is similar to how we were talking, like, with Teller, you you can't use the data instantly with Teller. So once I put it on chain, you have to wait for people to check whether or not it's valid and if people want to dispute it. So we tell people to wait, you know, ten, twenty minutes, you know, run a script to check it of themselves depending on what it is or how hard it is to check. But with bridges, a lot of people want it really, really fast. You know, they want to click deposit and then click withdraw on the bridge five seconds later. And it it's really a problem because, like, things don't move that fast. Like... It's just a bad idea. You know, we... This was actually weren't people talking about wormhole haul. You know, the tale had even written about on Twitter about how wormhole was subject to an attack because it was such a fast bridge that it could have been profitable to lock a bunch of money on Salon, traded it around and then revert the whole E chain and to make to make it look like that no money ever got sent over to that bridge because they were moving such volumes and that attack could have happened and it didn't happen because they got hacked another way. But, you know, like, just moving really, really quickly on these bridges, like, they don't even take into account that, like, the chain is been finalized by the time you're unlocking it on some secondary chain. ", "start": 1566.8826, "end": 1738.0945}, {"speaker": "0", "podcast": "Yeah. That's yeah, that's that's really interesting. But, you know, in relation to Teller, what keeps you up at night with T? Like, if someone really wanted to break the protocol, like, what what could they do? Hypothetically. ", "start": 1739.1305, "end": 1755.4579}, {"speaker": "1", "podcast": "We're sort of easy to censor as far as like, if you just disputed every value that came through teller, you'd blow, like, a few hundred thousand dollars every hour. I think I think I think we calculate out, like you'd blow like, seven hundred fifty grand at the current price. Every hour just to to keep... Like, if you wanted to prevent somebody from updating the Eth price. You could do it for, like, seven or fifty grand in an hour. That wouldn't be a worst case scenario. You know, like, we know that people can do that and it's just like, you gotta calculate that it. But Yeah. I mean, some of the some of the bigger pieces is, you know, it's still It's still relatively early as far as even for any protocol. You. Like, we're... Like, we don't have you're still subject in a lot of ways to the forces of the market. You, like we have a token price. And how much of the token price is determined by what we actually do and how the protocol works versus sort of forces of the market is that's always scary. You know, Like, we... Because you you can see, like, all of your all of the value in your system sort of go away based on fu or, regulatory rumors and things like that. And it's just sort of a fear in the space in general. You know, like a lot of this stuff. It's... Yeah. I mean, probably regulatory issues as far as that goes, You know, like the the Tornado cash thing that came out. Whenever you talk, you know, if they... If I'm in the Us. Assuming you're in the Us as well. You know, Like, if they came out and we're like, oh, you know, like, you crypto now illegal or, like, candidate edited. You can't you can't withdraw more than ten thousand dollars and given month out of crypto, you know, like, it would just kill the space in general. And that's like, what I really hope they don't do. So I guess that's not really tele specific, but ", "start": 1756.177, "end": 1876.7303}, {"speaker": "0", "podcast": "Yeah. Are there any regulatory concerns that are teller or just Oracle specific in general that you can think of? Some of the bigger ones have to do with like, ", "start": 1877.8397, "end": 1885.8306}, {"speaker": "1", "podcast": "it more depends not for us, but for the protocols. So Poly market had a really interesting one. Poly market a prediction market. I think I think like like their name would imply Their on Poly as well. And they they had an issue where They got charged by the Cf for being a un prediction market, which they our prediction market and they're un, so it's sort of fit. But at the same time, in in the sort of action against them in the settlement. They... One of the reasons was that they were resolving their own markets. So they they were their own oracle. Which the Cf took as that's a sign that you're centralized, it need to come in and register. So that's what we would, you know, you you could make the jump then... Okay. Well, so if the regulators don't like. If you're settling your own markets, then your obviously, centralized and needs to go register. Well, what happens if you take that oracle piece of resolving markets and get it to, you know, our example Brenda? Those Brendan now have to go register as said prediction markets and she controls which way the money goes. The answer is we don't know. It's completely unclear. But what we do know is that if you're using Teller at least teller is a decentralized protocol and, you know, we can't shut that down even if we wanted to, so at least you're safe there, Whereas if you used, say you know, a more centralized oracle, and the Cf seats to force them to go register. They'd probably just stop reporting prices to your app, which would not be good. Yeah. And ", "start": 1886.5642, "end": 1992.2856}, {"speaker": "0", "podcast": "I think there... There's been an interesting conversation going around the space related to oracle also that has to do with leveraging Oracle technology to combat disinformation, not necessarily just in the crypto space, but just in general. I know like, true inflation has been a proposed solution to, you know, actually tracking the the true price of inflation and not necessarily just what's reported. What are your thoughts on leveraging the Oracle tech to do that To combat that dis some sorts of information? ", "start": 1993.3104, "end": 2024.012}, {"speaker": "1", "podcast": "Yeah. You definitely can. But the the... It's more of like a data science problem. So this was actually... So, like... My c founder and I Brenda We actually met we were working at the bureau of labor statistics. So I I we were she she used to work on the inflation numbers. And then I... We we met working on the employment numbers. So, like, you know, the the Us employment and It was so we we know all about that disinformation. But the the general... It's really hard problems when it comes to it. Specifically, because, you know, when you look at, like, true inflation or any of these numbers, you can push that stuff on chain, but a a lot of the hard problem comes into, like, how do you source all of that data? You know, like it turns into more of, like, a we need blockchain to scale sort of problem. And then Oracle can work a little bit better. Because right now, you know, like, the the Us government, whatever they do, like the inflation survey. You know, there's like, they they have people all over the Going around under down various prices at various grocery stores and going on different websites and things like that. It's a very labor intensive survey. So how do you incentivize people to do something that labor intensive? It gets really, really difficult. So Yeah. And even just, you know, like, we had talked... Whenever you look at like, the true inflation numbers, a lot of times, like there's all of these prices that you sort of want to calculate out the total inflation number. And the problem is like, it's it's still expensive to push things to change. You gotta pay a quarter even each time, it's... It it adds up really really quickly. So how often do you wanna do that? Yeah. That was another question I had ", "start": 2024.665, "end": 2135.8816}, {"speaker": "0", "podcast": "just related to some of the challenges of being a fast oracle and just kinda of thinking of the scalability, tri in general and how that applies to Oracle as well. Like, do you have apps that are requesting data, like on a block by block basis? Because I think that would just... Oh, you do. I just feel like that would be way too expensive no matter what the the da would be. I guess if it's on ", "start": 2136.336, "end": 2159.6675}, {"speaker": "1", "podcast": "a lower cost change like like Poly gun, maybe it is a little bit more cost effective. But yeah just just wanna get your thoughts Yeah. So like we get this question a lot like, hey, how, you know, we're trying to do a per contract or something like that. And then we need we need the the price of these coins updated every second. And you're like, listen guys. ", "start": 2160.0435, "end": 2178.9685}, {"speaker": "0", "podcast": "Like, ", "start": 2179.5254, "end": 2179.8435}, {"speaker": "1", "podcast": "you just can't do that like, a, there... There's, you know, you just get noise a lot of times, you know, like, prices, crypto prices move back and forth all the time. But like, the the problem is these blockchain chains barely move that fast. And and it's just expensive. So whenever you run the numbers, like, you know, tellers one of the cheaper Oracle to actually post data and store it. But if you want to store like a price on chain, it's it's gonna cost you two hundred. Gas on an E chain. So, like, what does that come out with? Like, well right now on mainland net it's, you know, ten dollars. To go store it. Like, that's that's really expensive on Main net. So if you wanna store one price and it's ten dollars like, man, this is how many times do you need to update this, I guess. How many times you really want this price updated, if it's gonna cost you every ten dollars every time you need to tell people that and you know, they they they run the math and they're were like, oh, man, if I wanted this every single... Even even every like, ten seconds or something like that, it's gonna cost me. You know, a hundred thousand dollars a month or something like that. And they're like, alright. We'll we'll come up with a new solution. And and a lot of times that's one of our protocols build it that way. That... That's whenever they end up relying on say, like a uni swap or something that theoretically has an up to date block update. ", "start": 2180.5596, "end": 2259.7048}, {"speaker": "0", "podcast": "Block by block update at the price. So it's just easily manipulated and they they get they're problems that way. Yeah. Yeah. That I think that's that's difficult. Like I could see, like, something from a a stable coin standpoint that is peg to the Dollar. Like, do you necessarily need a block by block price update related to that? I I would say probably not? But then, like, other more volatile assets like bitcoin in ethereum, I can see, especially like from a a per situation it needs to be more... ", "start": 2260.739, "end": 2290.293}, {"speaker": "1", "podcast": "Definitely more frequent than I don't know, every ten blocks or something like that. Right? Mh Yeah. And and I think it just comes down to what we're trying to build on these systems. You know, what what was Tele trying to be an Oracle. You know, we we wanted to be an Oracle that was was built for protocols that actually want to be decentralized and be secure. You know, you... Were we're not trying to compete it if you wanna be an oracle on a thousand x per contract like, that's... It's a different problem. You could say that than being an Oracle, how do you get information on chain in a trust fashion. And and that... And that's really what we're trying to do. We're trying to be there for people who they're trying to build on this real real use cases on top of these systems that... And they need something that cannot be censored. They actually care about the fact that ", "start": 2291.231, "end": 2342.3447}, {"speaker": "0", "podcast": "nobody can shut this thing down. And that's why you would use Teller. Yeah. That makes sense. And so where are you seeing a lot of demand like, are you... I guess, like, specifically to Poly. Are you seeing a lot of demand to use for Da to use Teller on Poly gun. I know you talked about D protocol and we talked about Rico shay earlier before this. Like, what's Rico shay using the protocol for? ", "start": 2342.7812, "end": 2365.0447}, {"speaker": "1", "podcast": "Rico shay is a dollar cost averaging? Protocol. So they use super fluid over there. I think you guys have talked. But they're super cool, so they allow you to dollar cost average into some various tokens. And in order to do that, they need to know what the price of some of these tokens are. Us dollar terms, so they'll use tellers to to grab those prices and it's super cool. ", "start": 2365.7625, "end": 2388.9155}, {"speaker": "0", "podcast": "But are are you seeing more demand just outside of those two? Yeah. For sure. I mean, Is awesome. So, like, we have this ", "start": 2389.5518, "end": 2395.3118}, {"speaker": "1", "podcast": "we have a really unique insight into, like, what chains people are using because anytime somebody's building on one of these chains, so a lot of these protocols need oracle so that they reach out to us and they're like, hey, are you going home this chain. And you you know, we saw Poly gun was one of the first people that you actually started seeing a lot of volume. On as far as a different chain, probably around last year. Mh Whereas, you know, like, for for every, like, you know, we'll we'll get a request or to one ar arbitrage or an optimism. But you see, like, ten over on Poly. And it's just... They're like, loads away as far as what people are actually using and that's really awesome. And the thing that people usually want. So They usually like teller for more custom data. So chain link pushes prices currently on Poly gone. And if you need one of those prices, you can probably use Chain link because it's free for you to just read that some of those prices on Chain link. Which makes it a really tough business... From from business standpoint for us as far as charging people for it. But chain posts slows for free. But a lot of times what happens is is people will want more custom data. So another user we're working with is... So if you know O protocol, we're calculating out a toxicity number for them. So they're looking at not something that's just they use chain for the prices, but then they needed this more custom thing as far as, okay. Well, how how risk you're highly leveraged are some of these loans? Or some of these assets that we're putting into our protocol. And so they they talked... Came and talk to us about, okay, Well, can you guys calculate out this... They call it a toxicity number as far as what's what's dangerous about it and then danielle yellow for there. But you know, so we we've seen some of those and same with a lot of protocols, if right now, if if you want a new chain link that So if you want price feed up on Poly gong for a chain link price feed. Do the way the way that you do that is you, you have to go contact chain link and talk to them off chain and sign something and sometimes it takes weeks or months for them to to get it up And a lot of times if you're a very small pro and don't have money to pay them, they they won't push your price feed. Whereas teller we don't care. Our reporters are pretty much glut for the five dollar tip. So if you can if if you're willing to to pay a little bit of probably it's more like a quarter tip over on Poly gun. Usually basically just have to cover their gas costs. If you're willing to to pay for it, and we know how to get the data, we'll put it on chain, and it we can... You know, if it's a new spot price or something, you can be up and running later today with a new spot price, which which makes it a much more attractive option than having to contact somebody and wait for quite a while to get it up and running. I actually just had the Ob skies on the podcast, ", "start": 2396.3977, "end": 2585.8467}, {"speaker": "0", "podcast": "Gary and Daniela. So that'll probably be published. Week before this one gets published or a few days before this one gets... Smart guys. They're good. They're very smart. They're very sharp. Excited to for what they're building. And glad to hear the y'all partnering with them on that. We we don't use the. We don't use the. I was to say, even call a partnership because they can just just open source permission list. They can just ", "start": 2586.4028, "end": 2609.1707}, {"speaker": "1", "podcast": "request data? Well, they're not using this yet. This is something. I don't know when they will. It was just That's all that's that's probably different. You know, we've... We shy away from the partnership term where just because everybody in the space throws it around willy nilly. Like, we we want people actually integrating us in the code and that's what hopefully people can see in the longer and go go look at the code. ", "start": 2609.7227, "end": 2635.9062}, {"speaker": "0", "podcast": "That makes sense. So a couple of other things. I know we talked about price speeds, bridges, prediction markets. There there were two other subjects I wanted to touch on related to teller and and Oracle. And that's cross chain, automated market makers, which is... I I guess you could also just kind of throw that in the bridge category, but it it is a little bit different, and then I also wanna touch on insurance because I know that I I feel I personally feel like that's something that's very much needed in the Device space is a little bit more robust insurance ecosystem, for the S you know, experience to really thrive. But you do run into the oracle problem related to insurance protocols calls. So ", "start": 2637.1177, "end": 2680.584}, {"speaker": "1", "podcast": "if you could just touch on those two real quick. Yeah. So Cross Are a great case for for teller specifically and I mean, even any any sort of oracle protocol that that the hard part about doing new cross chain Am is just messaging back and forth. You know, like if you can think about, like, the hard part about, like, why why can't you have a smart contract that works on both chains and it's like, the messaging back and forth is the hard part. So anytime, it's it's these cross Am, it it has to do with? Well, how do you sort of get messages back and forth and do that. And... Yeah. So I I think Teller definitely does. I think what a lot of people have to do is slow down some of what they're trying to build, you know, similar to like bridges in general when you're doing cross j. Anytime you're doing cross jane anything, there there's not final on strange, so it's it's gonna be slower than if you're doing it on uni swap, It just... It's the way it has to work. So we'll see if they eventually take off. I think it's definitely the future. Like, I think, you know, in five years, like, you know, five years ago from now, like, we what were we rolling with, like, Ether Delta was the the king of decentralized exchanges back then. It was, you know, it was very, very early and you you have to we've come a very long way to now it's basically the biggest T five players are trading on Indexes every day. And I think in five years time, you're gonna look at this and you're gonna see. Okay. Like derivatives markets are just cross chain. Like all these exchanges, they're just cross chain. They use Oracle, and it's actually decentralized too. So it's not, you, like similar similar to, like, peep we had fast chains back in twenty seventeen. They were, like you know, the eos of the world and things like that that were just natively like super centralized. But now like, in twenty twenty two, like, No, We actually have fast chains that are decentralized. We can do that now. The technology has gotten there. And I think in five more years, you know, people are gonna realize how to actually use oracle properly in you're gonna have decentralized communication across these chains and trading is is is just gonna be seamless. It will be also. As far as insurance goes, we're working with... We're talking with a few insurance protocols, but the big problem with decentralized insurance is... The hard part is that decentralized word, namely because who's allowed to participate in buying the insurance is is always tough because if you know, the question is always, how do you know what's insurance fraud? How do you handle insurance fraud? So if you have an insurance on some D five protocol, well what prevents the maker of set protocol from buying insurance on it or something like that. And and does it does it cause any issues? Maybe, the other part with, you know, more specific insurance, you know, like people have always used like, in the ethereum world, Like, you can build flight insurance. Or like, train insurance or something like that. And the problem with those are a lot of times it's very specific nuance events. So, like, how do you know how many people actually know what happened. So like, did a like it delayed. Sometimes there was an Api. Sometimes there's not an Api Sometimes it's very hard to find information on that. So who can actually accurately vote on the dispute. It can be very difficult to have this sort of information really public. And in order for, like, tellers of work to its maximum extent, like you want everybody to know, this is a bad price. We can all vote that it was a bad price. If you can't do that, and it's like, well, did this happen. I don't know. John was the only guy there. Probably doesn't really, you know, make for an effective voting system and we everyone would just be like I guess, trust John. ", "start": 2681.12, "end": 2915.9219}, {"speaker": "0", "podcast": "Yeah. That goes back to our Brenda example where you just have one person as our... ", "start": 2916.7324, "end": 2920.3108}, {"speaker": "1", "podcast": "I guess, oracle of truth? Right. Yeah. And most things in the real world Like, a lot of things in the real world are bad things to actually put on chain because there's so few people that actually can know or verify that information. Also had a question about ", "start": 2921.5833, "end": 2935.8413}, {"speaker": "0", "podcast": "just the term, teller. What's the... Do is there a story behind the name or does it have any significance from a branding perspective Oh, I mean, there was a little ", "start": 2936.2983, "end": 2945.9065}, {"speaker": "1", "podcast": "little bit of like the Fortune teller aspect. And then Or for the Oracle. But it was... We had originally made this to tell her was a repo under our last firm with Dax. Which, you know, we we did, like Dax axiom was Ax value in Greek and decentralized value and we had all this meaning behind the name and then we launch Teller without thinking about it too much. ", "start": 2947.321, "end": 2972.2354}, {"speaker": "0", "podcast": "And that became the main brand which is good. I think it's a good meme. Taylor like a teller, like a fortune Teller and the are for Oracle. Yeah. That makes that makes sense to me. I guess, like, another question I had was just what are some of the... And and you touched on this a little bit earlier, but like, what are some of the challenges that you feel like oracle are facing today? Or what are some of the challenges that guess that y'all have gone through throughout the time that you'll have been deployed to now. ", "start": 2973.1116, "end": 3001.7104}, {"speaker": "1", "podcast": "I mean, there's a lot of challenges as far as you know, so we're a system that has voting in the protocol? I'm sure. As you know, getting anyone to vote. Or or really sort of partake in in governance has been very, very difficult. This is a problem that's unique to sell in any way, shape or form. Just finding people who care about in and are doing so in a good manner. That's not sort of self serving or trying to just pump their own bags. You really want... You know, like, I I want the best for teller and and sort of a lot of people out there. But you find a lot of times it can be relatively shorts sighted, especially, you know, we're a protocol with a token? So having a token just navigating some of those aspects of a lot of times people care more about your token than your actual project. And and that can be fun, but it can be stressful in certain ways. You know, like you end up wasting a lot of time on dealing with people who just care about the token rather than you know, the cool protocol that you've made, which is sort of should be the goal. That's a bull market mentality. This is the bear market. Everyone just cares about the projects now. Right? Hopefully, well, I mean, we have we had some fun last week where our price halved for no reason and then and then you started getting you started getting some messages from people. They're like, I heard the news. Are you guys okay and there were... Apparently rumors going around that the founder or or brenda went to prison. And that that she rubbed everyone. And and we're like, no. No. Like, what's... We we don't know where we're like, this is new for us, so we had to, you know, dispel rumors that we were in jail. Was ", "start": 3002.3457, "end": 3106.6663}, {"speaker": "0", "podcast": "That's funny. And you mix such a good point to about just token voting in general and how it's definitely not the best way to get things like this done. But it's just the best way that we have right now? Like, can you, like, speculate you or think about any other alternative solutions outside of Token voting. ", "start": 3107.779, "end": 3126.5046}, {"speaker": "1", "podcast": "Well, I mean, that's like we've tried to, you know, we we have the users. We have the reporters. We have you know, people have done delegates and things like that. You you want people to care about it, you do. And I don't... And I think the more you can just minimize that. In a lot of ways, like, it's okay to have user input. Because the same would sort of come into... You know, like you're starting to see this this in some ways like with ethereum. You know, people have been talking about, like, I'm sure you followed, like, the whole L discussion. Like, should we... You know, like, if if L holds ninety percent of steak teeth or something like that or Coinbase base and L do and then they want to start censoring transactions to Tornado cash, which could we do? That's like, oh, god. You know, Like, this is bad. Well, the actual answer is like, we all know. It's like, you do like a a soft work and you you what could you you take them all out of the chain, like, sorry for thanks for playing, go away. And And it's one of those things where you start to realize that at some level, like blockchain in general. We all know it that it is this consensus mechanism And there is this social layer to it. And oracle are sort of the same aspect. So there is this sort of social layer to Oracle and what is the right answer. And what is a wrong answer. So just due to the fact that definition. It's a social layer. You need people actually interacting and caring about it. It's not just a piece of software that you can interact with. So you... You know, it's almost good every once in a while to have these reminders to people like, you actually have to care and and interact with this thing. Like, it's it's not just this mindless piece of software, like, you actually matter as a person and as a voice in the system. So trying to make sure that that that doesn't get lost over the years it's gonna be. I think that's gonna be one of our biggest challenges. ", "start": 3127.5386, "end": 3243.8416}, {"speaker": "0", "podcast": "I couldn't agree more. I think you made a lot of really good once there we're kind of running up on time, so we can't... Don't really have a lot of time of figure to them necessarily. But too bad. Maybe at another time, but But, yeah. I guess just so I don't hold you for too long. Are there any topics that you wanted to talk about that we didn't get a chance to address necessarily. ", "start": 3244.4, "end": 3264.6404}, {"speaker": "1", "podcast": "No. Not really. I I think... Yeah. It was super fun. I I think, you know, like, the one thing that we're working on right now with Teller. We're making another big upgrade here over the next month. So we're throwing away in the past, I know you had talked about like things that we've learned over the years and in the past, we we did have, like, ways to upgrade the protocol via. So we had we have a dow for voting on these things. And we're formally getting rid of the dow where... The only thing that Teller the only voting on anything will be used for for those disputes and it'll be sort of specific by chain. And the reason for that is, you know, like, we've we've tried to... How can we be as decentralized as possible. And you knowing that those structures are really hard to work and that they're... They actually just introduce risks. The way that we ultimately want it to work is, you know, you have a Poly on system. And if if the Poly system breaks, the main net users actually don't care. If if the main net users system breaks, like the Poly one users are are okay and same with, like, even more down to a granular level if if you're... If you want the eighth price on Poly gun and somebody else wants the bitcoin person on Poly gun, everybody's incentivized to help each other, but if somebody breaks the East price, it doesn't break your bitcoin price. It still works. And and the reason is is, you know, like with the oracle, that there's nothing sort of preventing somebody from saying, like, like you you and I, like, on the Bitcoin price contract. Like, we could easily start a contract that says, like, let's place ten billion dollars into this pool. This betting pool that settles on the teller price. Well, like, I'll be the first to say that if you put ten thousand dollars into a pool settling on a teller oracle price like, somebody will break our protocol for that ten million dollars like we are not secure up to that amount. And there's nothing that we as a protocol could do to prevent somebody from making that contract. The only thing that we can do is make sure that if somebody makes that really dangerous contract, it doesn't sort of trash the whole system, it just breaks this one specific vote, somebody can run away with those ten billion dollars and then leave our system alone. So we're trying to think about that, you know, like, if somebody is going to attack it. Do you sort of minimize these risk damages and make it as hard to attack obviously at the same time? ", "start": 3265.295, "end": 3400.5767}, {"speaker": "0", "podcast": "Yeah. But that leads to another really good point is that, like, the more decentralized you are as a protocol, the more difficult it is to scale. And that just goes back to the scalability, try limit too. I think like liquidity with their Token, it runs into similar issues. Right? And it's just... It's something that we can't think out over time, I think and that's just the thing is that it's it's going to take time. In adoption, I I think as well. But, yeah, Nick, this was this was really fun. And before we head out, I just want you to let the audience know, you know, where can they go to find out more about you and teller. So I mean, the big place teller dot io o. It's our website. ", "start": 3401.2947, "end": 3443.7031}, {"speaker": "1", "podcast": "Come join us on discord. It's where we hang out. You can follow us on Twitter. We are teller, or I'm the Man nine on Twitter. So you don't follow me. Spicy crypto economic tweets. It's fun. Exciting. ", "start": 3445.388, "end": 3458.364}, {"speaker": "0", "podcast": "Yeah. And to everyone who is listening and watching. Thank you for listening in watching Youtube, Apple, Spotify, subs, subscribe. Please subscribe. So you can get more Poly alpha in your day. Nick, thanks again for joining us and We'll see you next time. And thanks, See. ", "start": 3459.7996, "end": 3481.6655}], "summaries": [{"title": "1. The Evolution of Decentralized Finance and the Teller Oracle Protocol", "summary": "This text discusses the role and importance of decentralized oracles in the blockchain ecosystem. It explores the Oracle problem in smart contracts and the development of Teller as a solution. The text also discusses the significance of trust minimized data and the need for reliable Oracle systems. It explains the concept of decentralized oracles, specifically focusing on price oracles on UniSwap. The text highlights the potential drawbacks and dangers of using UniSwap as a price oracle, emphasizing the need for caution and additional oracle checking methods. Overall, it provides insights into the development and significance of decentralized oracles in the blockchain space."}, {"title": "2. Challenges and Solutions in the Teller Validation Process and Price Reporting", "summary": "This text discusses the challenges of aligning incentives in the Teller validation process and ensuring truthful reporting. It explains the Teller system, which incentivizes accurate data reporting through staking and rewards. The text highlights the risks faced by reporters in financial markets and the difficulty of determining accurate prices for cryptocurrencies. It also explores the use of oracles in facilitating cross-chain messaging and providing price feeds. The author raises questions about the voting process in the Teller protocol and the potential for zero knowledge oracles. Overall, the text emphasizes the need for clarity and further exploration in these areas."}, {"title": "3. The Impact of Climate Change, Centralization, and Regulatory Concerns on Blockchain Technology", "summary": "Climate change is negatively impacting global food production and food security, particularly in vulnerable regions. Urgent action is needed to mitigate these effects. The text also discusses the challenges and risks associated with using APIs for obtaining information, the potential advantages and disadvantages of using Oracle for bridge security, the vulnerabilities of decentralized bridges, and the need for a stable regulatory environment in the cryptocurrency industry. It also explores the potential use of Oracle technology to combat disinformation and the difficulties in sourcing data for inflation numbers. The article concludes by highlighting the importance of real-time coin price updates for contract purposes."}, {"title": "4. Storing Price Data, Code Integration, and Cross-Chain Communication in Blockchain Systems", "summary": "This text discusses the challenges and significance of storing price data on the blockchain. It highlights the use of oracles like Tellor as a cheaper alternative for posting and storing data. The text emphasizes the importance of block by block price updates in cryptocurrency trading and the need for decentralized and secure oracles. It also discusses the demand for using Teller on Poly Gun and its relevance to Rico Shay's protocol. The text mentions the growing demand for alternative options in various industries and the popularity of Polygun. It also addresses the challenges of achieving effective cross-chain communication and decentralized insurance in the blockchain industry."}, {"title": "5. Diversity, Branding, and User Engagement in the Teller Protocol Upgrade", "summary": "This text discusses the limitations of token voting as a method of decision-making and suggests exploring alternative solutions. It highlights the need for user engagement and care in blockchain and oracle systems. The text also discusses Teller's upgrade to their protocol, aiming for decentralization and minimizing risks. It addresses the challenges of scaling decentralized protocols and emphasizes the importance of adoption. The author invites readers to join a community for engaging discussions and promises to provide interesting content on cryptocurrency and economics."}]}